   - [#   1] AOR MRTD: 
--------------------------------------------------------------------------------
   12:     """
   13:     if c.isdigit():
   14:         return int(c)
   15:     elif (c.isalpha() and c.isupper()):
-  16:         return (ord(c) - ord('A')) + 10
+  16:         return (ord(c) + ord('A')) + 10
   17:     elif c == '<':
   18:         return 0
   19:     else:
   20:         raise ValueError(f'Invalid MRZ character: {c}')
--------------------------------------------------------------------------------
[0.00781 s] killed by test_mixed_alphanumeric (tests.test_calculate_check_digit.TestCalculateCheckDigit)

   - [#   2] AOR MRTD: 
--------------------------------------------------------------------------------
   12:     """
   13:     if c.isdigit():
   14:         return int(c)
   15:     elif (c.isalpha() and c.isupper()):
-  16:         return (ord(c) - ord('A')) + 10
+  16:         return (ord(c) - ord('A')) - 10
   17:     elif c == '<':
   18:         return 0
   19:     else:
   20:         raise ValueError(f'Invalid MRZ character: {c}')
--------------------------------------------------------------------------------
[0.00808 s] killed by test_mixed_alphanumeric (tests.test_calculate_check_digit.TestCalculateCheckDigit)

   - [#   3] AOR MRTD: 
--------------------------------------------------------------------------------
   31:     '''
   32:     (sum1, sum2) = (0, 0)
   33:     for c in data:
   34:         value = _char_to_value(c)
-  35:         sum1 = (sum1 + value) % 255
+  35:         sum1 = (sum1 - value) % 255
   36:         sum2 = (sum2 + sum1) % 255
   37:     checksum = (sum2 << 8) | sum1
   38:     return checksum % 10
   39: 
--------------------------------------------------------------------------------
[0.00775 s] killed by test_birth_date_reference (tests.test_calculate_check_digit.TestCalculateCheckDigit)

   - [#   4] AOR MRTD: 
--------------------------------------------------------------------------------
   31:     '''
   32:     (sum1, sum2) = (0, 0)
   33:     for c in data:
   34:         value = _char_to_value(c)
-  35:         sum1 = (sum1 + value) % 255
+  35:         sum1 = (sum1 + value) * 255
   36:         sum2 = (sum2 + sum1) % 255
   37:     checksum = (sum2 << 8) | sum1
   38:     return checksum % 10
   39: 
--------------------------------------------------------------------------------
[0.00750 s] killed by test_birth_date_reference (tests.test_calculate_check_digit.TestCalculateCheckDigit)

   - [#   5] AOR MRTD: 
--------------------------------------------------------------------------------
   32:     (sum1, sum2) = (0, 0)
   33:     for c in data:
   34:         value = _char_to_value(c)
   35:         sum1 = (sum1 + value) % 255
-  36:         sum2 = (sum2 + sum1) % 255
+  36:         sum2 = (sum2 - sum1) % 255
   37:     checksum = (sum2 << 8) | sum1
   38:     return checksum % 10
   39: 
   40: 
--------------------------------------------------------------------------------
[0.00757 s] killed by test_mixed_alphanumeric (tests.test_calculate_check_digit.TestCalculateCheckDigit)

   - [#   6] AOR MRTD: 
--------------------------------------------------------------------------------
   32:     (sum1, sum2) = (0, 0)
   33:     for c in data:
   34:         value = _char_to_value(c)
   35:         sum1 = (sum1 + value) % 255
-  36:         sum2 = (sum2 + sum1) % 255
+  36:         sum2 = (sum2 + sum1) * 255
   37:     checksum = (sum2 << 8) | sum1
   38:     return checksum % 10
   39: 
   40: 
--------------------------------------------------------------------------------
[0.00764 s] killed by test_mixed_alphanumeric (tests.test_calculate_check_digit.TestCalculateCheckDigit)

   - [#   7] AOR MRTD: 
--------------------------------------------------------------------------------
   34:         value = _char_to_value(c)
   35:         sum1 = (sum1 + value) % 255
   36:         sum2 = (sum2 + sum1) % 255
   37:     checksum = (sum2 << 8) | sum1
-  38:     return checksum % 10
+  38:     return checksum * 10
   39: 
   40: 
   41: def scan_mrz():
   42:     '''Stub: simulate scanning a passport MRZ. Hardware scanner not available.'''
--------------------------------------------------------------------------------
[0.00830 s] killed by test_birth_date_reference (tests.test_calculate_check_digit.TestCalculateCheckDigit)

   - [#   8] AOR MRTD: 
--------------------------------------------------------------------------------
  157:         raise ValueError('expiration_date must be exactly 6 characters')
  158:     
  159:     
  160:     doc_type_padded = document_type.ljust(2, '<')
- 161:     names_field = (surname + '<<') + given_names
+ 161:     names_field = (surname - '<<') + given_names
  162:     names_field = names_field[:39].ljust(39, '<')
  163:     line1 = (doc_type_padded + issuing_country) + names_field
  164:     
  165:     
--------------------------------------------------------------------------------
[5.00706 s] timeout

   - [#   9] AOR MRTD: 
--------------------------------------------------------------------------------
  157:         raise ValueError('expiration_date must be exactly 6 characters')
  158:     
  159:     
  160:     doc_type_padded = document_type.ljust(2, '<')
- 161:     names_field = (surname + '<<') + given_names
+ 161:     names_field = (surname + '<<') - given_names
  162:     names_field = names_field[:39].ljust(39, '<')
  163:     line1 = (doc_type_padded + issuing_country) + names_field
  164:     
  165:     
--------------------------------------------------------------------------------
[5.00684 s] timeout

   - [#  10] AOR MRTD: 
--------------------------------------------------------------------------------
  159:     
  160:     doc_type_padded = document_type.ljust(2, '<')
  161:     names_field = (surname + '<<') + given_names
  162:     names_field = names_field[:39].ljust(39, '<')
- 163:     line1 = (doc_type_padded + issuing_country) + names_field
+ 163:     line1 = (doc_type_padded - issuing_country) + names_field
  164:     
  165:     
  166:     personal_number_padded = personal_number[:14].ljust(14, '<')
  167:     
--------------------------------------------------------------------------------
[5.00705 s] timeout

   - [#  11] AOR MRTD: 
--------------------------------------------------------------------------------
  159:     
  160:     doc_type_padded = document_type.ljust(2, '<')
  161:     names_field = (surname + '<<') + given_names
  162:     names_field = names_field[:39].ljust(39, '<')
- 163:     line1 = (doc_type_padded + issuing_country) + names_field
+ 163:     line1 = (doc_type_padded + issuing_country) - names_field
  164:     
  165:     
  166:     personal_number_padded = personal_number[:14].ljust(14, '<')
  167:     
--------------------------------------------------------------------------------
[5.00697 s] timeout

   - [#  12] AOR MRTD: 
--------------------------------------------------------------------------------
  174:     line2_partial = \
  175:         \
  176:         \
  177:         \
- 178:         ((((((((passport_number + str(cd_passport)) + country_code) + birth_date) + str(cd_birth)) + sex) + expiration_date) + str(cd_expiration)) + personal_number_padded) + str(cd_personal)
+ 178:         ((((((((passport_number - str(cd_passport)) + country_code) + birth_date) + str(cd_birth)) + sex) + expiration_date) + str(cd_expiration)) + personal_number_padded) + str(cd_personal)
  179:     
  180:     
  181:     
  182:     
--------------------------------------------------------------------------------
[5.00664 s] timeout

   - [#  13] AOR MRTD: 
--------------------------------------------------------------------------------
  174:     line2_partial = \
  175:         \
  176:         \
  177:         \
- 178:         ((((((((passport_number + str(cd_passport)) + country_code) + birth_date) + str(cd_birth)) + sex) + expiration_date) + str(cd_expiration)) + personal_number_padded) + str(cd_personal)
+ 178:         ((((((((passport_number + str(cd_passport)) - country_code) + birth_date) + str(cd_birth)) + sex) + expiration_date) + str(cd_expiration)) + personal_number_padded) + str(cd_personal)
  179:     
  180:     
  181:     
  182:     
--------------------------------------------------------------------------------
[5.00586 s] timeout

   - [#  14] AOR MRTD: 
--------------------------------------------------------------------------------
  174:     line2_partial = \
  175:         \
  176:         \
  177:         \
- 178:         ((((((((passport_number + str(cd_passport)) + country_code) + birth_date) + str(cd_birth)) + sex) + expiration_date) + str(cd_expiration)) + personal_number_padded) + str(cd_personal)
+ 178:         ((((((((passport_number + str(cd_passport)) + country_code) - birth_date) + str(cd_birth)) + sex) + expiration_date) + str(cd_expiration)) + personal_number_padded) + str(cd_personal)
  179:     
  180:     
  181:     
  182:     
--------------------------------------------------------------------------------
[5.00642 s] timeout

   - [#  15] AOR MRTD: 
--------------------------------------------------------------------------------
  174:     line2_partial = \
  175:         \
  176:         \
  177:         \
- 178:         ((((((((passport_number + str(cd_passport)) + country_code) + birth_date) + str(cd_birth)) + sex) + expiration_date) + str(cd_expiration)) + personal_number_padded) + str(cd_personal)
+ 178:         ((((((((passport_number + str(cd_passport)) + country_code) + birth_date) - str(cd_birth)) + sex) + expiration_date) + str(cd_expiration)) + personal_number_padded) + str(cd_personal)
  179:     
  180:     
  181:     
  182:     
--------------------------------------------------------------------------------
[5.00959 s] timeout

   - [#  16] AOR MRTD: 
--------------------------------------------------------------------------------
  174:     line2_partial = \
  175:         \
  176:         \
  177:         \
- 178:         ((((((((passport_number + str(cd_passport)) + country_code) + birth_date) + str(cd_birth)) + sex) + expiration_date) + str(cd_expiration)) + personal_number_padded) + str(cd_personal)
+ 178:         ((((((((passport_number + str(cd_passport)) + country_code) + birth_date) + str(cd_birth)) - sex) + expiration_date) + str(cd_expiration)) + personal_number_padded) + str(cd_personal)
  179:     
  180:     
  181:     
  182:     
--------------------------------------------------------------------------------
[5.01099 s] timeout

   - [#  17] AOR MRTD: 
--------------------------------------------------------------------------------
  174:     line2_partial = \
  175:         \
  176:         \
  177:         \
- 178:         ((((((((passport_number + str(cd_passport)) + country_code) + birth_date) + str(cd_birth)) + sex) + expiration_date) + str(cd_expiration)) + personal_number_padded) + str(cd_personal)
+ 178:         ((((((((passport_number + str(cd_passport)) + country_code) + birth_date) + str(cd_birth)) + sex) - expiration_date) + str(cd_expiration)) + personal_number_padded) + str(cd_personal)
  179:     
  180:     
  181:     
  182:     
--------------------------------------------------------------------------------
[5.00931 s] timeout

   - [#  18] AOR MRTD: 
--------------------------------------------------------------------------------
  174:     line2_partial = \
  175:         \
  176:         \
  177:         \
- 178:         ((((((((passport_number + str(cd_passport)) + country_code) + birth_date) + str(cd_birth)) + sex) + expiration_date) + str(cd_expiration)) + personal_number_padded) + str(cd_personal)
+ 178:         ((((((((passport_number + str(cd_passport)) + country_code) + birth_date) + str(cd_birth)) + sex) + expiration_date) - str(cd_expiration)) + personal_number_padded) + str(cd_personal)
  179:     
  180:     
  181:     
  182:     
--------------------------------------------------------------------------------
[5.00898 s] timeout

   - [#  19] AOR MRTD: 
--------------------------------------------------------------------------------
  174:     line2_partial = \
  175:         \
  176:         \
  177:         \
- 178:         ((((((((passport_number + str(cd_passport)) + country_code) + birth_date) + str(cd_birth)) + sex) + expiration_date) + str(cd_expiration)) + personal_number_padded) + str(cd_personal)
+ 178:         ((((((((passport_number + str(cd_passport)) + country_code) + birth_date) + str(cd_birth)) + sex) + expiration_date) + str(cd_expiration)) - personal_number_padded) + str(cd_personal)
  179:     
  180:     
  181:     
  182:     
--------------------------------------------------------------------------------
[5.00847 s] timeout

   - [#  20] AOR MRTD: 
--------------------------------------------------------------------------------
  174:     line2_partial = \
  175:         \
  176:         \
  177:         \
- 178:         ((((((((passport_number + str(cd_passport)) + country_code) + birth_date) + str(cd_birth)) + sex) + expiration_date) + str(cd_expiration)) + personal_number_padded) + str(cd_personal)
+ 178:         ((((((((passport_number + str(cd_passport)) + country_code) + birth_date) + str(cd_birth)) + sex) + expiration_date) + str(cd_expiration)) + personal_number_padded) - str(cd_personal)
  179:     
  180:     
  181:     
  182:     
--------------------------------------------------------------------------------
[5.01029 s] timeout

   - [#  21] AOR MRTD: 
--------------------------------------------------------------------------------
  179:     
  180:     
  181:     
  182:     
- 183:     overall_data = (line2_partial[0:10] + line2_partial[13:20]) + line2_partial[21:43]
+ 183:     overall_data = (line2_partial[0:10] - line2_partial[13:20]) + line2_partial[21:43]
  184:     cd_overall = calculate_check_digit(overall_data)
  185:     
  186:     line2 = line2_partial + str(cd_overall)
  187:     
--------------------------------------------------------------------------------
[5.01057 s] timeout

   - [#  22] AOR MRTD: 
--------------------------------------------------------------------------------
  179:     
  180:     
  181:     
  182:     
- 183:     overall_data = (line2_partial[0:10] + line2_partial[13:20]) + line2_partial[21:43]
+ 183:     overall_data = (line2_partial[0:10] + line2_partial[13:20]) - line2_partial[21:43]
  184:     cd_overall = calculate_check_digit(overall_data)
  185:     
  186:     line2 = line2_partial + str(cd_overall)
  187:     
--------------------------------------------------------------------------------
[5.00822 s] timeout

   - [#  23] AOR MRTD: 
--------------------------------------------------------------------------------
  182:     
  183:     overall_data = (line2_partial[0:10] + line2_partial[13:20]) + line2_partial[21:43]
  184:     cd_overall = calculate_check_digit(overall_data)
  185:     
- 186:     line2 = line2_partial + str(cd_overall)
+ 186:     line2 = line2_partial - str(cd_overall)
  187:     
  188:     return (line1, line2)
  189: 
  190: 
--------------------------------------------------------------------------------
[5.00796 s] timeout

   - [#  24] AOR MRTD: 
--------------------------------------------------------------------------------
  218:             'match': match})
  219:     
  220:     
  221:     
- 222:     overall_data = (line2[0:10] + line2[13:20]) + line2[21:43]
+ 222:     overall_data = (line2[0:10] - line2[13:20]) + line2[21:43]
  223:     overall_expected = str(calculate_check_digit(overall_data))
  224:     overall_stored = line2[43]
  225:     overall_match = overall_expected == overall_stored
  226:     if not overall_match:
--------------------------------------------------------------------------------
[5.00855 s] timeout

   - [#  25] AOR MRTD: 
--------------------------------------------------------------------------------
  218:             'match': match})
  219:     
  220:     
  221:     
- 222:     overall_data = (line2[0:10] + line2[13:20]) + line2[21:43]
+ 222:     overall_data = (line2[0:10] + line2[13:20]) - line2[21:43]
  223:     overall_expected = str(calculate_check_digit(overall_data))
  224:     overall_stored = line2[43]
  225:     overall_match = overall_expected == overall_stored
  226:     if not overall_match:
--------------------------------------------------------------------------------
[5.00940 s] timeout

   - [#  26] COD MRTD: 
--------------------------------------------------------------------------------
   61:         if len(line) != 44:
   62:             raise ValueError(
   63:                 f'{name} must be exactly 44 characters, got {len(line)}')
   64:         
-  65:         if not (_MRZ_PATTERN.match(line)):
+  65:         if _MRZ_PATTERN.match(line):
   66:             raise ValueError(
   67:                 f'{name} contains invalid characters (only A-Z, 0-9, \'<\' allowed)')
   68:     
   69:     
--------------------------------------------------------------------------------
[0.00934 s] killed by test_decode_deu_passport (tests.test_decode_mrz.TestDecodeMRZ)

   - [#  27] COD MRTD: 
--------------------------------------------------------------------------------
  124:     Raises ValueError if required fields are missing or fixed-length fields are wrong.
  125:     """
  126:     
  127:     for field in _REQUIRED_ENCODE_FIELDS:
- 128:         if (field not in fields or not (fields[field])):
+ 128:         if (field in fields or not (fields[field])):
  129:             raise ValueError(f'Required field {field} is missing or empty')
  130:     
  131:     
  132:     document_type = fields['document_type'].upper()
--------------------------------------------------------------------------------
[0.00823 s] killed by test_encode_fra_passport (tests.test_encode_mrz.TestEncodeMRZ)

   - [#  28] COD MRTD: 
--------------------------------------------------------------------------------
  124:     Raises ValueError if required fields are missing or fixed-length fields are wrong.
  125:     """
  126:     
  127:     for field in _REQUIRED_ENCODE_FIELDS:
- 128:         if (field not in fields or not (fields[field])):
+ 128:         if (field not in fields or fields[field]):
  129:             raise ValueError(f'Required field {field} is missing or empty')
  130:     
  131:     
  132:     document_type = fields['document_type'].upper()
--------------------------------------------------------------------------------
[0.00917 s] killed by test_encode_fra_passport (tests.test_encode_mrz.TestEncodeMRZ)

   - [#  29] COD MRTD: 
--------------------------------------------------------------------------------
  208:     
  209:     for (field_name, data, stored_digit) in checks:
  210:         expected = str(calculate_check_digit(data))
  211:         match = expected == stored_digit
- 212:         if not match:
+ 212:         if match:
  213:             all_match = False
  214:         fields.append({\
  215:             'field_name': field_name, \
  216:             'expected': expected, \
--------------------------------------------------------------------------------
[0.01048 s] killed by test_validate_all_correct_usa (tests.test_validate_mrz.TestValidateMRZ)

   - [#  30] COD MRTD: 
--------------------------------------------------------------------------------
  222:     overall_data = (line2[0:10] + line2[13:20]) + line2[21:43]
  223:     overall_expected = str(calculate_check_digit(overall_data))
  224:     overall_stored = line2[43]
  225:     overall_match = overall_expected == overall_stored
- 226:     if not overall_match:
+ 226:     if overall_match:
  227:         all_match = False
  228:     fields.append({\
  229:         'field_name': 'overall', \
  230:         'expected': overall_expected, \
--------------------------------------------------------------------------------
[0.01087 s] killed by test_validate_all_correct_usa (tests.test_validate_mrz.TestValidateMRZ)

   - [#  31] COI MRTD: 
--------------------------------------------------------------------------------
    9: def _char_to_value(c):
   10:     """Convert an MRZ character to its numeric value.
   11:     Digits 0-9 -> 0-9, letters A-Z -> 10-35, '<' -> 0.
   12:     """
-  13:     if c.isdigit():
+  13:     if not (c.isdigit()):
   14:         return int(c)
   15:     elif (c.isalpha() and c.isupper()):
   16:         return (ord(c) - ord('A')) + 10
   17:     elif c == '<':
--------------------------------------------------------------------------------
[0.00786 s] killed by test_all_fillers (tests.test_calculate_check_digit.TestCalculateCheckDigit)

   - [#  32] COI MRTD: 
--------------------------------------------------------------------------------
   11:     Digits 0-9 -> 0-9, letters A-Z -> 10-35, '<' -> 0.
   12:     """
   13:     if c.isdigit():
   14:         return int(c)
-  15:     elif (c.isalpha() and c.isupper()):
+  15:     elif not ((c.isalpha() and c.isupper())):
   16:         return (ord(c) - ord('A')) + 10
   17:     elif c == '<':
   18:         return 0
   19:     else:
--------------------------------------------------------------------------------
[0.00706 s] killed by test_mixed_alphanumeric (tests.test_calculate_check_digit.TestCalculateCheckDigit)

   - [#  33] COI MRTD: 
--------------------------------------------------------------------------------
   13:     if c.isdigit():
   14:         return int(c)
   15:     elif (c.isalpha() and c.isupper()):
   16:         return (ord(c) - ord('A')) + 10
-  17:     elif c == '<':
+  17:     elif not (c == '<'):
   18:         return 0
   19:     else:
   20:         raise ValueError(f'Invalid MRZ character: {c}')
   21: 
--------------------------------------------------------------------------------
[0.00678 s] killed by test_all_fillers (tests.test_calculate_check_digit.TestCalculateCheckDigit)

   - [#  34] COI MRTD: 
--------------------------------------------------------------------------------
   57:     Validates input length and character set. Raises ValueError on invalid input.
   58:     '''
   59:     
   60:     for (name, line) in [('line1', line1), ('line2', line2)]:
-  61:         if len(line) != 44:
+  61:         if not (len(line) != 44):
   62:             raise ValueError(
   63:                 f'{name} must be exactly 44 characters, got {len(line)}')
   64:         
   65:         if not (_MRZ_PATTERN.match(line)):
--------------------------------------------------------------------------------
[0.00897 s] killed by test_decode_deu_passport (tests.test_decode_mrz.TestDecodeMRZ)

   - [#  35] COI MRTD: 
--------------------------------------------------------------------------------
   61:         if len(line) != 44:
   62:             raise ValueError(
   63:                 f'{name} must be exactly 44 characters, got {len(line)}')
   64:         
-  65:         if not (_MRZ_PATTERN.match(line)):
+  65:         if not ((not (_MRZ_PATTERN.match(line)))):
   66:             raise ValueError(
   67:                 f'{name} contains invalid characters (only A-Z, 0-9, \'<\' allowed)')
   68:     
   69:     
--------------------------------------------------------------------------------
[0.00763 s] killed by test_decode_deu_passport (tests.test_decode_mrz.TestDecodeMRZ)

   - [#  36] COI MRTD: 
--------------------------------------------------------------------------------
  124:     Raises ValueError if required fields are missing or fixed-length fields are wrong.
  125:     """
  126:     
  127:     for field in _REQUIRED_ENCODE_FIELDS:
- 128:         if (field not in fields or not (fields[field])):
+ 128:         if not ((field not in fields or not (fields[field]))):
  129:             raise ValueError(f'Required field {field} is missing or empty')
  130:     
  131:     
  132:     document_type = fields['document_type'].upper()
--------------------------------------------------------------------------------
[0.00913 s] killed by test_encode_fra_passport (tests.test_encode_mrz.TestEncodeMRZ)

   - [#  37] COI MRTD: 
--------------------------------------------------------------------------------
  140:     expiration_date = fields['expiration_date']
  141:     personal_number = fields.get('personal_number', '').upper().replace(' ', '<')
  142:     
  143:     
- 144:     if (len(document_type) < 1 or len(document_type) > 2):
+ 144:     if not ((len(document_type) < 1 or len(document_type) > 2)):
  145:         raise ValueError('document_type must be 1-2 characters')
  146:     if len(issuing_country) != 3:
  147:         raise ValueError('issuing_country must be exactly 3 characters')
  148:     if len(passport_number) != 9:
--------------------------------------------------------------------------------
[0.01110 s] killed by test_encode_fra_passport (tests.test_encode_mrz.TestEncodeMRZ)

   - [#  38] COI MRTD: 
--------------------------------------------------------------------------------
  142:     
  143:     
  144:     if (len(document_type) < 1 or len(document_type) > 2):
  145:         raise ValueError('document_type must be 1-2 characters')
- 146:     if len(issuing_country) != 3:
+ 146:     if not (len(issuing_country) != 3):
  147:         raise ValueError('issuing_country must be exactly 3 characters')
  148:     if len(passport_number) != 9:
  149:         raise ValueError('passport_number must be exactly 9 characters')
  150:     if len(country_code) != 3:
--------------------------------------------------------------------------------
[0.00912 s] killed by test_encode_fra_passport (tests.test_encode_mrz.TestEncodeMRZ)

   - [#  39] COI MRTD: 
--------------------------------------------------------------------------------
  144:     if (len(document_type) < 1 or len(document_type) > 2):
  145:         raise ValueError('document_type must be 1-2 characters')
  146:     if len(issuing_country) != 3:
  147:         raise ValueError('issuing_country must be exactly 3 characters')
- 148:     if len(passport_number) != 9:
+ 148:     if not (len(passport_number) != 9):
  149:         raise ValueError('passport_number must be exactly 9 characters')
  150:     if len(country_code) != 3:
  151:         raise ValueError('country_code must be exactly 3 characters')
  152:     if len(birth_date) != 6:
--------------------------------------------------------------------------------
[0.00924 s] killed by test_encode_fra_passport (tests.test_encode_mrz.TestEncodeMRZ)

   - [#  40] COI MRTD: 
--------------------------------------------------------------------------------
  146:     if len(issuing_country) != 3:
  147:         raise ValueError('issuing_country must be exactly 3 characters')
  148:     if len(passport_number) != 9:
  149:         raise ValueError('passport_number must be exactly 9 characters')
- 150:     if len(country_code) != 3:
+ 150:     if not (len(country_code) != 3):
  151:         raise ValueError('country_code must be exactly 3 characters')
  152:     if len(birth_date) != 6:
  153:         raise ValueError('birth_date must be exactly 6 characters')
  154:     if len(sex) != 1:
--------------------------------------------------------------------------------
[0.01072 s] killed by test_encode_fra_passport (tests.test_encode_mrz.TestEncodeMRZ)

   - [#  41] COI MRTD: 
--------------------------------------------------------------------------------
  148:     if len(passport_number) != 9:
  149:         raise ValueError('passport_number must be exactly 9 characters')
  150:     if len(country_code) != 3:
  151:         raise ValueError('country_code must be exactly 3 characters')
- 152:     if len(birth_date) != 6:
+ 152:     if not (len(birth_date) != 6):
  153:         raise ValueError('birth_date must be exactly 6 characters')
  154:     if len(sex) != 1:
  155:         raise ValueError('sex must be exactly 1 character')
  156:     if len(expiration_date) != 6:
--------------------------------------------------------------------------------
[0.00946 s] killed by test_encode_fra_passport (tests.test_encode_mrz.TestEncodeMRZ)

   - [#  42] COI MRTD: 
--------------------------------------------------------------------------------
  150:     if len(country_code) != 3:
  151:         raise ValueError('country_code must be exactly 3 characters')
  152:     if len(birth_date) != 6:
  153:         raise ValueError('birth_date must be exactly 6 characters')
- 154:     if len(sex) != 1:
+ 154:     if not (len(sex) != 1):
  155:         raise ValueError('sex must be exactly 1 character')
  156:     if len(expiration_date) != 6:
  157:         raise ValueError('expiration_date must be exactly 6 characters')
  158:     
--------------------------------------------------------------------------------
[0.00945 s] killed by test_encode_fra_passport (tests.test_encode_mrz.TestEncodeMRZ)

   - [#  43] COI MRTD: 
--------------------------------------------------------------------------------
  152:     if len(birth_date) != 6:
  153:         raise ValueError('birth_date must be exactly 6 characters')
  154:     if len(sex) != 1:
  155:         raise ValueError('sex must be exactly 1 character')
- 156:     if len(expiration_date) != 6:
+ 156:     if not (len(expiration_date) != 6):
  157:         raise ValueError('expiration_date must be exactly 6 characters')
  158:     
  159:     
  160:     doc_type_padded = document_type.ljust(2, '<')
--------------------------------------------------------------------------------
[0.00901 s] killed by test_encode_fra_passport (tests.test_encode_mrz.TestEncodeMRZ)
