   - [#  44] COI MRTD: 
--------------------------------------------------------------------------------
  208:     
  209:     for (field_name, data, stored_digit) in checks:
  210:         expected = str(calculate_check_digit(data))
  211:         match = expected == stored_digit
- 212:         if not match:
+ 212:         if not ((not match)):
  213:             all_match = False
  214:         fields.append({\
  215:             'field_name': field_name, \
  216:             'expected': expected, \
--------------------------------------------------------------------------------
[0.00954 s] killed by test_validate_all_correct_usa (tests.test_validate_mrz.TestValidateMRZ)

   - [#  45] COI MRTD: 
--------------------------------------------------------------------------------
  222:     overall_data = (line2[0:10] + line2[13:20]) + line2[21:43]
  223:     overall_expected = str(calculate_check_digit(overall_data))
  224:     overall_stored = line2[43]
  225:     overall_match = overall_expected == overall_stored
- 226:     if not overall_match:
+ 226:     if not ((not overall_match)):
  227:         all_match = False
  228:     fields.append({\
  229:         'field_name': 'overall', \
  230:         'expected': overall_expected, \
--------------------------------------------------------------------------------
[0.00964 s] killed by test_validate_all_correct_usa (tests.test_validate_mrz.TestValidateMRZ)

   - [#  46] CRP MRTD: 
--------------------------------------------------------------------------------
   12:     """
   13:     if c.isdigit():
   14:         return int(c)
   15:     elif (c.isalpha() and c.isupper()):
-  16:         return (ord(c) - ord('A')) + 10
+  16:         return (ord(c) - ord('mutpy')) + 10
   17:     elif c == '<':
   18:         return 0
   19:     else:
   20:         raise ValueError(f'Invalid MRZ character: {c}')
--------------------------------------------------------------------------------
[5.00530 s] timeout

   - [#  47] CRP MRTD: 
--------------------------------------------------------------------------------
   12:     """
   13:     if c.isdigit():
   14:         return int(c)
   15:     elif (c.isalpha() and c.isupper()):
-  16:         return (ord(c) - ord('A')) + 10
+  16:         return (ord(c) - ord('')) + 10
   17:     elif c == '<':
   18:         return 0
   19:     else:
   20:         raise ValueError(f'Invalid MRZ character: {c}')
--------------------------------------------------------------------------------
[5.00694 s] timeout

   - [#  48] CRP MRTD: 
--------------------------------------------------------------------------------
   12:     """
   13:     if c.isdigit():
   14:         return int(c)
   15:     elif (c.isalpha() and c.isupper()):
-  16:         return (ord(c) - ord('A')) + 10
+  16:         return (ord(c) - ord('A')) + 11
   17:     elif c == '<':
   18:         return 0
   19:     else:
   20:         raise ValueError(f'Invalid MRZ character: {c}')
--------------------------------------------------------------------------------
[0.00924 s] killed by test_mixed_alphanumeric (tests.test_calculate_check_digit.TestCalculateCheckDigit)

   - [#  49] CRP MRTD: 
--------------------------------------------------------------------------------
   13:     if c.isdigit():
   14:         return int(c)
   15:     elif (c.isalpha() and c.isupper()):
   16:         return (ord(c) - ord('A')) + 10
-  17:     elif c == '<':
+  17:     elif c == 'mutpy':
   18:         return 0
   19:     else:
   20:         raise ValueError(f'Invalid MRZ character: {c}')
   21: 
--------------------------------------------------------------------------------
[0.01007 s] killed by test_all_fillers (tests.test_calculate_check_digit.TestCalculateCheckDigit)

   - [#  50] CRP MRTD: 
--------------------------------------------------------------------------------
   13:     if c.isdigit():
   14:         return int(c)
   15:     elif (c.isalpha() and c.isupper()):
   16:         return (ord(c) - ord('A')) + 10
-  17:     elif c == '<':
+  17:     elif c == '':
   18:         return 0
   19:     else:
   20:         raise ValueError(f'Invalid MRZ character: {c}')
   21: 
--------------------------------------------------------------------------------
[0.00908 s] killed by test_all_fillers (tests.test_calculate_check_digit.TestCalculateCheckDigit)

   - [#  51] CRP MRTD: 
--------------------------------------------------------------------------------
   14:         return int(c)
   15:     elif (c.isalpha() and c.isupper()):
   16:         return (ord(c) - ord('A')) + 10
   17:     elif c == '<':
-  18:         return 0
+  18:         return 1
   19:     else:
   20:         raise ValueError(f'Invalid MRZ character: {c}')
   21: 
   22: 
--------------------------------------------------------------------------------
[0.00984 s] killed by test_all_fillers (tests.test_calculate_check_digit.TestCalculateCheckDigit)

   - [#  52] CRP MRTD: 
--------------------------------------------------------------------------------
   16:         return (ord(c) - ord('A')) + 10
   17:     elif c == '<':
   18:         return 0
   19:     else:
-  20:         raise ValueError(f'Invalid MRZ character: {c}')
+  20:         raise ValueError(f'mutpy{c}')
   21: 
   22: 
   23: def calculate_check_digit(data: str) -> int:
   24:     '''Calculate a check digit using the Fletcher-16 algorithm.
--------------------------------------------------------------------------------
[0.01297 s] survived

   - [#  53] CRP MRTD: 
--------------------------------------------------------------------------------
   16:         return (ord(c) - ord('A')) + 10
   17:     elif c == '<':
   18:         return 0
   19:     else:
-  20:         raise ValueError(f'Invalid MRZ character: {c}')
+  20:         raise ValueError(f'{c}')
   21: 
   22: 
   23: def calculate_check_digit(data: str) -> int:
   24:     '''Calculate a check digit using the Fletcher-16 algorithm.
--------------------------------------------------------------------------------
[0.01432 s] survived

   - [#  54] CRP MRTD: 
--------------------------------------------------------------------------------
   16:         return (ord(c) - ord('A')) + 10
   17:     elif c == '<':
   18:         return 0
   19:     else:
-  20:         raise ValueError(f'Invalid MRZ character: {c}')
+  20:         raise ValueError(f'Invalid MRZ character: {c}mutpy')
   21: 
   22: 
   23: def calculate_check_digit(data: str) -> int:
   24:     '''Calculate a check digit using the Fletcher-16 algorithm.
--------------------------------------------------------------------------------
[0.01398 s] survived

   - [#  56] CRP MRTD: 
--------------------------------------------------------------------------------
   28:         sum2 = (sum2 + sum1) mod 255
   29:     Checksum = (sum2 << 8) | sum1
   30:     Returns checksum mod 10.
   31:     '''
-  32:     (sum1, sum2) = (0, 0)
+  32:     (sum1, sum2) = (1, 0)
   33:     for c in data:
   34:         value = _char_to_value(c)
   35:         sum1 = (sum1 + value) % 255
   36:         sum2 = (sum2 + sum1) % 255
--------------------------------------------------------------------------------
[0.01411 s] killed by test_all_fillers (tests.test_calculate_check_digit.TestCalculateCheckDigit)

   - [#  57] CRP MRTD: 
--------------------------------------------------------------------------------
   28:         sum2 = (sum2 + sum1) mod 255
   29:     Checksum = (sum2 << 8) | sum1
   30:     Returns checksum mod 10.
   31:     '''
-  32:     (sum1, sum2) = (0, 0)
+  32:     (sum1, sum2) = (0, 1)
   33:     for c in data:
   34:         value = _char_to_value(c)
   35:         sum1 = (sum1 + value) % 255
   36:         sum2 = (sum2 + sum1) % 255
--------------------------------------------------------------------------------
[0.01077 s] killed by test_all_fillers (tests.test_calculate_check_digit.TestCalculateCheckDigit)

   - [#  58] CRP MRTD: 
--------------------------------------------------------------------------------
   31:     '''
   32:     (sum1, sum2) = (0, 0)
   33:     for c in data:
   34:         value = _char_to_value(c)
-  35:         sum1 = (sum1 + value) % 255
+  35:         sum1 = (sum1 + value) % 256
   36:         sum2 = (sum2 + sum1) % 255
   37:     checksum = (sum2 << 8) | sum1
   38:     return checksum % 10
   39: 
--------------------------------------------------------------------------------
[0.01362 s] survived

   - [#  59] CRP MRTD: 
--------------------------------------------------------------------------------
   32:     (sum1, sum2) = (0, 0)
   33:     for c in data:
   34:         value = _char_to_value(c)
   35:         sum1 = (sum1 + value) % 255
-  36:         sum2 = (sum2 + sum1) % 255
+  36:         sum2 = (sum2 + sum1) % 256
   37:     checksum = (sum2 << 8) | sum1
   38:     return checksum % 10
   39: 
   40: 
--------------------------------------------------------------------------------
[0.01185 s] killed by test_passport_number_reference (tests.test_calculate_check_digit.TestCalculateCheckDigit)

   - [#  60] CRP MRTD: 
--------------------------------------------------------------------------------
   33:     for c in data:
   34:         value = _char_to_value(c)
   35:         sum1 = (sum1 + value) % 255
   36:         sum2 = (sum2 + sum1) % 255
-  37:     checksum = (sum2 << 8) | sum1
+  37:     checksum = (sum2 << 9) | sum1
   38:     return checksum % 10
   39: 
   40: 
   41: def scan_mrz():
--------------------------------------------------------------------------------
[0.01140 s] killed by test_mixed_alphanumeric (tests.test_calculate_check_digit.TestCalculateCheckDigit)

   - [#  61] CRP MRTD: 
--------------------------------------------------------------------------------
   34:         value = _char_to_value(c)
   35:         sum1 = (sum1 + value) % 255
   36:         sum2 = (sum2 + sum1) % 255
   37:     checksum = (sum2 << 8) | sum1
-  38:     return checksum % 10
+  38:     return checksum % 11
   39: 
   40: 
   41: def scan_mrz():
   42:     '''Stub: simulate scanning a passport MRZ. Hardware scanner not available.'''
--------------------------------------------------------------------------------
[0.01220 s] killed by test_birth_date_reference (tests.test_calculate_check_digit.TestCalculateCheckDigit)

   - [#  62] CRP MRTD: 
--------------------------------------------------------------------------------
   39: 
   40: 
   41: def scan_mrz():
   42:     '''Stub: simulate scanning a passport MRZ. Hardware scanner not available.'''
-  43:     return ('', '')
+  43:     return ('mutpy', '')
   44: 
   45: 
   46: def query_database():
   47:     '''Stub: simulate querying a travel document database.'''
--------------------------------------------------------------------------------
[0.01267 s] survived

   - [#  63] CRP MRTD: 
--------------------------------------------------------------------------------
   39: 
   40: 
   41: def scan_mrz():
   42:     '''Stub: simulate scanning a passport MRZ. Hardware scanner not available.'''
-  43:     return ('', '')
+  43:     return ('', 'mutpy')
   44: 
   45: 
   46: def query_database():
   47:     '''Stub: simulate querying a travel document database.'''
--------------------------------------------------------------------------------
[0.01295 s] survived

   - [#  64] CRP MRTD: 
--------------------------------------------------------------------------------
   47:     '''Stub: simulate querying a travel document database.'''
   48:     return None
   49: 
   50: 
-  51: _MRZ_PATTERN = re.compile('^[A-Z0-9<]+$')
+  51: _MRZ_PATTERN = re.compile('mutpy')
   52: 
   53: 
   54: def decode_mrz(line1: str, line2: str) -> dict:
   55:     '''Decode two 44-character MRZ strings into a dictionary of fields.
--------------------------------------------------------------------------------
[0.01147 s] killed by test_decode_deu_passport (tests.test_decode_mrz.TestDecodeMRZ)

   - [#  65] CRP MRTD: 
--------------------------------------------------------------------------------
   47:     '''Stub: simulate querying a travel document database.'''
   48:     return None
   49: 
   50: 
-  51: _MRZ_PATTERN = re.compile('^[A-Z0-9<]+$')
+  51: _MRZ_PATTERN = re.compile('')
   52: 
   53: 
   54: def decode_mrz(line1: str, line2: str) -> dict:
   55:     '''Decode two 44-character MRZ strings into a dictionary of fields.
--------------------------------------------------------------------------------
[0.01115 s] killed by test_decode_invalid_chars_lowercase (tests.test_decode_mrz.TestDecodeMRZ)

   - [#  66] CRP MRTD: 
--------------------------------------------------------------------------------
   56: 
   57:     Validates input length and character set. Raises ValueError on invalid input.
   58:     '''
   59:     
-  60:     for (name, line) in [('line1', line1), ('line2', line2)]:
+  60:     for (name, line) in [('mutpy', line1), ('line2', line2)]:
   61:         if len(line) != 44:
   62:             raise ValueError(
   63:                 f'{name} must be exactly 44 characters, got {len(line)}')
   64:         
--------------------------------------------------------------------------------
[0.01210 s] survived

   - [#  67] CRP MRTD: 
--------------------------------------------------------------------------------
   56: 
   57:     Validates input length and character set. Raises ValueError on invalid input.
   58:     '''
   59:     
-  60:     for (name, line) in [('line1', line1), ('line2', line2)]:
+  60:     for (name, line) in [('', line1), ('line2', line2)]:
   61:         if len(line) != 44:
   62:             raise ValueError(
   63:                 f'{name} must be exactly 44 characters, got {len(line)}')
   64:         
--------------------------------------------------------------------------------
[0.01044 s] survived

   - [#  68] CRP MRTD: 
--------------------------------------------------------------------------------
   56: 
   57:     Validates input length and character set. Raises ValueError on invalid input.
   58:     '''
   59:     
-  60:     for (name, line) in [('line1', line1), ('line2', line2)]:
+  60:     for (name, line) in [('line1', line1), ('mutpy', line2)]:
   61:         if len(line) != 44:
   62:             raise ValueError(
   63:                 f'{name} must be exactly 44 characters, got {len(line)}')
   64:         
--------------------------------------------------------------------------------
[0.01062 s] survived

   - [#  69] CRP MRTD: 
--------------------------------------------------------------------------------
   56: 
   57:     Validates input length and character set. Raises ValueError on invalid input.
   58:     '''
   59:     
-  60:     for (name, line) in [('line1', line1), ('line2', line2)]:
+  60:     for (name, line) in [('line1', line1), ('', line2)]:
   61:         if len(line) != 44:
   62:             raise ValueError(
   63:                 f'{name} must be exactly 44 characters, got {len(line)}')
   64:         
--------------------------------------------------------------------------------
[0.01087 s] survived

   - [#  70] CRP MRTD: 
--------------------------------------------------------------------------------
   57:     Validates input length and character set. Raises ValueError on invalid input.
   58:     '''
   59:     
   60:     for (name, line) in [('line1', line1), ('line2', line2)]:
-  61:         if len(line) != 44:
+  61:         if len(line) != 45:
   62:             raise ValueError(
   63:                 f'{name} must be exactly 44 characters, got {len(line)}')
   64:         
   65:         if not (_MRZ_PATTERN.match(line)):
--------------------------------------------------------------------------------
[0.01219 s] killed by test_decode_deu_passport (tests.test_decode_mrz.TestDecodeMRZ)

   - [#  71] CRP MRTD: 
--------------------------------------------------------------------------------
   59:     
   60:     for (name, line) in [('line1', line1), ('line2', line2)]:
   61:         if len(line) != 44:
   62:             raise ValueError(
-  63:                 f'{name} must be exactly 44 characters, got {len(line)}')
+  63:                 f'{name}mutpy{len(line)}')
   64:         
   65:         if not (_MRZ_PATTERN.match(line)):
   66:             raise ValueError(
   67:                 f'{name} contains invalid characters (only A-Z, 0-9, \'<\' allowed)')
--------------------------------------------------------------------------------
[0.01233 s] survived

   - [#  72] CRP MRTD: 
--------------------------------------------------------------------------------
   59:     
   60:     for (name, line) in [('line1', line1), ('line2', line2)]:
   61:         if len(line) != 44:
   62:             raise ValueError(
-  63:                 f'{name} must be exactly 44 characters, got {len(line)}')
+  63:                 f'{name}{len(line)}')
   64:         
   65:         if not (_MRZ_PATTERN.match(line)):
   66:             raise ValueError(
   67:                 f'{name} contains invalid characters (only A-Z, 0-9, \'<\' allowed)')
--------------------------------------------------------------------------------
[0.01249 s] survived

   - [#  73] CRP MRTD: 
--------------------------------------------------------------------------------
   63:                 f'{name} must be exactly 44 characters, got {len(line)}')
   64:         
   65:         if not (_MRZ_PATTERN.match(line)):
   66:             raise ValueError(
-  67:                 f'{name} contains invalid characters (only A-Z, 0-9, \'<\' allowed)')
+  67:                 f'{name}mutpy')
   68:     
   69:     
   70:     
   71:     document_type = line1[0:2].rstrip('<')
--------------------------------------------------------------------------------
[0.01094 s] survived

   - [#  74] CRP MRTD: 
--------------------------------------------------------------------------------
   63:                 f'{name} must be exactly 44 characters, got {len(line)}')
   64:         
   65:         if not (_MRZ_PATTERN.match(line)):
   66:             raise ValueError(
-  67:                 f'{name} contains invalid characters (only A-Z, 0-9, \'<\' allowed)')
+  67:                 f'{name}')
   68:     
   69:     
   70:     
   71:     document_type = line1[0:2].rstrip('<')
--------------------------------------------------------------------------------
[0.01047 s] survived

   - [#  75] CRP MRTD: 
--------------------------------------------------------------------------------
   67:                 f'{name} contains invalid characters (only A-Z, 0-9, \'<\' allowed)')
   68:     
   69:     
   70:     
-  71:     document_type = line1[0:2].rstrip('<')
+  71:     document_type = line1[1:2].rstrip('<')
   72:     issuing_country = line1[2:5].rstrip('<')
   73:     
   74:     
   75:     names_raw = line1[5:44]
--------------------------------------------------------------------------------
[0.01095 s] killed by test_decode_reference_uto (tests.test_decode_mrz.TestDecodeMRZ)

   - [#  76] CRP MRTD: 
--------------------------------------------------------------------------------
   67:                 f'{name} contains invalid characters (only A-Z, 0-9, \'<\' allowed)')
   68:     
   69:     
   70:     
-  71:     document_type = line1[0:2].rstrip('<')
+  71:     document_type = line1[0:3].rstrip('<')
   72:     issuing_country = line1[2:5].rstrip('<')
   73:     
   74:     
   75:     names_raw = line1[5:44]
--------------------------------------------------------------------------------
[0.01036 s] killed by test_decode_reference_uto (tests.test_decode_mrz.TestDecodeMRZ)

   - [#  77] CRP MRTD: 
--------------------------------------------------------------------------------
   67:                 f'{name} contains invalid characters (only A-Z, 0-9, \'<\' allowed)')
   68:     
   69:     
   70:     
-  71:     document_type = line1[0:2].rstrip('<')
+  71:     document_type = line1[0:2].rstrip('mutpy')
   72:     issuing_country = line1[2:5].rstrip('<')
   73:     
   74:     
   75:     names_raw = line1[5:44]
--------------------------------------------------------------------------------
[0.01048 s] killed by test_decode_reference_uto (tests.test_decode_mrz.TestDecodeMRZ)

   - [#  78] CRP MRTD: 
--------------------------------------------------------------------------------
   67:                 f'{name} contains invalid characters (only A-Z, 0-9, \'<\' allowed)')
   68:     
   69:     
   70:     
-  71:     document_type = line1[0:2].rstrip('<')
+  71:     document_type = line1[0:2].rstrip('')
   72:     issuing_country = line1[2:5].rstrip('<')
   73:     
   74:     
   75:     names_raw = line1[5:44]
--------------------------------------------------------------------------------
[0.01101 s] killed by test_decode_reference_uto (tests.test_decode_mrz.TestDecodeMRZ)

   - [#  79] CRP MRTD: 
--------------------------------------------------------------------------------
   68:     
   69:     
   70:     
   71:     document_type = line1[0:2].rstrip('<')
-  72:     issuing_country = line1[2:5].rstrip('<')
+  72:     issuing_country = line1[3:5].rstrip('<')
   73:     
   74:     
   75:     names_raw = line1[5:44]
   76:     parts = names_raw.split('<<')
--------------------------------------------------------------------------------
[0.01130 s] killed by test_decode_deu_passport (tests.test_decode_mrz.TestDecodeMRZ)

   - [#  80] CRP MRTD: 
--------------------------------------------------------------------------------
   68:     
   69:     
   70:     
   71:     document_type = line1[0:2].rstrip('<')
-  72:     issuing_country = line1[2:5].rstrip('<')
+  72:     issuing_country = line1[2:6].rstrip('<')
   73:     
   74:     
   75:     names_raw = line1[5:44]
   76:     parts = names_raw.split('<<')
--------------------------------------------------------------------------------
[0.01204 s] killed by test_decode_deu_passport (tests.test_decode_mrz.TestDecodeMRZ)

   - [#  81] CRP MRTD: 
--------------------------------------------------------------------------------
   68:     
   69:     
   70:     
   71:     document_type = line1[0:2].rstrip('<')
-  72:     issuing_country = line1[2:5].rstrip('<')
+  72:     issuing_country = line1[2:5].rstrip('mutpy')
   73:     
   74:     
   75:     names_raw = line1[5:44]
   76:     parts = names_raw.split('<<')
--------------------------------------------------------------------------------
[0.01111 s] survived

   - [#  82] CRP MRTD: 
--------------------------------------------------------------------------------
   68:     
   69:     
   70:     
   71:     document_type = line1[0:2].rstrip('<')
-  72:     issuing_country = line1[2:5].rstrip('<')
+  72:     issuing_country = line1[2:5].rstrip('')
   73:     
   74:     
   75:     names_raw = line1[5:44]
   76:     parts = names_raw.split('<<')
--------------------------------------------------------------------------------
[0.01267 s] survived

   - [#  83] CRP MRTD: 
--------------------------------------------------------------------------------
   71:     document_type = line1[0:2].rstrip('<')
   72:     issuing_country = line1[2:5].rstrip('<')
   73:     
   74:     
-  75:     names_raw = line1[5:44]
+  75:     names_raw = line1[6:44]
   76:     parts = names_raw.split('<<')
   77:     surname = parts[0].replace('<', ' ').strip()
   78:     given_names = parts[1].replace('<', ' ').strip() if len(parts) > 1 else ''
   79:     
--------------------------------------------------------------------------------
[0.01129 s] killed by test_decode_deu_passport (tests.test_decode_mrz.TestDecodeMRZ)

   - [#  84] CRP MRTD: 
--------------------------------------------------------------------------------
   71:     document_type = line1[0:2].rstrip('<')
   72:     issuing_country = line1[2:5].rstrip('<')
   73:     
   74:     
-  75:     names_raw = line1[5:44]
+  75:     names_raw = line1[5:45]
   76:     parts = names_raw.split('<<')
   77:     surname = parts[0].replace('<', ' ').strip()
   78:     given_names = parts[1].replace('<', ' ').strip() if len(parts) > 1 else ''
   79:     
--------------------------------------------------------------------------------
[0.01194 s] survived

   - [#  85] CRP MRTD: 
--------------------------------------------------------------------------------
   72:     issuing_country = line1[2:5].rstrip('<')
   73:     
   74:     
   75:     names_raw = line1[5:44]
-  76:     parts = names_raw.split('<<')
+  76:     parts = names_raw.split('mutpy')
   77:     surname = parts[0].replace('<', ' ').strip()
   78:     given_names = parts[1].replace('<', ' ').strip() if len(parts) > 1 else ''
   79:     
   80:     
--------------------------------------------------------------------------------
[0.01285 s] killed by test_decode_deu_passport (tests.test_decode_mrz.TestDecodeMRZ)

   - [#  86] CRP MRTD: 
--------------------------------------------------------------------------------
   72:     issuing_country = line1[2:5].rstrip('<')
   73:     
   74:     
   75:     names_raw = line1[5:44]
-  76:     parts = names_raw.split('<<')
+  76:     parts = names_raw.split('')
   77:     surname = parts[0].replace('<', ' ').strip()
   78:     given_names = parts[1].replace('<', ' ').strip() if len(parts) > 1 else ''
   79:     
   80:     
--------------------------------------------------------------------------------
[0.01242 s] killed by test_decode_deu_passport (tests.test_decode_mrz.TestDecodeMRZ)

   - [#  87] CRP MRTD: 
--------------------------------------------------------------------------------
   73:     
   74:     
   75:     names_raw = line1[5:44]
   76:     parts = names_raw.split('<<')
-  77:     surname = parts[0].replace('<', ' ').strip()
+  77:     surname = parts[1].replace('<', ' ').strip()
   78:     given_names = parts[1].replace('<', ' ').strip() if len(parts) > 1 else ''
   79:     
   80:     
   81:     passport_number = line2[0:9].rstrip('<')
--------------------------------------------------------------------------------
[0.01276 s] killed by test_decode_deu_passport (tests.test_decode_mrz.TestDecodeMRZ)

   - [#  88] CRP MRTD: 
--------------------------------------------------------------------------------
   73:     
   74:     
   75:     names_raw = line1[5:44]
   76:     parts = names_raw.split('<<')
-  77:     surname = parts[0].replace('<', ' ').strip()
+  77:     surname = parts[0].replace('mutpy', ' ').strip()
   78:     given_names = parts[1].replace('<', ' ').strip() if len(parts) > 1 else ''
   79:     
   80:     
   81:     passport_number = line2[0:9].rstrip('<')
--------------------------------------------------------------------------------
[0.01266 s] survived

   - [#  89] CRP MRTD: 
--------------------------------------------------------------------------------
   73:     
   74:     
   75:     names_raw = line1[5:44]
   76:     parts = names_raw.split('<<')
-  77:     surname = parts[0].replace('<', ' ').strip()
+  77:     surname = parts[0].replace('', ' ').strip()
   78:     given_names = parts[1].replace('<', ' ').strip() if len(parts) > 1 else ''
   79:     
   80:     
   81:     passport_number = line2[0:9].rstrip('<')
--------------------------------------------------------------------------------
[0.01184 s] killed by test_decode_deu_passport (tests.test_decode_mrz.TestDecodeMRZ)

   - [#  90] CRP MRTD: 
--------------------------------------------------------------------------------
   73:     
   74:     
   75:     names_raw = line1[5:44]
   76:     parts = names_raw.split('<<')
-  77:     surname = parts[0].replace('<', ' ').strip()
+  77:     surname = parts[0].replace('<', 'mutpy').strip()
   78:     given_names = parts[1].replace('<', ' ').strip() if len(parts) > 1 else ''
   79:     
   80:     
   81:     passport_number = line2[0:9].rstrip('<')
--------------------------------------------------------------------------------
[0.01051 s] survived

   - [#  91] CRP MRTD: 
--------------------------------------------------------------------------------
   73:     
   74:     
   75:     names_raw = line1[5:44]
   76:     parts = names_raw.split('<<')
-  77:     surname = parts[0].replace('<', ' ').strip()
+  77:     surname = parts[0].replace('<', '').strip()
   78:     given_names = parts[1].replace('<', ' ').strip() if len(parts) > 1 else ''
   79:     
   80:     
   81:     passport_number = line2[0:9].rstrip('<')
--------------------------------------------------------------------------------
[0.01137 s] survived

   - [#  92] CRP MRTD: 
--------------------------------------------------------------------------------
   74:     
   75:     names_raw = line1[5:44]
   76:     parts = names_raw.split('<<')
   77:     surname = parts[0].replace('<', ' ').strip()
-  78:     given_names = parts[1].replace('<', ' ').strip() if len(parts) > 1 else ''
+  78:     given_names = parts[1].replace('<', ' ').strip() if len(parts) > 2 else ''
   79:     
   80:     
   81:     passport_number = line2[0:9].rstrip('<')
   82:     check_digit_passport = line2[9]
--------------------------------------------------------------------------------
[0.01204 s] survived

   - [#  93] CRP MRTD: 
--------------------------------------------------------------------------------
   74:     
   75:     names_raw = line1[5:44]
   76:     parts = names_raw.split('<<')
   77:     surname = parts[0].replace('<', ' ').strip()
-  78:     given_names = parts[1].replace('<', ' ').strip() if len(parts) > 1 else ''
+  78:     given_names = parts[2].replace('<', ' ').strip() if len(parts) > 1 else ''
   79:     
   80:     
   81:     passport_number = line2[0:9].rstrip('<')
   82:     check_digit_passport = line2[9]
--------------------------------------------------------------------------------
[0.01387 s] killed by test_decode_deu_passport (tests.test_decode_mrz.TestDecodeMRZ)
