   - [#  94] CRP MRTD: 
--------------------------------------------------------------------------------
   74:     
   75:     names_raw = line1[5:44]
   76:     parts = names_raw.split('<<')
   77:     surname = parts[0].replace('<', ' ').strip()
-  78:     given_names = parts[1].replace('<', ' ').strip() if len(parts) > 1 else ''
+  78:     given_names = parts[1].replace('mutpy', ' ').strip() if len(parts) > 1 else ''
   79:     
   80:     
   81:     passport_number = line2[0:9].rstrip('<')
   82:     check_digit_passport = line2[9]
--------------------------------------------------------------------------------
[0.01299 s] killed by test_decode_fra_passport (tests.test_decode_mrz.TestDecodeMRZ)

   - [#  95] CRP MRTD: 
--------------------------------------------------------------------------------
   74:     
   75:     names_raw = line1[5:44]
   76:     parts = names_raw.split('<<')
   77:     surname = parts[0].replace('<', ' ').strip()
-  78:     given_names = parts[1].replace('<', ' ').strip() if len(parts) > 1 else ''
+  78:     given_names = parts[1].replace('', ' ').strip() if len(parts) > 1 else ''
   79:     
   80:     
   81:     passport_number = line2[0:9].rstrip('<')
   82:     check_digit_passport = line2[9]
--------------------------------------------------------------------------------
[0.01378 s] killed by test_decode_deu_passport (tests.test_decode_mrz.TestDecodeMRZ)

   - [#  96] CRP MRTD: 
--------------------------------------------------------------------------------
   74:     
   75:     names_raw = line1[5:44]
   76:     parts = names_raw.split('<<')
   77:     surname = parts[0].replace('<', ' ').strip()
-  78:     given_names = parts[1].replace('<', ' ').strip() if len(parts) > 1 else ''
+  78:     given_names = parts[1].replace('<', 'mutpy').strip() if len(parts) > 1 else ''
   79:     
   80:     
   81:     passport_number = line2[0:9].rstrip('<')
   82:     check_digit_passport = line2[9]
--------------------------------------------------------------------------------
[0.01277 s] killed by test_decode_fra_passport (tests.test_decode_mrz.TestDecodeMRZ)

   - [#  97] CRP MRTD: 
--------------------------------------------------------------------------------
   74:     
   75:     names_raw = line1[5:44]
   76:     parts = names_raw.split('<<')
   77:     surname = parts[0].replace('<', ' ').strip()
-  78:     given_names = parts[1].replace('<', ' ').strip() if len(parts) > 1 else ''
+  78:     given_names = parts[1].replace('<', '').strip() if len(parts) > 1 else ''
   79:     
   80:     
   81:     passport_number = line2[0:9].rstrip('<')
   82:     check_digit_passport = line2[9]
--------------------------------------------------------------------------------
[0.01318 s] killed by test_decode_fra_passport (tests.test_decode_mrz.TestDecodeMRZ)

   - [#  98] CRP MRTD: 
--------------------------------------------------------------------------------
   74:     
   75:     names_raw = line1[5:44]
   76:     parts = names_raw.split('<<')
   77:     surname = parts[0].replace('<', ' ').strip()
-  78:     given_names = parts[1].replace('<', ' ').strip() if len(parts) > 1 else ''
+  78:     given_names = parts[1].replace('<', ' ').strip() if len(parts) > 1 else 'mutpy'
   79:     
   80:     
   81:     passport_number = line2[0:9].rstrip('<')
   82:     check_digit_passport = line2[9]
--------------------------------------------------------------------------------
[0.01305 s] survived

   - [#  99] CRP MRTD: 
--------------------------------------------------------------------------------
   77:     surname = parts[0].replace('<', ' ').strip()
   78:     given_names = parts[1].replace('<', ' ').strip() if len(parts) > 1 else ''
   79:     
   80:     
-  81:     passport_number = line2[0:9].rstrip('<')
+  81:     passport_number = line2[1:9].rstrip('<')
   82:     check_digit_passport = line2[9]
   83:     country_code = line2[10:13].rstrip('<')
   84:     birth_date = line2[13:19]
   85:     check_digit_birth = line2[19]
--------------------------------------------------------------------------------
[0.01058 s] killed by test_decode_reference_uto (tests.test_decode_mrz.TestDecodeMRZ)

   - [# 100] CRP MRTD: 
--------------------------------------------------------------------------------
   77:     surname = parts[0].replace('<', ' ').strip()
   78:     given_names = parts[1].replace('<', ' ').strip() if len(parts) > 1 else ''
   79:     
   80:     
-  81:     passport_number = line2[0:9].rstrip('<')
+  81:     passport_number = line2[0:10].rstrip('<')
   82:     check_digit_passport = line2[9]
   83:     country_code = line2[10:13].rstrip('<')
   84:     birth_date = line2[13:19]
   85:     check_digit_birth = line2[19]
--------------------------------------------------------------------------------
[0.01257 s] killed by test_decode_reference_uto (tests.test_decode_mrz.TestDecodeMRZ)

   - [# 101] CRP MRTD: 
--------------------------------------------------------------------------------
   77:     surname = parts[0].replace('<', ' ').strip()
   78:     given_names = parts[1].replace('<', ' ').strip() if len(parts) > 1 else ''
   79:     
   80:     
-  81:     passport_number = line2[0:9].rstrip('<')
+  81:     passport_number = line2[0:9].rstrip('mutpy')
   82:     check_digit_passport = line2[9]
   83:     country_code = line2[10:13].rstrip('<')
   84:     birth_date = line2[13:19]
   85:     check_digit_birth = line2[19]
--------------------------------------------------------------------------------
[0.01044 s] survived

   - [# 102] CRP MRTD: 
--------------------------------------------------------------------------------
   77:     surname = parts[0].replace('<', ' ').strip()
   78:     given_names = parts[1].replace('<', ' ').strip() if len(parts) > 1 else ''
   79:     
   80:     
-  81:     passport_number = line2[0:9].rstrip('<')
+  81:     passport_number = line2[0:9].rstrip('')
   82:     check_digit_passport = line2[9]
   83:     country_code = line2[10:13].rstrip('<')
   84:     birth_date = line2[13:19]
   85:     check_digit_birth = line2[19]
--------------------------------------------------------------------------------
[0.01224 s] survived

   - [# 103] CRP MRTD: 
--------------------------------------------------------------------------------
   78:     given_names = parts[1].replace('<', ' ').strip() if len(parts) > 1 else ''
   79:     
   80:     
   81:     passport_number = line2[0:9].rstrip('<')
-  82:     check_digit_passport = line2[9]
+  82:     check_digit_passport = line2[10]
   83:     country_code = line2[10:13].rstrip('<')
   84:     birth_date = line2[13:19]
   85:     check_digit_birth = line2[19]
   86:     sex = line2[20]
--------------------------------------------------------------------------------
[0.01198 s] killed by test_decode_reference_uto (tests.test_decode_mrz.TestDecodeMRZ)

   - [# 104] CRP MRTD: 
--------------------------------------------------------------------------------
   79:     
   80:     
   81:     passport_number = line2[0:9].rstrip('<')
   82:     check_digit_passport = line2[9]
-  83:     country_code = line2[10:13].rstrip('<')
+  83:     country_code = line2[11:13].rstrip('<')
   84:     birth_date = line2[13:19]
   85:     check_digit_birth = line2[19]
   86:     sex = line2[20]
   87:     expiration_date = line2[21:27]
--------------------------------------------------------------------------------
[0.01025 s] killed by test_decode_gbr_passport (tests.test_decode_mrz.TestDecodeMRZ)

   - [# 105] CRP MRTD: 
--------------------------------------------------------------------------------
   79:     
   80:     
   81:     passport_number = line2[0:9].rstrip('<')
   82:     check_digit_passport = line2[9]
-  83:     country_code = line2[10:13].rstrip('<')
+  83:     country_code = line2[10:14].rstrip('<')
   84:     birth_date = line2[13:19]
   85:     check_digit_birth = line2[19]
   86:     sex = line2[20]
   87:     expiration_date = line2[21:27]
--------------------------------------------------------------------------------
[0.01098 s] killed by test_decode_gbr_passport (tests.test_decode_mrz.TestDecodeMRZ)

   - [# 106] CRP MRTD: 
--------------------------------------------------------------------------------
   79:     
   80:     
   81:     passport_number = line2[0:9].rstrip('<')
   82:     check_digit_passport = line2[9]
-  83:     country_code = line2[10:13].rstrip('<')
+  83:     country_code = line2[10:13].rstrip('mutpy')
   84:     birth_date = line2[13:19]
   85:     check_digit_birth = line2[19]
   86:     sex = line2[20]
   87:     expiration_date = line2[21:27]
--------------------------------------------------------------------------------
[0.01068 s] survived

   - [# 107] CRP MRTD: 
--------------------------------------------------------------------------------
   79:     
   80:     
   81:     passport_number = line2[0:9].rstrip('<')
   82:     check_digit_passport = line2[9]
-  83:     country_code = line2[10:13].rstrip('<')
+  83:     country_code = line2[10:13].rstrip('')
   84:     birth_date = line2[13:19]
   85:     check_digit_birth = line2[19]
   86:     sex = line2[20]
   87:     expiration_date = line2[21:27]
--------------------------------------------------------------------------------
[0.01264 s] survived

   - [# 108] CRP MRTD: 
--------------------------------------------------------------------------------
   80:     
   81:     passport_number = line2[0:9].rstrip('<')
   82:     check_digit_passport = line2[9]
   83:     country_code = line2[10:13].rstrip('<')
-  84:     birth_date = line2[13:19]
+  84:     birth_date = line2[14:19]
   85:     check_digit_birth = line2[19]
   86:     sex = line2[20]
   87:     expiration_date = line2[21:27]
   88:     check_digit_expiration = line2[27]
--------------------------------------------------------------------------------
[0.01332 s] killed by test_decode_reference_uto (tests.test_decode_mrz.TestDecodeMRZ)

   - [# 109] CRP MRTD: 
--------------------------------------------------------------------------------
   80:     
   81:     passport_number = line2[0:9].rstrip('<')
   82:     check_digit_passport = line2[9]
   83:     country_code = line2[10:13].rstrip('<')
-  84:     birth_date = line2[13:19]
+  84:     birth_date = line2[13:20]
   85:     check_digit_birth = line2[19]
   86:     sex = line2[20]
   87:     expiration_date = line2[21:27]
   88:     check_digit_expiration = line2[27]
--------------------------------------------------------------------------------
[0.01206 s] killed by test_decode_reference_uto (tests.test_decode_mrz.TestDecodeMRZ)

   - [# 110] CRP MRTD: 
--------------------------------------------------------------------------------
   81:     passport_number = line2[0:9].rstrip('<')
   82:     check_digit_passport = line2[9]
   83:     country_code = line2[10:13].rstrip('<')
   84:     birth_date = line2[13:19]
-  85:     check_digit_birth = line2[19]
+  85:     check_digit_birth = line2[20]
   86:     sex = line2[20]
   87:     expiration_date = line2[21:27]
   88:     check_digit_expiration = line2[27]
   89:     personal_number = line2[28:42].rstrip('<')
--------------------------------------------------------------------------------
[0.01173 s] killed by test_decode_reference_uto (tests.test_decode_mrz.TestDecodeMRZ)

   - [# 111] CRP MRTD: 
--------------------------------------------------------------------------------
   82:     check_digit_passport = line2[9]
   83:     country_code = line2[10:13].rstrip('<')
   84:     birth_date = line2[13:19]
   85:     check_digit_birth = line2[19]
-  86:     sex = line2[20]
+  86:     sex = line2[21]
   87:     expiration_date = line2[21:27]
   88:     check_digit_expiration = line2[27]
   89:     personal_number = line2[28:42].rstrip('<')
   90:     check_digit_personal = line2[42]
--------------------------------------------------------------------------------
[0.01116 s] killed by test_decode_reference_uto (tests.test_decode_mrz.TestDecodeMRZ)

   - [# 112] CRP MRTD: 
--------------------------------------------------------------------------------
   83:     country_code = line2[10:13].rstrip('<')
   84:     birth_date = line2[13:19]
   85:     check_digit_birth = line2[19]
   86:     sex = line2[20]
-  87:     expiration_date = line2[21:27]
+  87:     expiration_date = line2[22:27]
   88:     check_digit_expiration = line2[27]
   89:     personal_number = line2[28:42].rstrip('<')
   90:     check_digit_personal = line2[42]
   91:     overall_check_digit = line2[43]
--------------------------------------------------------------------------------
[0.01084 s] killed by test_decode_reference_uto (tests.test_decode_mrz.TestDecodeMRZ)

   - [# 113] CRP MRTD: 
--------------------------------------------------------------------------------
   83:     country_code = line2[10:13].rstrip('<')
   84:     birth_date = line2[13:19]
   85:     check_digit_birth = line2[19]
   86:     sex = line2[20]
-  87:     expiration_date = line2[21:27]
+  87:     expiration_date = line2[21:28]
   88:     check_digit_expiration = line2[27]
   89:     personal_number = line2[28:42].rstrip('<')
   90:     check_digit_personal = line2[42]
   91:     overall_check_digit = line2[43]
--------------------------------------------------------------------------------
[0.01027 s] killed by test_decode_reference_uto (tests.test_decode_mrz.TestDecodeMRZ)

   - [# 114] CRP MRTD: 
--------------------------------------------------------------------------------
   84:     birth_date = line2[13:19]
   85:     check_digit_birth = line2[19]
   86:     sex = line2[20]
   87:     expiration_date = line2[21:27]
-  88:     check_digit_expiration = line2[27]
+  88:     check_digit_expiration = line2[28]
   89:     personal_number = line2[28:42].rstrip('<')
   90:     check_digit_personal = line2[42]
   91:     overall_check_digit = line2[43]
   92:     
--------------------------------------------------------------------------------
[0.01126 s] killed by test_decode_reference_uto (tests.test_decode_mrz.TestDecodeMRZ)

   - [# 115] CRP MRTD: 
--------------------------------------------------------------------------------
   85:     check_digit_birth = line2[19]
   86:     sex = line2[20]
   87:     expiration_date = line2[21:27]
   88:     check_digit_expiration = line2[27]
-  89:     personal_number = line2[28:42].rstrip('<')
+  89:     personal_number = line2[29:42].rstrip('<')
   90:     check_digit_personal = line2[42]
   91:     overall_check_digit = line2[43]
   92:     
   93:     return {\
--------------------------------------------------------------------------------
[0.01225 s] killed by test_decode_reference_uto (tests.test_decode_mrz.TestDecodeMRZ)

   - [# 116] CRP MRTD: 
--------------------------------------------------------------------------------
   85:     check_digit_birth = line2[19]
   86:     sex = line2[20]
   87:     expiration_date = line2[21:27]
   88:     check_digit_expiration = line2[27]
-  89:     personal_number = line2[28:42].rstrip('<')
+  89:     personal_number = line2[28:43].rstrip('<')
   90:     check_digit_personal = line2[42]
   91:     overall_check_digit = line2[43]
   92:     
   93:     return {\
--------------------------------------------------------------------------------
[0.01049 s] killed by test_decode_empty_personal_number (tests.test_decode_mrz.TestDecodeMRZ)

   - [# 117] CRP MRTD: 
--------------------------------------------------------------------------------
   85:     check_digit_birth = line2[19]
   86:     sex = line2[20]
   87:     expiration_date = line2[21:27]
   88:     check_digit_expiration = line2[27]
-  89:     personal_number = line2[28:42].rstrip('<')
+  89:     personal_number = line2[28:42].rstrip('mutpy')
   90:     check_digit_personal = line2[42]
   91:     overall_check_digit = line2[43]
   92:     
   93:     return {\
--------------------------------------------------------------------------------
[0.01108 s] killed by test_decode_empty_personal_number (tests.test_decode_mrz.TestDecodeMRZ)

   - [# 118] CRP MRTD: 
--------------------------------------------------------------------------------
   85:     check_digit_birth = line2[19]
   86:     sex = line2[20]
   87:     expiration_date = line2[21:27]
   88:     check_digit_expiration = line2[27]
-  89:     personal_number = line2[28:42].rstrip('<')
+  89:     personal_number = line2[28:42].rstrip('')
   90:     check_digit_personal = line2[42]
   91:     overall_check_digit = line2[43]
   92:     
   93:     return {\
--------------------------------------------------------------------------------
[0.00956 s] killed by test_decode_empty_personal_number (tests.test_decode_mrz.TestDecodeMRZ)

   - [# 119] CRP MRTD: 
--------------------------------------------------------------------------------
   86:     sex = line2[20]
   87:     expiration_date = line2[21:27]
   88:     check_digit_expiration = line2[27]
   89:     personal_number = line2[28:42].rstrip('<')
-  90:     check_digit_personal = line2[42]
+  90:     check_digit_personal = line2[43]
   91:     overall_check_digit = line2[43]
   92:     
   93:     return {\
   94:         'document_type': document_type, \
--------------------------------------------------------------------------------
[0.01094 s] killed by test_decode_reference_uto (tests.test_decode_mrz.TestDecodeMRZ)

   - [# 120] CRP MRTD: 
--------------------------------------------------------------------------------
   87:     expiration_date = line2[21:27]
   88:     check_digit_expiration = line2[27]
   89:     personal_number = line2[28:42].rstrip('<')
   90:     check_digit_personal = line2[42]
-  91:     overall_check_digit = line2[43]
+  91:     overall_check_digit = line2[44]
   92:     
   93:     return {\
   94:         'document_type': document_type, \
   95:         'issuing_country': issuing_country, \
--------------------------------------------------------------------------------
[0.01003 s] killed by test_decode_deu_passport (tests.test_decode_mrz.TestDecodeMRZ)

   - [# 121] CRP MRTD: 
--------------------------------------------------------------------------------
   90:     check_digit_personal = line2[42]
   91:     overall_check_digit = line2[43]
   92:     
   93:     return {\
-  94:         'document_type': document_type, \
+  94:         'mutpy': document_type, \
   95:         'issuing_country': issuing_country, \
   96:         'surname': surname, \
   97:         'given_names': given_names, \
   98:         'passport_number': passport_number, \
--------------------------------------------------------------------------------
[0.01043 s] killed by test_decode_reference_uto (tests.test_decode_mrz.TestDecodeMRZ)

   - [# 122] CRP MRTD: 
--------------------------------------------------------------------------------
   90:     check_digit_personal = line2[42]
   91:     overall_check_digit = line2[43]
   92:     
   93:     return {\
-  94:         'document_type': document_type, \
+  94:         '': document_type, \
   95:         'issuing_country': issuing_country, \
   96:         'surname': surname, \
   97:         'given_names': given_names, \
   98:         'passport_number': passport_number, \
--------------------------------------------------------------------------------
[0.01134 s] killed by test_decode_reference_uto (tests.test_decode_mrz.TestDecodeMRZ)

   - [# 123] CRP MRTD: 
--------------------------------------------------------------------------------
   91:     overall_check_digit = line2[43]
   92:     
   93:     return {\
   94:         'document_type': document_type, \
-  95:         'issuing_country': issuing_country, \
+  95:         'mutpy': issuing_country, \
   96:         'surname': surname, \
   97:         'given_names': given_names, \
   98:         'passport_number': passport_number, \
   99:         'check_digit_passport': check_digit_passport, \
--------------------------------------------------------------------------------
[0.01098 s] killed by test_decode_deu_passport (tests.test_decode_mrz.TestDecodeMRZ)

   - [# 124] CRP MRTD: 
--------------------------------------------------------------------------------
   91:     overall_check_digit = line2[43]
   92:     
   93:     return {\
   94:         'document_type': document_type, \
-  95:         'issuing_country': issuing_country, \
+  95:         '': issuing_country, \
   96:         'surname': surname, \
   97:         'given_names': given_names, \
   98:         'passport_number': passport_number, \
   99:         'check_digit_passport': check_digit_passport, \
--------------------------------------------------------------------------------
[0.00942 s] killed by test_decode_deu_passport (tests.test_decode_mrz.TestDecodeMRZ)

   - [# 125] CRP MRTD: 
--------------------------------------------------------------------------------
   92:     
   93:     return {\
   94:         'document_type': document_type, \
   95:         'issuing_country': issuing_country, \
-  96:         'surname': surname, \
+  96:         'mutpy': surname, \
   97:         'given_names': given_names, \
   98:         'passport_number': passport_number, \
   99:         'check_digit_passport': check_digit_passport, \
  100:         'country_code': country_code, \
--------------------------------------------------------------------------------
[0.01166 s] killed by test_decode_deu_passport (tests.test_decode_mrz.TestDecodeMRZ)

   - [# 126] CRP MRTD: 
--------------------------------------------------------------------------------
   92:     
   93:     return {\
   94:         'document_type': document_type, \
   95:         'issuing_country': issuing_country, \
-  96:         'surname': surname, \
+  96:         '': surname, \
   97:         'given_names': given_names, \
   98:         'passport_number': passport_number, \
   99:         'check_digit_passport': check_digit_passport, \
  100:         'country_code': country_code, \
--------------------------------------------------------------------------------
[0.01177 s] killed by test_decode_deu_passport (tests.test_decode_mrz.TestDecodeMRZ)

   - [# 127] CRP MRTD: 
--------------------------------------------------------------------------------
   93:     return {\
   94:         'document_type': document_type, \
   95:         'issuing_country': issuing_country, \
   96:         'surname': surname, \
-  97:         'given_names': given_names, \
+  97:         'mutpy': given_names, \
   98:         'passport_number': passport_number, \
   99:         'check_digit_passport': check_digit_passport, \
  100:         'country_code': country_code, \
  101:         'birth_date': birth_date, \
--------------------------------------------------------------------------------
[0.01117 s] killed by test_decode_deu_passport (tests.test_decode_mrz.TestDecodeMRZ)

   - [# 128] CRP MRTD: 
--------------------------------------------------------------------------------
   93:     return {\
   94:         'document_type': document_type, \
   95:         'issuing_country': issuing_country, \
   96:         'surname': surname, \
-  97:         'given_names': given_names, \
+  97:         '': given_names, \
   98:         'passport_number': passport_number, \
   99:         'check_digit_passport': check_digit_passport, \
  100:         'country_code': country_code, \
  101:         'birth_date': birth_date, \
--------------------------------------------------------------------------------
[0.00954 s] killed by test_decode_deu_passport (tests.test_decode_mrz.TestDecodeMRZ)

   - [# 129] CRP MRTD: 
--------------------------------------------------------------------------------
   94:         'document_type': document_type, \
   95:         'issuing_country': issuing_country, \
   96:         'surname': surname, \
   97:         'given_names': given_names, \
-  98:         'passport_number': passport_number, \
+  98:         'mutpy': passport_number, \
   99:         'check_digit_passport': check_digit_passport, \
  100:         'country_code': country_code, \
  101:         'birth_date': birth_date, \
  102:         'check_digit_birth': check_digit_birth, \
--------------------------------------------------------------------------------
[0.00990 s] killed by test_decode_reference_uto (tests.test_decode_mrz.TestDecodeMRZ)

   - [# 130] CRP MRTD: 
--------------------------------------------------------------------------------
   94:         'document_type': document_type, \
   95:         'issuing_country': issuing_country, \
   96:         'surname': surname, \
   97:         'given_names': given_names, \
-  98:         'passport_number': passport_number, \
+  98:         '': passport_number, \
   99:         'check_digit_passport': check_digit_passport, \
  100:         'country_code': country_code, \
  101:         'birth_date': birth_date, \
  102:         'check_digit_birth': check_digit_birth, \
--------------------------------------------------------------------------------
[0.00999 s] killed by test_decode_reference_uto (tests.test_decode_mrz.TestDecodeMRZ)

   - [# 131] CRP MRTD: 
--------------------------------------------------------------------------------
   95:         'issuing_country': issuing_country, \
   96:         'surname': surname, \
   97:         'given_names': given_names, \
   98:         'passport_number': passport_number, \
-  99:         'check_digit_passport': check_digit_passport, \
+  99:         'mutpy': check_digit_passport, \
  100:         'country_code': country_code, \
  101:         'birth_date': birth_date, \
  102:         'check_digit_birth': check_digit_birth, \
  103:         'sex': sex, \
--------------------------------------------------------------------------------
[0.00964 s] killed by test_decode_reference_uto (tests.test_decode_mrz.TestDecodeMRZ)

   - [# 132] CRP MRTD: 
--------------------------------------------------------------------------------
   95:         'issuing_country': issuing_country, \
   96:         'surname': surname, \
   97:         'given_names': given_names, \
   98:         'passport_number': passport_number, \
-  99:         'check_digit_passport': check_digit_passport, \
+  99:         '': check_digit_passport, \
  100:         'country_code': country_code, \
  101:         'birth_date': birth_date, \
  102:         'check_digit_birth': check_digit_birth, \
  103:         'sex': sex, \
--------------------------------------------------------------------------------
[0.01073 s] killed by test_decode_reference_uto (tests.test_decode_mrz.TestDecodeMRZ)

   - [# 133] CRP MRTD: 
--------------------------------------------------------------------------------
   96:         'surname': surname, \
   97:         'given_names': given_names, \
   98:         'passport_number': passport_number, \
   99:         'check_digit_passport': check_digit_passport, \
- 100:         'country_code': country_code, \
+ 100:         'mutpy': country_code, \
  101:         'birth_date': birth_date, \
  102:         'check_digit_birth': check_digit_birth, \
  103:         'sex': sex, \
  104:         'expiration_date': expiration_date, \
--------------------------------------------------------------------------------
[0.01067 s] killed by test_decode_gbr_passport (tests.test_decode_mrz.TestDecodeMRZ)

   - [# 134] CRP MRTD: 
--------------------------------------------------------------------------------
   96:         'surname': surname, \
   97:         'given_names': given_names, \
   98:         'passport_number': passport_number, \
   99:         'check_digit_passport': check_digit_passport, \
- 100:         'country_code': country_code, \
+ 100:         '': country_code, \
  101:         'birth_date': birth_date, \
  102:         'check_digit_birth': check_digit_birth, \
  103:         'sex': sex, \
  104:         'expiration_date': expiration_date, \
--------------------------------------------------------------------------------
[0.01122 s] killed by test_decode_gbr_passport (tests.test_decode_mrz.TestDecodeMRZ)

   - [# 135] CRP MRTD: 
--------------------------------------------------------------------------------
   97:         'given_names': given_names, \
   98:         'passport_number': passport_number, \
   99:         'check_digit_passport': check_digit_passport, \
  100:         'country_code': country_code, \
- 101:         'birth_date': birth_date, \
+ 101:         'mutpy': birth_date, \
  102:         'check_digit_birth': check_digit_birth, \
  103:         'sex': sex, \
  104:         'expiration_date': expiration_date, \
  105:         'check_digit_expiration': check_digit_expiration, \
--------------------------------------------------------------------------------
[0.01149 s] killed by test_decode_reference_uto (tests.test_decode_mrz.TestDecodeMRZ)

   - [# 136] CRP MRTD: 
--------------------------------------------------------------------------------
   97:         'given_names': given_names, \
   98:         'passport_number': passport_number, \
   99:         'check_digit_passport': check_digit_passport, \
  100:         'country_code': country_code, \
- 101:         'birth_date': birth_date, \
+ 101:         '': birth_date, \
  102:         'check_digit_birth': check_digit_birth, \
  103:         'sex': sex, \
  104:         'expiration_date': expiration_date, \
  105:         'check_digit_expiration': check_digit_expiration, \
--------------------------------------------------------------------------------
[0.01023 s] killed by test_decode_reference_uto (tests.test_decode_mrz.TestDecodeMRZ)
