   - [# 137] CRP MRTD: 
--------------------------------------------------------------------------------
   98:         'passport_number': passport_number, \
   99:         'check_digit_passport': check_digit_passport, \
  100:         'country_code': country_code, \
  101:         'birth_date': birth_date, \
- 102:         'check_digit_birth': check_digit_birth, \
+ 102:         'mutpy': check_digit_birth, \
  103:         'sex': sex, \
  104:         'expiration_date': expiration_date, \
  105:         'check_digit_expiration': check_digit_expiration, \
  106:         'personal_number': personal_number, \
--------------------------------------------------------------------------------
[0.01022 s] killed by test_decode_reference_uto (tests.test_decode_mrz.TestDecodeMRZ)

   - [# 138] CRP MRTD: 
--------------------------------------------------------------------------------
   98:         'passport_number': passport_number, \
   99:         'check_digit_passport': check_digit_passport, \
  100:         'country_code': country_code, \
  101:         'birth_date': birth_date, \
- 102:         'check_digit_birth': check_digit_birth, \
+ 102:         '': check_digit_birth, \
  103:         'sex': sex, \
  104:         'expiration_date': expiration_date, \
  105:         'check_digit_expiration': check_digit_expiration, \
  106:         'personal_number': personal_number, \
--------------------------------------------------------------------------------
[0.01024 s] killed by test_decode_reference_uto (tests.test_decode_mrz.TestDecodeMRZ)

   - [# 139] CRP MRTD: 
--------------------------------------------------------------------------------
   99:         'check_digit_passport': check_digit_passport, \
  100:         'country_code': country_code, \
  101:         'birth_date': birth_date, \
  102:         'check_digit_birth': check_digit_birth, \
- 103:         'sex': sex, \
+ 103:         'mutpy': sex, \
  104:         'expiration_date': expiration_date, \
  105:         'check_digit_expiration': check_digit_expiration, \
  106:         'personal_number': personal_number, \
  107:         'check_digit_personal': check_digit_personal, \
--------------------------------------------------------------------------------
[0.00964 s] killed by test_decode_reference_uto (tests.test_decode_mrz.TestDecodeMRZ)

   - [# 140] CRP MRTD: 
--------------------------------------------------------------------------------
   99:         'check_digit_passport': check_digit_passport, \
  100:         'country_code': country_code, \
  101:         'birth_date': birth_date, \
  102:         'check_digit_birth': check_digit_birth, \
- 103:         'sex': sex, \
+ 103:         '': sex, \
  104:         'expiration_date': expiration_date, \
  105:         'check_digit_expiration': check_digit_expiration, \
  106:         'personal_number': personal_number, \
  107:         'check_digit_personal': check_digit_personal, \
--------------------------------------------------------------------------------
[0.01009 s] killed by test_decode_reference_uto (tests.test_decode_mrz.TestDecodeMRZ)

   - [# 141] CRP MRTD: 
--------------------------------------------------------------------------------
  100:         'country_code': country_code, \
  101:         'birth_date': birth_date, \
  102:         'check_digit_birth': check_digit_birth, \
  103:         'sex': sex, \
- 104:         'expiration_date': expiration_date, \
+ 104:         'mutpy': expiration_date, \
  105:         'check_digit_expiration': check_digit_expiration, \
  106:         'personal_number': personal_number, \
  107:         'check_digit_personal': check_digit_personal, \
  108:         'overall_check_digit': overall_check_digit}
--------------------------------------------------------------------------------
[0.00996 s] killed by test_decode_reference_uto (tests.test_decode_mrz.TestDecodeMRZ)

   - [# 142] CRP MRTD: 
--------------------------------------------------------------------------------
  100:         'country_code': country_code, \
  101:         'birth_date': birth_date, \
  102:         'check_digit_birth': check_digit_birth, \
  103:         'sex': sex, \
- 104:         'expiration_date': expiration_date, \
+ 104:         '': expiration_date, \
  105:         'check_digit_expiration': check_digit_expiration, \
  106:         'personal_number': personal_number, \
  107:         'check_digit_personal': check_digit_personal, \
  108:         'overall_check_digit': overall_check_digit}
--------------------------------------------------------------------------------
[0.01044 s] killed by test_decode_reference_uto (tests.test_decode_mrz.TestDecodeMRZ)

   - [# 143] CRP MRTD: 
--------------------------------------------------------------------------------
  101:         'birth_date': birth_date, \
  102:         'check_digit_birth': check_digit_birth, \
  103:         'sex': sex, \
  104:         'expiration_date': expiration_date, \
- 105:         'check_digit_expiration': check_digit_expiration, \
+ 105:         'mutpy': check_digit_expiration, \
  106:         'personal_number': personal_number, \
  107:         'check_digit_personal': check_digit_personal, \
  108:         'overall_check_digit': overall_check_digit}
  109: 
--------------------------------------------------------------------------------
[0.00993 s] killed by test_decode_reference_uto (tests.test_decode_mrz.TestDecodeMRZ)

   - [# 144] CRP MRTD: 
--------------------------------------------------------------------------------
  101:         'birth_date': birth_date, \
  102:         'check_digit_birth': check_digit_birth, \
  103:         'sex': sex, \
  104:         'expiration_date': expiration_date, \
- 105:         'check_digit_expiration': check_digit_expiration, \
+ 105:         '': check_digit_expiration, \
  106:         'personal_number': personal_number, \
  107:         'check_digit_personal': check_digit_personal, \
  108:         'overall_check_digit': overall_check_digit}
  109: 
--------------------------------------------------------------------------------
[0.00990 s] killed by test_decode_reference_uto (tests.test_decode_mrz.TestDecodeMRZ)

   - [# 145] CRP MRTD: 
--------------------------------------------------------------------------------
  102:         'check_digit_birth': check_digit_birth, \
  103:         'sex': sex, \
  104:         'expiration_date': expiration_date, \
  105:         'check_digit_expiration': check_digit_expiration, \
- 106:         'personal_number': personal_number, \
+ 106:         'mutpy': personal_number, \
  107:         'check_digit_personal': check_digit_personal, \
  108:         'overall_check_digit': overall_check_digit}
  109: 
  110: 
--------------------------------------------------------------------------------
[0.01038 s] killed by test_decode_empty_personal_number (tests.test_decode_mrz.TestDecodeMRZ)

   - [# 146] CRP MRTD: 
--------------------------------------------------------------------------------
  102:         'check_digit_birth': check_digit_birth, \
  103:         'sex': sex, \
  104:         'expiration_date': expiration_date, \
  105:         'check_digit_expiration': check_digit_expiration, \
- 106:         'personal_number': personal_number, \
+ 106:         '': personal_number, \
  107:         'check_digit_personal': check_digit_personal, \
  108:         'overall_check_digit': overall_check_digit}
  109: 
  110: 
--------------------------------------------------------------------------------
[0.01206 s] killed by test_decode_empty_personal_number (tests.test_decode_mrz.TestDecodeMRZ)

   - [# 147] CRP MRTD: 
--------------------------------------------------------------------------------
  103:         'sex': sex, \
  104:         'expiration_date': expiration_date, \
  105:         'check_digit_expiration': check_digit_expiration, \
  106:         'personal_number': personal_number, \
- 107:         'check_digit_personal': check_digit_personal, \
+ 107:         'mutpy': check_digit_personal, \
  108:         'overall_check_digit': overall_check_digit}
  109: 
  110: 
  111: 
--------------------------------------------------------------------------------
[0.00985 s] killed by test_decode_reference_uto (tests.test_decode_mrz.TestDecodeMRZ)

   - [# 148] CRP MRTD: 
--------------------------------------------------------------------------------
  103:         'sex': sex, \
  104:         'expiration_date': expiration_date, \
  105:         'check_digit_expiration': check_digit_expiration, \
  106:         'personal_number': personal_number, \
- 107:         'check_digit_personal': check_digit_personal, \
+ 107:         '': check_digit_personal, \
  108:         'overall_check_digit': overall_check_digit}
  109: 
  110: 
  111: 
--------------------------------------------------------------------------------
[0.01035 s] killed by test_decode_reference_uto (tests.test_decode_mrz.TestDecodeMRZ)

   - [# 149] CRP MRTD: 
--------------------------------------------------------------------------------
  104:         'expiration_date': expiration_date, \
  105:         'check_digit_expiration': check_digit_expiration, \
  106:         'personal_number': personal_number, \
  107:         'check_digit_personal': check_digit_personal, \
- 108:         'overall_check_digit': overall_check_digit}
+ 108:         'mutpy': overall_check_digit}
  109: 
  110: 
  111: 
  112: _REQUIRED_ENCODE_FIELDS = [\
--------------------------------------------------------------------------------
[0.01116 s] killed by test_decode_reference_uto (tests.test_decode_mrz.TestDecodeMRZ)

   - [# 150] CRP MRTD: 
--------------------------------------------------------------------------------
  104:         'expiration_date': expiration_date, \
  105:         'check_digit_expiration': check_digit_expiration, \
  106:         'personal_number': personal_number, \
  107:         'check_digit_personal': check_digit_personal, \
- 108:         'overall_check_digit': overall_check_digit}
+ 108:         '': overall_check_digit}
  109: 
  110: 
  111: 
  112: _REQUIRED_ENCODE_FIELDS = [\
--------------------------------------------------------------------------------
[0.00978 s] killed by test_decode_reference_uto (tests.test_decode_mrz.TestDecodeMRZ)

   - [# 151] CRP MRTD: 
--------------------------------------------------------------------------------
  109: 
  110: 
  111: 
  112: _REQUIRED_ENCODE_FIELDS = [\
- 113:     'document_type', 'issuing_country', 'surname', 'given_names', \
+ 113:     'mutpy', 'issuing_country', 'surname', 'given_names', \
  114:     'passport_number', 'country_code', 'birth_date', 'sex', 'expiration_date']
  115: 
  116: 
  117: 
--------------------------------------------------------------------------------
[0.01024 s] killed by test_encode_fra_passport (tests.test_encode_mrz.TestEncodeMRZ)

   - [# 152] CRP MRTD: 
--------------------------------------------------------------------------------
  109: 
  110: 
  111: 
  112: _REQUIRED_ENCODE_FIELDS = [\
- 113:     'document_type', 'issuing_country', 'surname', 'given_names', \
+ 113:     '', 'issuing_country', 'surname', 'given_names', \
  114:     'passport_number', 'country_code', 'birth_date', 'sex', 'expiration_date']
  115: 
  116: 
  117: 
--------------------------------------------------------------------------------
[0.01071 s] killed by test_encode_fra_passport (tests.test_encode_mrz.TestEncodeMRZ)

   - [# 153] CRP MRTD: 
--------------------------------------------------------------------------------
  109: 
  110: 
  111: 
  112: _REQUIRED_ENCODE_FIELDS = [\
- 113:     'document_type', 'issuing_country', 'surname', 'given_names', \
+ 113:     'document_type', 'mutpy', 'surname', 'given_names', \
  114:     'passport_number', 'country_code', 'birth_date', 'sex', 'expiration_date']
  115: 
  116: 
  117: 
--------------------------------------------------------------------------------
[0.00997 s] killed by test_encode_fra_passport (tests.test_encode_mrz.TestEncodeMRZ)

   - [# 154] CRP MRTD: 
--------------------------------------------------------------------------------
  109: 
  110: 
  111: 
  112: _REQUIRED_ENCODE_FIELDS = [\
- 113:     'document_type', 'issuing_country', 'surname', 'given_names', \
+ 113:     'document_type', '', 'surname', 'given_names', \
  114:     'passport_number', 'country_code', 'birth_date', 'sex', 'expiration_date']
  115: 
  116: 
  117: 
--------------------------------------------------------------------------------
[0.01033 s] killed by test_encode_fra_passport (tests.test_encode_mrz.TestEncodeMRZ)

   - [# 155] CRP MRTD: 
--------------------------------------------------------------------------------
  109: 
  110: 
  111: 
  112: _REQUIRED_ENCODE_FIELDS = [\
- 113:     'document_type', 'issuing_country', 'surname', 'given_names', \
+ 113:     'document_type', 'issuing_country', 'mutpy', 'given_names', \
  114:     'passport_number', 'country_code', 'birth_date', 'sex', 'expiration_date']
  115: 
  116: 
  117: 
--------------------------------------------------------------------------------
[0.01011 s] killed by test_encode_fra_passport (tests.test_encode_mrz.TestEncodeMRZ)

   - [# 156] CRP MRTD: 
--------------------------------------------------------------------------------
  109: 
  110: 
  111: 
  112: _REQUIRED_ENCODE_FIELDS = [\
- 113:     'document_type', 'issuing_country', 'surname', 'given_names', \
+ 113:     'document_type', 'issuing_country', '', 'given_names', \
  114:     'passport_number', 'country_code', 'birth_date', 'sex', 'expiration_date']
  115: 
  116: 
  117: 
--------------------------------------------------------------------------------
[0.01018 s] killed by test_encode_fra_passport (tests.test_encode_mrz.TestEncodeMRZ)

   - [# 157] CRP MRTD: 
--------------------------------------------------------------------------------
  109: 
  110: 
  111: 
  112: _REQUIRED_ENCODE_FIELDS = [\
- 113:     'document_type', 'issuing_country', 'surname', 'given_names', \
+ 113:     'document_type', 'issuing_country', 'surname', 'mutpy', \
  114:     'passport_number', 'country_code', 'birth_date', 'sex', 'expiration_date']
  115: 
  116: 
  117: 
--------------------------------------------------------------------------------
[0.01033 s] killed by test_encode_fra_passport (tests.test_encode_mrz.TestEncodeMRZ)

   - [# 158] CRP MRTD: 
--------------------------------------------------------------------------------
  109: 
  110: 
  111: 
  112: _REQUIRED_ENCODE_FIELDS = [\
- 113:     'document_type', 'issuing_country', 'surname', 'given_names', \
+ 113:     'document_type', 'issuing_country', 'surname', '', \
  114:     'passport_number', 'country_code', 'birth_date', 'sex', 'expiration_date']
  115: 
  116: 
  117: 
--------------------------------------------------------------------------------
[0.01165 s] killed by test_encode_fra_passport (tests.test_encode_mrz.TestEncodeMRZ)

   - [# 159] CRP MRTD: 
--------------------------------------------------------------------------------
  110: 
  111: 
  112: _REQUIRED_ENCODE_FIELDS = [\
  113:     'document_type', 'issuing_country', 'surname', 'given_names', \
- 114:     'passport_number', 'country_code', 'birth_date', 'sex', 'expiration_date']
+ 114:     'mutpy', 'country_code', 'birth_date', 'sex', 'expiration_date']
  115: 
  116: 
  117: 
  118: def encode_mrz(fields: dict) -> tuple:
--------------------------------------------------------------------------------
[0.01107 s] killed by test_encode_fra_passport (tests.test_encode_mrz.TestEncodeMRZ)

   - [# 160] CRP MRTD: 
--------------------------------------------------------------------------------
  110: 
  111: 
  112: _REQUIRED_ENCODE_FIELDS = [\
  113:     'document_type', 'issuing_country', 'surname', 'given_names', \
- 114:     'passport_number', 'country_code', 'birth_date', 'sex', 'expiration_date']
+ 114:     '', 'country_code', 'birth_date', 'sex', 'expiration_date']
  115: 
  116: 
  117: 
  118: def encode_mrz(fields: dict) -> tuple:
--------------------------------------------------------------------------------
[0.01231 s] killed by test_encode_fra_passport (tests.test_encode_mrz.TestEncodeMRZ)

   - [# 161] CRP MRTD: 
--------------------------------------------------------------------------------
  110: 
  111: 
  112: _REQUIRED_ENCODE_FIELDS = [\
  113:     'document_type', 'issuing_country', 'surname', 'given_names', \
- 114:     'passport_number', 'country_code', 'birth_date', 'sex', 'expiration_date']
+ 114:     'passport_number', 'mutpy', 'birth_date', 'sex', 'expiration_date']
  115: 
  116: 
  117: 
  118: def encode_mrz(fields: dict) -> tuple:
--------------------------------------------------------------------------------
[0.01258 s] killed by test_encode_fra_passport (tests.test_encode_mrz.TestEncodeMRZ)

   - [# 162] CRP MRTD: 
--------------------------------------------------------------------------------
  110: 
  111: 
  112: _REQUIRED_ENCODE_FIELDS = [\
  113:     'document_type', 'issuing_country', 'surname', 'given_names', \
- 114:     'passport_number', 'country_code', 'birth_date', 'sex', 'expiration_date']
+ 114:     'passport_number', '', 'birth_date', 'sex', 'expiration_date']
  115: 
  116: 
  117: 
  118: def encode_mrz(fields: dict) -> tuple:
--------------------------------------------------------------------------------
[0.01049 s] killed by test_encode_fra_passport (tests.test_encode_mrz.TestEncodeMRZ)

   - [# 163] CRP MRTD: 
--------------------------------------------------------------------------------
  110: 
  111: 
  112: _REQUIRED_ENCODE_FIELDS = [\
  113:     'document_type', 'issuing_country', 'surname', 'given_names', \
- 114:     'passport_number', 'country_code', 'birth_date', 'sex', 'expiration_date']
+ 114:     'passport_number', 'country_code', 'mutpy', 'sex', 'expiration_date']
  115: 
  116: 
  117: 
  118: def encode_mrz(fields: dict) -> tuple:
--------------------------------------------------------------------------------
[0.01083 s] killed by test_encode_fra_passport (tests.test_encode_mrz.TestEncodeMRZ)

   - [# 164] CRP MRTD: 
--------------------------------------------------------------------------------
  110: 
  111: 
  112: _REQUIRED_ENCODE_FIELDS = [\
  113:     'document_type', 'issuing_country', 'surname', 'given_names', \
- 114:     'passport_number', 'country_code', 'birth_date', 'sex', 'expiration_date']
+ 114:     'passport_number', 'country_code', '', 'sex', 'expiration_date']
  115: 
  116: 
  117: 
  118: def encode_mrz(fields: dict) -> tuple:
--------------------------------------------------------------------------------
[0.01506 s] killed by test_encode_fra_passport (tests.test_encode_mrz.TestEncodeMRZ)

   - [# 165] CRP MRTD: 
--------------------------------------------------------------------------------
  110: 
  111: 
  112: _REQUIRED_ENCODE_FIELDS = [\
  113:     'document_type', 'issuing_country', 'surname', 'given_names', \
- 114:     'passport_number', 'country_code', 'birth_date', 'sex', 'expiration_date']
+ 114:     'passport_number', 'country_code', 'birth_date', 'mutpy', 'expiration_date']
  115: 
  116: 
  117: 
  118: def encode_mrz(fields: dict) -> tuple:
--------------------------------------------------------------------------------
[0.01280 s] killed by test_encode_fra_passport (tests.test_encode_mrz.TestEncodeMRZ)

   - [# 166] CRP MRTD: 
--------------------------------------------------------------------------------
  110: 
  111: 
  112: _REQUIRED_ENCODE_FIELDS = [\
  113:     'document_type', 'issuing_country', 'surname', 'given_names', \
- 114:     'passport_number', 'country_code', 'birth_date', 'sex', 'expiration_date']
+ 114:     'passport_number', 'country_code', 'birth_date', '', 'expiration_date']
  115: 
  116: 
  117: 
  118: def encode_mrz(fields: dict) -> tuple:
--------------------------------------------------------------------------------
[0.01230 s] killed by test_encode_fra_passport (tests.test_encode_mrz.TestEncodeMRZ)

   - [# 167] CRP MRTD: 
--------------------------------------------------------------------------------
  110: 
  111: 
  112: _REQUIRED_ENCODE_FIELDS = [\
  113:     'document_type', 'issuing_country', 'surname', 'given_names', \
- 114:     'passport_number', 'country_code', 'birth_date', 'sex', 'expiration_date']
+ 114:     'passport_number', 'country_code', 'birth_date', 'sex', 'mutpy']
  115: 
  116: 
  117: 
  118: def encode_mrz(fields: dict) -> tuple:
--------------------------------------------------------------------------------
[0.01157 s] killed by test_encode_fra_passport (tests.test_encode_mrz.TestEncodeMRZ)

   - [# 168] CRP MRTD: 
--------------------------------------------------------------------------------
  110: 
  111: 
  112: _REQUIRED_ENCODE_FIELDS = [\
  113:     'document_type', 'issuing_country', 'surname', 'given_names', \
- 114:     'passport_number', 'country_code', 'birth_date', 'sex', 'expiration_date']
+ 114:     'passport_number', 'country_code', 'birth_date', 'sex', '']
  115: 
  116: 
  117: 
  118: def encode_mrz(fields: dict) -> tuple:
--------------------------------------------------------------------------------
[0.01268 s] killed by test_encode_fra_passport (tests.test_encode_mrz.TestEncodeMRZ)

   - [# 169] CRP MRTD: 
--------------------------------------------------------------------------------
  125:     """
  126:     
  127:     for field in _REQUIRED_ENCODE_FIELDS:
  128:         if (field not in fields or not (fields[field])):
- 129:             raise ValueError(f'Required field {field} is missing or empty')
+ 129:             raise ValueError(f'mutpy{field} is missing or empty')
  130:     
  131:     
  132:     document_type = fields['document_type'].upper()
  133:     issuing_country = fields['issuing_country'].upper()
--------------------------------------------------------------------------------
[0.01203 s] survived

   - [# 170] CRP MRTD: 
--------------------------------------------------------------------------------
  125:     """
  126:     
  127:     for field in _REQUIRED_ENCODE_FIELDS:
  128:         if (field not in fields or not (fields[field])):
- 129:             raise ValueError(f'Required field {field} is missing or empty')
+ 129:             raise ValueError(f'{field} is missing or empty')
  130:     
  131:     
  132:     document_type = fields['document_type'].upper()
  133:     issuing_country = fields['issuing_country'].upper()
--------------------------------------------------------------------------------
[0.01273 s] survived

   - [# 171] CRP MRTD: 
--------------------------------------------------------------------------------
  125:     """
  126:     
  127:     for field in _REQUIRED_ENCODE_FIELDS:
  128:         if (field not in fields or not (fields[field])):
- 129:             raise ValueError(f'Required field {field} is missing or empty')
+ 129:             raise ValueError(f'Required field {field}mutpy')
  130:     
  131:     
  132:     document_type = fields['document_type'].upper()
  133:     issuing_country = fields['issuing_country'].upper()
--------------------------------------------------------------------------------
[0.01133 s] survived

   - [# 172] CRP MRTD: 
--------------------------------------------------------------------------------
  125:     """
  126:     
  127:     for field in _REQUIRED_ENCODE_FIELDS:
  128:         if (field not in fields or not (fields[field])):
- 129:             raise ValueError(f'Required field {field} is missing or empty')
+ 129:             raise ValueError(f'Required field {field}')
  130:     
  131:     
  132:     document_type = fields['document_type'].upper()
  133:     issuing_country = fields['issuing_country'].upper()
--------------------------------------------------------------------------------
[0.01223 s] survived

   - [# 173] CRP MRTD: 
--------------------------------------------------------------------------------
  128:         if (field not in fields or not (fields[field])):
  129:             raise ValueError(f'Required field {field} is missing or empty')
  130:     
  131:     
- 132:     document_type = fields['document_type'].upper()
+ 132:     document_type = fields['mutpy'].upper()
  133:     issuing_country = fields['issuing_country'].upper()
  134:     surname = fields['surname'].upper().replace(' ', '<')
  135:     given_names = fields['given_names'].upper().replace(' ', '<')
  136:     passport_number = fields['passport_number'].upper()
--------------------------------------------------------------------------------
[0.01281 s] killed by test_encode_fra_passport (tests.test_encode_mrz.TestEncodeMRZ)

   - [# 174] CRP MRTD: 
--------------------------------------------------------------------------------
  128:         if (field not in fields or not (fields[field])):
  129:             raise ValueError(f'Required field {field} is missing or empty')
  130:     
  131:     
- 132:     document_type = fields['document_type'].upper()
+ 132:     document_type = fields[''].upper()
  133:     issuing_country = fields['issuing_country'].upper()
  134:     surname = fields['surname'].upper().replace(' ', '<')
  135:     given_names = fields['given_names'].upper().replace(' ', '<')
  136:     passport_number = fields['passport_number'].upper()
--------------------------------------------------------------------------------
[0.01324 s] killed by test_encode_fra_passport (tests.test_encode_mrz.TestEncodeMRZ)

   - [# 175] CRP MRTD: 
--------------------------------------------------------------------------------
  129:             raise ValueError(f'Required field {field} is missing or empty')
  130:     
  131:     
  132:     document_type = fields['document_type'].upper()
- 133:     issuing_country = fields['issuing_country'].upper()
+ 133:     issuing_country = fields['mutpy'].upper()
  134:     surname = fields['surname'].upper().replace(' ', '<')
  135:     given_names = fields['given_names'].upper().replace(' ', '<')
  136:     passport_number = fields['passport_number'].upper()
  137:     country_code = fields['country_code'].upper()
--------------------------------------------------------------------------------
[0.01225 s] killed by test_encode_fra_passport (tests.test_encode_mrz.TestEncodeMRZ)

   - [# 176] CRP MRTD: 
--------------------------------------------------------------------------------
  129:             raise ValueError(f'Required field {field} is missing or empty')
  130:     
  131:     
  132:     document_type = fields['document_type'].upper()
- 133:     issuing_country = fields['issuing_country'].upper()
+ 133:     issuing_country = fields[''].upper()
  134:     surname = fields['surname'].upper().replace(' ', '<')
  135:     given_names = fields['given_names'].upper().replace(' ', '<')
  136:     passport_number = fields['passport_number'].upper()
  137:     country_code = fields['country_code'].upper()
--------------------------------------------------------------------------------
[0.01342 s] killed by test_encode_fra_passport (tests.test_encode_mrz.TestEncodeMRZ)

   - [# 177] CRP MRTD: 
--------------------------------------------------------------------------------
  130:     
  131:     
  132:     document_type = fields['document_type'].upper()
  133:     issuing_country = fields['issuing_country'].upper()
- 134:     surname = fields['surname'].upper().replace(' ', '<')
+ 134:     surname = fields['mutpy'].upper().replace(' ', '<')
  135:     given_names = fields['given_names'].upper().replace(' ', '<')
  136:     passport_number = fields['passport_number'].upper()
  137:     country_code = fields['country_code'].upper()
  138:     birth_date = fields['birth_date']
--------------------------------------------------------------------------------
[0.01337 s] killed by test_encode_fra_passport (tests.test_encode_mrz.TestEncodeMRZ)

   - [# 178] CRP MRTD: 
--------------------------------------------------------------------------------
  130:     
  131:     
  132:     document_type = fields['document_type'].upper()
  133:     issuing_country = fields['issuing_country'].upper()
- 134:     surname = fields['surname'].upper().replace(' ', '<')
+ 134:     surname = fields[''].upper().replace(' ', '<')
  135:     given_names = fields['given_names'].upper().replace(' ', '<')
  136:     passport_number = fields['passport_number'].upper()
  137:     country_code = fields['country_code'].upper()
  138:     birth_date = fields['birth_date']
--------------------------------------------------------------------------------
[0.01268 s] killed by test_encode_fra_passport (tests.test_encode_mrz.TestEncodeMRZ)

   - [# 179] CRP MRTD: 
--------------------------------------------------------------------------------
  130:     
  131:     
  132:     document_type = fields['document_type'].upper()
  133:     issuing_country = fields['issuing_country'].upper()
- 134:     surname = fields['surname'].upper().replace(' ', '<')
+ 134:     surname = fields['surname'].upper().replace('mutpy', '<')
  135:     given_names = fields['given_names'].upper().replace(' ', '<')
  136:     passport_number = fields['passport_number'].upper()
  137:     country_code = fields['country_code'].upper()
  138:     birth_date = fields['birth_date']
--------------------------------------------------------------------------------
[0.01286 s] survived
