   - [# 180] CRP MRTD: 
--------------------------------------------------------------------------------
  130:     
  131:     
  132:     document_type = fields['document_type'].upper()
  133:     issuing_country = fields['issuing_country'].upper()
- 134:     surname = fields['surname'].upper().replace(' ', '<')
+ 134:     surname = fields['surname'].upper().replace('', '<')
  135:     given_names = fields['given_names'].upper().replace(' ', '<')
  136:     passport_number = fields['passport_number'].upper()
  137:     country_code = fields['country_code'].upper()
  138:     birth_date = fields['birth_date']
--------------------------------------------------------------------------------
[0.01174 s] killed by test_encode_fra_passport (tests.test_encode_mrz.TestEncodeMRZ)

   - [# 181] CRP MRTD: 
--------------------------------------------------------------------------------
  130:     
  131:     
  132:     document_type = fields['document_type'].upper()
  133:     issuing_country = fields['issuing_country'].upper()
- 134:     surname = fields['surname'].upper().replace(' ', '<')
+ 134:     surname = fields['surname'].upper().replace(' ', 'mutpy')
  135:     given_names = fields['given_names'].upper().replace(' ', '<')
  136:     passport_number = fields['passport_number'].upper()
  137:     country_code = fields['country_code'].upper()
  138:     birth_date = fields['birth_date']
--------------------------------------------------------------------------------
[0.01262 s] survived

   - [# 182] CRP MRTD: 
--------------------------------------------------------------------------------
  130:     
  131:     
  132:     document_type = fields['document_type'].upper()
  133:     issuing_country = fields['issuing_country'].upper()
- 134:     surname = fields['surname'].upper().replace(' ', '<')
+ 134:     surname = fields['surname'].upper().replace(' ', '')
  135:     given_names = fields['given_names'].upper().replace(' ', '<')
  136:     passport_number = fields['passport_number'].upper()
  137:     country_code = fields['country_code'].upper()
  138:     birth_date = fields['birth_date']
--------------------------------------------------------------------------------
[0.01182 s] survived

   - [# 183] CRP MRTD: 
--------------------------------------------------------------------------------
  131:     
  132:     document_type = fields['document_type'].upper()
  133:     issuing_country = fields['issuing_country'].upper()
  134:     surname = fields['surname'].upper().replace(' ', '<')
- 135:     given_names = fields['given_names'].upper().replace(' ', '<')
+ 135:     given_names = fields['mutpy'].upper().replace(' ', '<')
  136:     passport_number = fields['passport_number'].upper()
  137:     country_code = fields['country_code'].upper()
  138:     birth_date = fields['birth_date']
  139:     sex = fields['sex'].upper()
--------------------------------------------------------------------------------
[0.01235 s] killed by test_encode_fra_passport (tests.test_encode_mrz.TestEncodeMRZ)

   - [# 184] CRP MRTD: 
--------------------------------------------------------------------------------
  131:     
  132:     document_type = fields['document_type'].upper()
  133:     issuing_country = fields['issuing_country'].upper()
  134:     surname = fields['surname'].upper().replace(' ', '<')
- 135:     given_names = fields['given_names'].upper().replace(' ', '<')
+ 135:     given_names = fields[''].upper().replace(' ', '<')
  136:     passport_number = fields['passport_number'].upper()
  137:     country_code = fields['country_code'].upper()
  138:     birth_date = fields['birth_date']
  139:     sex = fields['sex'].upper()
--------------------------------------------------------------------------------
[0.01185 s] killed by test_encode_fra_passport (tests.test_encode_mrz.TestEncodeMRZ)

   - [# 185] CRP MRTD: 
--------------------------------------------------------------------------------
  131:     
  132:     document_type = fields['document_type'].upper()
  133:     issuing_country = fields['issuing_country'].upper()
  134:     surname = fields['surname'].upper().replace(' ', '<')
- 135:     given_names = fields['given_names'].upper().replace(' ', '<')
+ 135:     given_names = fields['given_names'].upper().replace('mutpy', '<')
  136:     passport_number = fields['passport_number'].upper()
  137:     country_code = fields['country_code'].upper()
  138:     birth_date = fields['birth_date']
  139:     sex = fields['sex'].upper()
--------------------------------------------------------------------------------
[0.01222 s] killed by test_encode_fra_passport (tests.test_encode_mrz.TestEncodeMRZ)

   - [# 186] CRP MRTD: 
--------------------------------------------------------------------------------
  131:     
  132:     document_type = fields['document_type'].upper()
  133:     issuing_country = fields['issuing_country'].upper()
  134:     surname = fields['surname'].upper().replace(' ', '<')
- 135:     given_names = fields['given_names'].upper().replace(' ', '<')
+ 135:     given_names = fields['given_names'].upper().replace('', '<')
  136:     passport_number = fields['passport_number'].upper()
  137:     country_code = fields['country_code'].upper()
  138:     birth_date = fields['birth_date']
  139:     sex = fields['sex'].upper()
--------------------------------------------------------------------------------
[0.01295 s] killed by test_encode_fra_passport (tests.test_encode_mrz.TestEncodeMRZ)

   - [# 187] CRP MRTD: 
--------------------------------------------------------------------------------
  131:     
  132:     document_type = fields['document_type'].upper()
  133:     issuing_country = fields['issuing_country'].upper()
  134:     surname = fields['surname'].upper().replace(' ', '<')
- 135:     given_names = fields['given_names'].upper().replace(' ', '<')
+ 135:     given_names = fields['given_names'].upper().replace(' ', 'mutpy')
  136:     passport_number = fields['passport_number'].upper()
  137:     country_code = fields['country_code'].upper()
  138:     birth_date = fields['birth_date']
  139:     sex = fields['sex'].upper()
--------------------------------------------------------------------------------
[0.01293 s] killed by test_encode_fra_passport (tests.test_encode_mrz.TestEncodeMRZ)

   - [# 188] CRP MRTD: 
--------------------------------------------------------------------------------
  131:     
  132:     document_type = fields['document_type'].upper()
  133:     issuing_country = fields['issuing_country'].upper()
  134:     surname = fields['surname'].upper().replace(' ', '<')
- 135:     given_names = fields['given_names'].upper().replace(' ', '<')
+ 135:     given_names = fields['given_names'].upper().replace(' ', '')
  136:     passport_number = fields['passport_number'].upper()
  137:     country_code = fields['country_code'].upper()
  138:     birth_date = fields['birth_date']
  139:     sex = fields['sex'].upper()
--------------------------------------------------------------------------------
[0.01265 s] killed by test_encode_fra_passport (tests.test_encode_mrz.TestEncodeMRZ)

   - [# 189] CRP MRTD: 
--------------------------------------------------------------------------------
  132:     document_type = fields['document_type'].upper()
  133:     issuing_country = fields['issuing_country'].upper()
  134:     surname = fields['surname'].upper().replace(' ', '<')
  135:     given_names = fields['given_names'].upper().replace(' ', '<')
- 136:     passport_number = fields['passport_number'].upper()
+ 136:     passport_number = fields['mutpy'].upper()
  137:     country_code = fields['country_code'].upper()
  138:     birth_date = fields['birth_date']
  139:     sex = fields['sex'].upper()
  140:     expiration_date = fields['expiration_date']
--------------------------------------------------------------------------------
[0.01240 s] killed by test_encode_fra_passport (tests.test_encode_mrz.TestEncodeMRZ)

   - [# 190] CRP MRTD: 
--------------------------------------------------------------------------------
  132:     document_type = fields['document_type'].upper()
  133:     issuing_country = fields['issuing_country'].upper()
  134:     surname = fields['surname'].upper().replace(' ', '<')
  135:     given_names = fields['given_names'].upper().replace(' ', '<')
- 136:     passport_number = fields['passport_number'].upper()
+ 136:     passport_number = fields[''].upper()
  137:     country_code = fields['country_code'].upper()
  138:     birth_date = fields['birth_date']
  139:     sex = fields['sex'].upper()
  140:     expiration_date = fields['expiration_date']
--------------------------------------------------------------------------------
[0.01298 s] killed by test_encode_fra_passport (tests.test_encode_mrz.TestEncodeMRZ)

   - [# 191] CRP MRTD: 
--------------------------------------------------------------------------------
  133:     issuing_country = fields['issuing_country'].upper()
  134:     surname = fields['surname'].upper().replace(' ', '<')
  135:     given_names = fields['given_names'].upper().replace(' ', '<')
  136:     passport_number = fields['passport_number'].upper()
- 137:     country_code = fields['country_code'].upper()
+ 137:     country_code = fields['mutpy'].upper()
  138:     birth_date = fields['birth_date']
  139:     sex = fields['sex'].upper()
  140:     expiration_date = fields['expiration_date']
  141:     personal_number = fields.get('personal_number', '').upper().replace(' ', '<')
--------------------------------------------------------------------------------
[0.01183 s] killed by test_encode_fra_passport (tests.test_encode_mrz.TestEncodeMRZ)

   - [# 192] CRP MRTD: 
--------------------------------------------------------------------------------
  133:     issuing_country = fields['issuing_country'].upper()
  134:     surname = fields['surname'].upper().replace(' ', '<')
  135:     given_names = fields['given_names'].upper().replace(' ', '<')
  136:     passport_number = fields['passport_number'].upper()
- 137:     country_code = fields['country_code'].upper()
+ 137:     country_code = fields[''].upper()
  138:     birth_date = fields['birth_date']
  139:     sex = fields['sex'].upper()
  140:     expiration_date = fields['expiration_date']
  141:     personal_number = fields.get('personal_number', '').upper().replace(' ', '<')
--------------------------------------------------------------------------------
[0.01273 s] killed by test_encode_fra_passport (tests.test_encode_mrz.TestEncodeMRZ)

   - [# 193] CRP MRTD: 
--------------------------------------------------------------------------------
  134:     surname = fields['surname'].upper().replace(' ', '<')
  135:     given_names = fields['given_names'].upper().replace(' ', '<')
  136:     passport_number = fields['passport_number'].upper()
  137:     country_code = fields['country_code'].upper()
- 138:     birth_date = fields['birth_date']
+ 138:     birth_date = fields['mutpy']
  139:     sex = fields['sex'].upper()
  140:     expiration_date = fields['expiration_date']
  141:     personal_number = fields.get('personal_number', '').upper().replace(' ', '<')
  142:     
--------------------------------------------------------------------------------
[0.01281 s] killed by test_encode_fra_passport (tests.test_encode_mrz.TestEncodeMRZ)

   - [# 194] CRP MRTD: 
--------------------------------------------------------------------------------
  134:     surname = fields['surname'].upper().replace(' ', '<')
  135:     given_names = fields['given_names'].upper().replace(' ', '<')
  136:     passport_number = fields['passport_number'].upper()
  137:     country_code = fields['country_code'].upper()
- 138:     birth_date = fields['birth_date']
+ 138:     birth_date = fields['']
  139:     sex = fields['sex'].upper()
  140:     expiration_date = fields['expiration_date']
  141:     personal_number = fields.get('personal_number', '').upper().replace(' ', '<')
  142:     
--------------------------------------------------------------------------------
[0.01429 s] killed by test_encode_fra_passport (tests.test_encode_mrz.TestEncodeMRZ)

   - [# 195] CRP MRTD: 
--------------------------------------------------------------------------------
  135:     given_names = fields['given_names'].upper().replace(' ', '<')
  136:     passport_number = fields['passport_number'].upper()
  137:     country_code = fields['country_code'].upper()
  138:     birth_date = fields['birth_date']
- 139:     sex = fields['sex'].upper()
+ 139:     sex = fields['mutpy'].upper()
  140:     expiration_date = fields['expiration_date']
  141:     personal_number = fields.get('personal_number', '').upper().replace(' ', '<')
  142:     
  143:     
--------------------------------------------------------------------------------
[0.01371 s] killed by test_encode_fra_passport (tests.test_encode_mrz.TestEncodeMRZ)

   - [# 196] CRP MRTD: 
--------------------------------------------------------------------------------
  135:     given_names = fields['given_names'].upper().replace(' ', '<')
  136:     passport_number = fields['passport_number'].upper()
  137:     country_code = fields['country_code'].upper()
  138:     birth_date = fields['birth_date']
- 139:     sex = fields['sex'].upper()
+ 139:     sex = fields[''].upper()
  140:     expiration_date = fields['expiration_date']
  141:     personal_number = fields.get('personal_number', '').upper().replace(' ', '<')
  142:     
  143:     
--------------------------------------------------------------------------------
[0.01169 s] killed by test_encode_fra_passport (tests.test_encode_mrz.TestEncodeMRZ)

   - [# 197] CRP MRTD: 
--------------------------------------------------------------------------------
  136:     passport_number = fields['passport_number'].upper()
  137:     country_code = fields['country_code'].upper()
  138:     birth_date = fields['birth_date']
  139:     sex = fields['sex'].upper()
- 140:     expiration_date = fields['expiration_date']
+ 140:     expiration_date = fields['mutpy']
  141:     personal_number = fields.get('personal_number', '').upper().replace(' ', '<')
  142:     
  143:     
  144:     if (len(document_type) < 1 or len(document_type) > 2):
--------------------------------------------------------------------------------
[0.01322 s] killed by test_encode_fra_passport (tests.test_encode_mrz.TestEncodeMRZ)

   - [# 198] CRP MRTD: 
--------------------------------------------------------------------------------
  136:     passport_number = fields['passport_number'].upper()
  137:     country_code = fields['country_code'].upper()
  138:     birth_date = fields['birth_date']
  139:     sex = fields['sex'].upper()
- 140:     expiration_date = fields['expiration_date']
+ 140:     expiration_date = fields['']
  141:     personal_number = fields.get('personal_number', '').upper().replace(' ', '<')
  142:     
  143:     
  144:     if (len(document_type) < 1 or len(document_type) > 2):
--------------------------------------------------------------------------------
[0.01226 s] killed by test_encode_fra_passport (tests.test_encode_mrz.TestEncodeMRZ)

   - [# 199] CRP MRTD: 
--------------------------------------------------------------------------------
  137:     country_code = fields['country_code'].upper()
  138:     birth_date = fields['birth_date']
  139:     sex = fields['sex'].upper()
  140:     expiration_date = fields['expiration_date']
- 141:     personal_number = fields.get('personal_number', '').upper().replace(' ', '<')
+ 141:     personal_number = fields.get('mutpy', '').upper().replace(' ', '<')
  142:     
  143:     
  144:     if (len(document_type) < 1 or len(document_type) > 2):
  145:         raise ValueError('document_type must be 1-2 characters')
--------------------------------------------------------------------------------
[0.01370 s] killed by test_encode_reference_uto (tests.test_encode_mrz.TestEncodeMRZ)

   - [# 200] CRP MRTD: 
--------------------------------------------------------------------------------
  137:     country_code = fields['country_code'].upper()
  138:     birth_date = fields['birth_date']
  139:     sex = fields['sex'].upper()
  140:     expiration_date = fields['expiration_date']
- 141:     personal_number = fields.get('personal_number', '').upper().replace(' ', '<')
+ 141:     personal_number = fields.get('', '').upper().replace(' ', '<')
  142:     
  143:     
  144:     if (len(document_type) < 1 or len(document_type) > 2):
  145:         raise ValueError('document_type must be 1-2 characters')
--------------------------------------------------------------------------------
[0.01238 s] killed by test_encode_reference_uto (tests.test_encode_mrz.TestEncodeMRZ)

   - [# 201] CRP MRTD: 
--------------------------------------------------------------------------------
  137:     country_code = fields['country_code'].upper()
  138:     birth_date = fields['birth_date']
  139:     sex = fields['sex'].upper()
  140:     expiration_date = fields['expiration_date']
- 141:     personal_number = fields.get('personal_number', '').upper().replace(' ', '<')
+ 141:     personal_number = fields.get('personal_number', 'mutpy').upper().replace(' ', '<')
  142:     
  143:     
  144:     if (len(document_type) < 1 or len(document_type) > 2):
  145:         raise ValueError('document_type must be 1-2 characters')
--------------------------------------------------------------------------------
[0.01338 s] killed by test_encode_no_personal_number (tests.test_encode_mrz.TestEncodeMRZ)

   - [# 202] CRP MRTD: 
--------------------------------------------------------------------------------
  137:     country_code = fields['country_code'].upper()
  138:     birth_date = fields['birth_date']
  139:     sex = fields['sex'].upper()
  140:     expiration_date = fields['expiration_date']
- 141:     personal_number = fields.get('personal_number', '').upper().replace(' ', '<')
+ 141:     personal_number = fields.get('personal_number', '').upper().replace('mutpy', '<')
  142:     
  143:     
  144:     if (len(document_type) < 1 or len(document_type) > 2):
  145:         raise ValueError('document_type must be 1-2 characters')
--------------------------------------------------------------------------------
[0.01295 s] survived

   - [# 203] CRP MRTD: 
--------------------------------------------------------------------------------
  137:     country_code = fields['country_code'].upper()
  138:     birth_date = fields['birth_date']
  139:     sex = fields['sex'].upper()
  140:     expiration_date = fields['expiration_date']
- 141:     personal_number = fields.get('personal_number', '').upper().replace(' ', '<')
+ 141:     personal_number = fields.get('personal_number', '').upper().replace('', '<')
  142:     
  143:     
  144:     if (len(document_type) < 1 or len(document_type) > 2):
  145:         raise ValueError('document_type must be 1-2 characters')
--------------------------------------------------------------------------------
[0.01223 s] killed by test_encode_reference_uto (tests.test_encode_mrz.TestEncodeMRZ)

   - [# 204] CRP MRTD: 
--------------------------------------------------------------------------------
  137:     country_code = fields['country_code'].upper()
  138:     birth_date = fields['birth_date']
  139:     sex = fields['sex'].upper()
  140:     expiration_date = fields['expiration_date']
- 141:     personal_number = fields.get('personal_number', '').upper().replace(' ', '<')
+ 141:     personal_number = fields.get('personal_number', '').upper().replace(' ', 'mutpy')
  142:     
  143:     
  144:     if (len(document_type) < 1 or len(document_type) > 2):
  145:         raise ValueError('document_type must be 1-2 characters')
--------------------------------------------------------------------------------
[0.01300 s] survived

   - [# 205] CRP MRTD: 
--------------------------------------------------------------------------------
  137:     country_code = fields['country_code'].upper()
  138:     birth_date = fields['birth_date']
  139:     sex = fields['sex'].upper()
  140:     expiration_date = fields['expiration_date']
- 141:     personal_number = fields.get('personal_number', '').upper().replace(' ', '<')
+ 141:     personal_number = fields.get('personal_number', '').upper().replace(' ', '')
  142:     
  143:     
  144:     if (len(document_type) < 1 or len(document_type) > 2):
  145:         raise ValueError('document_type must be 1-2 characters')
--------------------------------------------------------------------------------
[0.01817 s] survived

   - [# 206] CRP MRTD: 
--------------------------------------------------------------------------------
  140:     expiration_date = fields['expiration_date']
  141:     personal_number = fields.get('personal_number', '').upper().replace(' ', '<')
  142:     
  143:     
- 144:     if (len(document_type) < 1 or len(document_type) > 2):
+ 144:     if (len(document_type) < 2 or len(document_type) > 2):
  145:         raise ValueError('document_type must be 1-2 characters')
  146:     if len(issuing_country) != 3:
  147:         raise ValueError('issuing_country must be exactly 3 characters')
  148:     if len(passport_number) != 9:
--------------------------------------------------------------------------------
[0.01212 s] killed by test_encode_fra_passport (tests.test_encode_mrz.TestEncodeMRZ)

   - [# 207] CRP MRTD: 
--------------------------------------------------------------------------------
  140:     expiration_date = fields['expiration_date']
  141:     personal_number = fields.get('personal_number', '').upper().replace(' ', '<')
  142:     
  143:     
- 144:     if (len(document_type) < 1 or len(document_type) > 2):
+ 144:     if (len(document_type) < 1 or len(document_type) > 3):
  145:         raise ValueError('document_type must be 1-2 characters')
  146:     if len(issuing_country) != 3:
  147:         raise ValueError('issuing_country must be exactly 3 characters')
  148:     if len(passport_number) != 9:
--------------------------------------------------------------------------------
[0.01249 s] survived

   - [# 208] CRP MRTD: 
--------------------------------------------------------------------------------
  141:     personal_number = fields.get('personal_number', '').upper().replace(' ', '<')
  142:     
  143:     
  144:     if (len(document_type) < 1 or len(document_type) > 2):
- 145:         raise ValueError('document_type must be 1-2 characters')
+ 145:         raise ValueError('mutpy')
  146:     if len(issuing_country) != 3:
  147:         raise ValueError('issuing_country must be exactly 3 characters')
  148:     if len(passport_number) != 9:
  149:         raise ValueError('passport_number must be exactly 9 characters')
--------------------------------------------------------------------------------
[0.01203 s] survived

   - [# 209] CRP MRTD: 
--------------------------------------------------------------------------------
  141:     personal_number = fields.get('personal_number', '').upper().replace(' ', '<')
  142:     
  143:     
  144:     if (len(document_type) < 1 or len(document_type) > 2):
- 145:         raise ValueError('document_type must be 1-2 characters')
+ 145:         raise ValueError('')
  146:     if len(issuing_country) != 3:
  147:         raise ValueError('issuing_country must be exactly 3 characters')
  148:     if len(passport_number) != 9:
  149:         raise ValueError('passport_number must be exactly 9 characters')
--------------------------------------------------------------------------------
[0.01202 s] survived

   - [# 210] CRP MRTD: 
--------------------------------------------------------------------------------
  142:     
  143:     
  144:     if (len(document_type) < 1 or len(document_type) > 2):
  145:         raise ValueError('document_type must be 1-2 characters')
- 146:     if len(issuing_country) != 3:
+ 146:     if len(issuing_country) != 4:
  147:         raise ValueError('issuing_country must be exactly 3 characters')
  148:     if len(passport_number) != 9:
  149:         raise ValueError('passport_number must be exactly 9 characters')
  150:     if len(country_code) != 3:
--------------------------------------------------------------------------------
[0.01306 s] killed by test_encode_fra_passport (tests.test_encode_mrz.TestEncodeMRZ)

   - [# 211] CRP MRTD: 
--------------------------------------------------------------------------------
  143:     
  144:     if (len(document_type) < 1 or len(document_type) > 2):
  145:         raise ValueError('document_type must be 1-2 characters')
  146:     if len(issuing_country) != 3:
- 147:         raise ValueError('issuing_country must be exactly 3 characters')
+ 147:         raise ValueError('mutpy')
  148:     if len(passport_number) != 9:
  149:         raise ValueError('passport_number must be exactly 9 characters')
  150:     if len(country_code) != 3:
  151:         raise ValueError('country_code must be exactly 3 characters')
--------------------------------------------------------------------------------
[0.01247 s] survived

   - [# 212] CRP MRTD: 
--------------------------------------------------------------------------------
  143:     
  144:     if (len(document_type) < 1 or len(document_type) > 2):
  145:         raise ValueError('document_type must be 1-2 characters')
  146:     if len(issuing_country) != 3:
- 147:         raise ValueError('issuing_country must be exactly 3 characters')
+ 147:         raise ValueError('')
  148:     if len(passport_number) != 9:
  149:         raise ValueError('passport_number must be exactly 9 characters')
  150:     if len(country_code) != 3:
  151:         raise ValueError('country_code must be exactly 3 characters')
--------------------------------------------------------------------------------
[0.01156 s] survived

   - [# 213] CRP MRTD: 
--------------------------------------------------------------------------------
  144:     if (len(document_type) < 1 or len(document_type) > 2):
  145:         raise ValueError('document_type must be 1-2 characters')
  146:     if len(issuing_country) != 3:
  147:         raise ValueError('issuing_country must be exactly 3 characters')
- 148:     if len(passport_number) != 9:
+ 148:     if len(passport_number) != 10:
  149:         raise ValueError('passport_number must be exactly 9 characters')
  150:     if len(country_code) != 3:
  151:         raise ValueError('country_code must be exactly 3 characters')
  152:     if len(birth_date) != 6:
--------------------------------------------------------------------------------
[0.01277 s] killed by test_encode_fra_passport (tests.test_encode_mrz.TestEncodeMRZ)

   - [# 214] CRP MRTD: 
--------------------------------------------------------------------------------
  145:         raise ValueError('document_type must be 1-2 characters')
  146:     if len(issuing_country) != 3:
  147:         raise ValueError('issuing_country must be exactly 3 characters')
  148:     if len(passport_number) != 9:
- 149:         raise ValueError('passport_number must be exactly 9 characters')
+ 149:         raise ValueError('mutpy')
  150:     if len(country_code) != 3:
  151:         raise ValueError('country_code must be exactly 3 characters')
  152:     if len(birth_date) != 6:
  153:         raise ValueError('birth_date must be exactly 6 characters')
--------------------------------------------------------------------------------
[0.01160 s] survived

   - [# 215] CRP MRTD: 
--------------------------------------------------------------------------------
  145:         raise ValueError('document_type must be 1-2 characters')
  146:     if len(issuing_country) != 3:
  147:         raise ValueError('issuing_country must be exactly 3 characters')
  148:     if len(passport_number) != 9:
- 149:         raise ValueError('passport_number must be exactly 9 characters')
+ 149:         raise ValueError('')
  150:     if len(country_code) != 3:
  151:         raise ValueError('country_code must be exactly 3 characters')
  152:     if len(birth_date) != 6:
  153:         raise ValueError('birth_date must be exactly 6 characters')
--------------------------------------------------------------------------------
[0.01229 s] survived

   - [# 216] CRP MRTD: 
--------------------------------------------------------------------------------
  146:     if len(issuing_country) != 3:
  147:         raise ValueError('issuing_country must be exactly 3 characters')
  148:     if len(passport_number) != 9:
  149:         raise ValueError('passport_number must be exactly 9 characters')
- 150:     if len(country_code) != 3:
+ 150:     if len(country_code) != 4:
  151:         raise ValueError('country_code must be exactly 3 characters')
  152:     if len(birth_date) != 6:
  153:         raise ValueError('birth_date must be exactly 6 characters')
  154:     if len(sex) != 1:
--------------------------------------------------------------------------------
[0.01344 s] killed by test_encode_fra_passport (tests.test_encode_mrz.TestEncodeMRZ)

   - [# 217] CRP MRTD: 
--------------------------------------------------------------------------------
  147:         raise ValueError('issuing_country must be exactly 3 characters')
  148:     if len(passport_number) != 9:
  149:         raise ValueError('passport_number must be exactly 9 characters')
  150:     if len(country_code) != 3:
- 151:         raise ValueError('country_code must be exactly 3 characters')
+ 151:         raise ValueError('mutpy')
  152:     if len(birth_date) != 6:
  153:         raise ValueError('birth_date must be exactly 6 characters')
  154:     if len(sex) != 1:
  155:         raise ValueError('sex must be exactly 1 character')
--------------------------------------------------------------------------------
[0.01242 s] survived
