   - [# 218] CRP MRTD: 
--------------------------------------------------------------------------------
  147:         raise ValueError('issuing_country must be exactly 3 characters')
  148:     if len(passport_number) != 9:
  149:         raise ValueError('passport_number must be exactly 9 characters')
  150:     if len(country_code) != 3:
- 151:         raise ValueError('country_code must be exactly 3 characters')
+ 151:         raise ValueError('')
  152:     if len(birth_date) != 6:
  153:         raise ValueError('birth_date must be exactly 6 characters')
  154:     if len(sex) != 1:
  155:         raise ValueError('sex must be exactly 1 character')
--------------------------------------------------------------------------------
[0.01317 s] survived

   - [# 219] CRP MRTD: 
--------------------------------------------------------------------------------
  148:     if len(passport_number) != 9:
  149:         raise ValueError('passport_number must be exactly 9 characters')
  150:     if len(country_code) != 3:
  151:         raise ValueError('country_code must be exactly 3 characters')
- 152:     if len(birth_date) != 6:
+ 152:     if len(birth_date) != 7:
  153:         raise ValueError('birth_date must be exactly 6 characters')
  154:     if len(sex) != 1:
  155:         raise ValueError('sex must be exactly 1 character')
  156:     if len(expiration_date) != 6:
--------------------------------------------------------------------------------
[0.01626 s] killed by test_encode_fra_passport (tests.test_encode_mrz.TestEncodeMRZ)

   - [# 220] CRP MRTD: 
--------------------------------------------------------------------------------
  149:         raise ValueError('passport_number must be exactly 9 characters')
  150:     if len(country_code) != 3:
  151:         raise ValueError('country_code must be exactly 3 characters')
  152:     if len(birth_date) != 6:
- 153:         raise ValueError('birth_date must be exactly 6 characters')
+ 153:         raise ValueError('mutpy')
  154:     if len(sex) != 1:
  155:         raise ValueError('sex must be exactly 1 character')
  156:     if len(expiration_date) != 6:
  157:         raise ValueError('expiration_date must be exactly 6 characters')
--------------------------------------------------------------------------------
[0.01238 s] survived

   - [# 221] CRP MRTD: 
--------------------------------------------------------------------------------
  149:         raise ValueError('passport_number must be exactly 9 characters')
  150:     if len(country_code) != 3:
  151:         raise ValueError('country_code must be exactly 3 characters')
  152:     if len(birth_date) != 6:
- 153:         raise ValueError('birth_date must be exactly 6 characters')
+ 153:         raise ValueError('')
  154:     if len(sex) != 1:
  155:         raise ValueError('sex must be exactly 1 character')
  156:     if len(expiration_date) != 6:
  157:         raise ValueError('expiration_date must be exactly 6 characters')
--------------------------------------------------------------------------------
[0.01217 s] survived

   - [# 222] CRP MRTD: 
--------------------------------------------------------------------------------
  150:     if len(country_code) != 3:
  151:         raise ValueError('country_code must be exactly 3 characters')
  152:     if len(birth_date) != 6:
  153:         raise ValueError('birth_date must be exactly 6 characters')
- 154:     if len(sex) != 1:
+ 154:     if len(sex) != 2:
  155:         raise ValueError('sex must be exactly 1 character')
  156:     if len(expiration_date) != 6:
  157:         raise ValueError('expiration_date must be exactly 6 characters')
  158:     
--------------------------------------------------------------------------------
[0.01191 s] killed by test_encode_fra_passport (tests.test_encode_mrz.TestEncodeMRZ)

   - [# 223] CRP MRTD: 
--------------------------------------------------------------------------------
  151:         raise ValueError('country_code must be exactly 3 characters')
  152:     if len(birth_date) != 6:
  153:         raise ValueError('birth_date must be exactly 6 characters')
  154:     if len(sex) != 1:
- 155:         raise ValueError('sex must be exactly 1 character')
+ 155:         raise ValueError('mutpy')
  156:     if len(expiration_date) != 6:
  157:         raise ValueError('expiration_date must be exactly 6 characters')
  158:     
  159:     
--------------------------------------------------------------------------------
[0.01156 s] survived

   - [# 224] CRP MRTD: 
--------------------------------------------------------------------------------
  151:         raise ValueError('country_code must be exactly 3 characters')
  152:     if len(birth_date) != 6:
  153:         raise ValueError('birth_date must be exactly 6 characters')
  154:     if len(sex) != 1:
- 155:         raise ValueError('sex must be exactly 1 character')
+ 155:         raise ValueError('')
  156:     if len(expiration_date) != 6:
  157:         raise ValueError('expiration_date must be exactly 6 characters')
  158:     
  159:     
--------------------------------------------------------------------------------
[0.01400 s] survived

   - [# 225] CRP MRTD: 
--------------------------------------------------------------------------------
  152:     if len(birth_date) != 6:
  153:         raise ValueError('birth_date must be exactly 6 characters')
  154:     if len(sex) != 1:
  155:         raise ValueError('sex must be exactly 1 character')
- 156:     if len(expiration_date) != 6:
+ 156:     if len(expiration_date) != 7:
  157:         raise ValueError('expiration_date must be exactly 6 characters')
  158:     
  159:     
  160:     doc_type_padded = document_type.ljust(2, '<')
--------------------------------------------------------------------------------
[0.01595 s] killed by test_encode_fra_passport (tests.test_encode_mrz.TestEncodeMRZ)

   - [# 226] CRP MRTD: 
--------------------------------------------------------------------------------
  153:         raise ValueError('birth_date must be exactly 6 characters')
  154:     if len(sex) != 1:
  155:         raise ValueError('sex must be exactly 1 character')
  156:     if len(expiration_date) != 6:
- 157:         raise ValueError('expiration_date must be exactly 6 characters')
+ 157:         raise ValueError('mutpy')
  158:     
  159:     
  160:     doc_type_padded = document_type.ljust(2, '<')
  161:     names_field = (surname + '<<') + given_names
--------------------------------------------------------------------------------
[0.01386 s] survived

   - [# 227] CRP MRTD: 
--------------------------------------------------------------------------------
  153:         raise ValueError('birth_date must be exactly 6 characters')
  154:     if len(sex) != 1:
  155:         raise ValueError('sex must be exactly 1 character')
  156:     if len(expiration_date) != 6:
- 157:         raise ValueError('expiration_date must be exactly 6 characters')
+ 157:         raise ValueError('')
  158:     
  159:     
  160:     doc_type_padded = document_type.ljust(2, '<')
  161:     names_field = (surname + '<<') + given_names
--------------------------------------------------------------------------------
[0.01226 s] survived

   - [# 228] CRP MRTD: 
--------------------------------------------------------------------------------
  156:     if len(expiration_date) != 6:
  157:         raise ValueError('expiration_date must be exactly 6 characters')
  158:     
  159:     
- 160:     doc_type_padded = document_type.ljust(2, '<')
+ 160:     doc_type_padded = document_type.ljust(3, '<')
  161:     names_field = (surname + '<<') + given_names
  162:     names_field = names_field[:39].ljust(39, '<')
  163:     line1 = (doc_type_padded + issuing_country) + names_field
  164:     
--------------------------------------------------------------------------------
[0.01195 s] killed by test_encode_fra_passport (tests.test_encode_mrz.TestEncodeMRZ)

   - [# 229] CRP MRTD: 
--------------------------------------------------------------------------------
  156:     if len(expiration_date) != 6:
  157:         raise ValueError('expiration_date must be exactly 6 characters')
  158:     
  159:     
- 160:     doc_type_padded = document_type.ljust(2, '<')
+ 160:     doc_type_padded = document_type.ljust(2, 'mutpy')
  161:     names_field = (surname + '<<') + given_names
  162:     names_field = names_field[:39].ljust(39, '<')
  163:     line1 = (doc_type_padded + issuing_country) + names_field
  164:     
--------------------------------------------------------------------------------
[5.00912 s] timeout

   - [# 230] CRP MRTD: 
--------------------------------------------------------------------------------
  156:     if len(expiration_date) != 6:
  157:         raise ValueError('expiration_date must be exactly 6 characters')
  158:     
  159:     
- 160:     doc_type_padded = document_type.ljust(2, '<')
+ 160:     doc_type_padded = document_type.ljust(2, '')
  161:     names_field = (surname + '<<') + given_names
  162:     names_field = names_field[:39].ljust(39, '<')
  163:     line1 = (doc_type_padded + issuing_country) + names_field
  164:     
--------------------------------------------------------------------------------
[5.00677 s] timeout

   - [# 231] CRP MRTD: 
--------------------------------------------------------------------------------
  157:         raise ValueError('expiration_date must be exactly 6 characters')
  158:     
  159:     
  160:     doc_type_padded = document_type.ljust(2, '<')
- 161:     names_field = (surname + '<<') + given_names
+ 161:     names_field = (surname + 'mutpy') + given_names
  162:     names_field = names_field[:39].ljust(39, '<')
  163:     line1 = (doc_type_padded + issuing_country) + names_field
  164:     
  165:     
--------------------------------------------------------------------------------
[0.01305 s] killed by test_encode_fra_passport (tests.test_encode_mrz.TestEncodeMRZ)

   - [# 232] CRP MRTD: 
--------------------------------------------------------------------------------
  157:         raise ValueError('expiration_date must be exactly 6 characters')
  158:     
  159:     
  160:     doc_type_padded = document_type.ljust(2, '<')
- 161:     names_field = (surname + '<<') + given_names
+ 161:     names_field = (surname + '') + given_names
  162:     names_field = names_field[:39].ljust(39, '<')
  163:     line1 = (doc_type_padded + issuing_country) + names_field
  164:     
  165:     
--------------------------------------------------------------------------------
[0.01230 s] killed by test_encode_fra_passport (tests.test_encode_mrz.TestEncodeMRZ)

   - [# 233] CRP MRTD: 
--------------------------------------------------------------------------------
  158:     
  159:     
  160:     doc_type_padded = document_type.ljust(2, '<')
  161:     names_field = (surname + '<<') + given_names
- 162:     names_field = names_field[:39].ljust(39, '<')
+ 162:     names_field = names_field[:40].ljust(39, '<')
  163:     line1 = (doc_type_padded + issuing_country) + names_field
  164:     
  165:     
  166:     personal_number_padded = personal_number[:14].ljust(14, '<')
--------------------------------------------------------------------------------
[0.01313 s] survived

   - [# 234] CRP MRTD: 
--------------------------------------------------------------------------------
  158:     
  159:     
  160:     doc_type_padded = document_type.ljust(2, '<')
  161:     names_field = (surname + '<<') + given_names
- 162:     names_field = names_field[:39].ljust(39, '<')
+ 162:     names_field = names_field[:39].ljust(40, '<')
  163:     line1 = (doc_type_padded + issuing_country) + names_field
  164:     
  165:     
  166:     personal_number_padded = personal_number[:14].ljust(14, '<')
--------------------------------------------------------------------------------
[0.01341 s] killed by test_encode_fra_passport (tests.test_encode_mrz.TestEncodeMRZ)

   - [# 235] CRP MRTD: 
--------------------------------------------------------------------------------
  158:     
  159:     
  160:     doc_type_padded = document_type.ljust(2, '<')
  161:     names_field = (surname + '<<') + given_names
- 162:     names_field = names_field[:39].ljust(39, '<')
+ 162:     names_field = names_field[:39].ljust(39, 'mutpy')
  163:     line1 = (doc_type_padded + issuing_country) + names_field
  164:     
  165:     
  166:     personal_number_padded = personal_number[:14].ljust(14, '<')
--------------------------------------------------------------------------------
[5.00721 s] timeout

   - [# 236] CRP MRTD: 
--------------------------------------------------------------------------------
  158:     
  159:     
  160:     doc_type_padded = document_type.ljust(2, '<')
  161:     names_field = (surname + '<<') + given_names
- 162:     names_field = names_field[:39].ljust(39, '<')
+ 162:     names_field = names_field[:39].ljust(39, '')
  163:     line1 = (doc_type_padded + issuing_country) + names_field
  164:     
  165:     
  166:     personal_number_padded = personal_number[:14].ljust(14, '<')
--------------------------------------------------------------------------------
[5.00728 s] timeout

   - [# 237] CRP MRTD: 
--------------------------------------------------------------------------------
  162:     names_field = names_field[:39].ljust(39, '<')
  163:     line1 = (doc_type_padded + issuing_country) + names_field
  164:     
  165:     
- 166:     personal_number_padded = personal_number[:14].ljust(14, '<')
+ 166:     personal_number_padded = personal_number[:15].ljust(14, '<')
  167:     
  168:     cd_passport = calculate_check_digit(passport_number)
  169:     cd_birth = calculate_check_digit(birth_date)
  170:     cd_expiration = calculate_check_digit(expiration_date)
--------------------------------------------------------------------------------
[0.01255 s] survived

   - [# 238] CRP MRTD: 
--------------------------------------------------------------------------------
  162:     names_field = names_field[:39].ljust(39, '<')
  163:     line1 = (doc_type_padded + issuing_country) + names_field
  164:     
  165:     
- 166:     personal_number_padded = personal_number[:14].ljust(14, '<')
+ 166:     personal_number_padded = personal_number[:14].ljust(15, '<')
  167:     
  168:     cd_passport = calculate_check_digit(passport_number)
  169:     cd_birth = calculate_check_digit(birth_date)
  170:     cd_expiration = calculate_check_digit(expiration_date)
--------------------------------------------------------------------------------
[0.01006 s] killed by test_encode_no_personal_number (tests.test_encode_mrz.TestEncodeMRZ)

   - [# 239] CRP MRTD: 
--------------------------------------------------------------------------------
  162:     names_field = names_field[:39].ljust(39, '<')
  163:     line1 = (doc_type_padded + issuing_country) + names_field
  164:     
  165:     
- 166:     personal_number_padded = personal_number[:14].ljust(14, '<')
+ 166:     personal_number_padded = personal_number[:14].ljust(14, 'mutpy')
  167:     
  168:     cd_passport = calculate_check_digit(passport_number)
  169:     cd_birth = calculate_check_digit(birth_date)
  170:     cd_expiration = calculate_check_digit(expiration_date)
--------------------------------------------------------------------------------
[5.00682 s] timeout

   - [# 240] CRP MRTD: 
--------------------------------------------------------------------------------
  162:     names_field = names_field[:39].ljust(39, '<')
  163:     line1 = (doc_type_padded + issuing_country) + names_field
  164:     
  165:     
- 166:     personal_number_padded = personal_number[:14].ljust(14, '<')
+ 166:     personal_number_padded = personal_number[:14].ljust(14, '')
  167:     
  168:     cd_passport = calculate_check_digit(passport_number)
  169:     cd_birth = calculate_check_digit(birth_date)
  170:     cd_expiration = calculate_check_digit(expiration_date)
--------------------------------------------------------------------------------
[5.00671 s] timeout

   - [# 241] CRP MRTD: 
--------------------------------------------------------------------------------
  179:     
  180:     
  181:     
  182:     
- 183:     overall_data = (line2_partial[0:10] + line2_partial[13:20]) + line2_partial[21:43]
+ 183:     overall_data = (line2_partial[1:10] + line2_partial[13:20]) + line2_partial[21:43]
  184:     cd_overall = calculate_check_digit(overall_data)
  185:     
  186:     line2 = line2_partial + str(cd_overall)
  187:     
--------------------------------------------------------------------------------
[0.01221 s] killed by test_encode_reference_uto (tests.test_encode_mrz.TestEncodeMRZ)

   - [# 242] CRP MRTD: 
--------------------------------------------------------------------------------
  179:     
  180:     
  181:     
  182:     
- 183:     overall_data = (line2_partial[0:10] + line2_partial[13:20]) + line2_partial[21:43]
+ 183:     overall_data = (line2_partial[0:11] + line2_partial[13:20]) + line2_partial[21:43]
  184:     cd_overall = calculate_check_digit(overall_data)
  185:     
  186:     line2 = line2_partial + str(cd_overall)
  187:     
--------------------------------------------------------------------------------
[0.01159 s] killed by test_encode_reference_uto (tests.test_encode_mrz.TestEncodeMRZ)

   - [# 243] CRP MRTD: 
--------------------------------------------------------------------------------
  179:     
  180:     
  181:     
  182:     
- 183:     overall_data = (line2_partial[0:10] + line2_partial[13:20]) + line2_partial[21:43]
+ 183:     overall_data = (line2_partial[0:10] + line2_partial[14:20]) + line2_partial[21:43]
  184:     cd_overall = calculate_check_digit(overall_data)
  185:     
  186:     line2 = line2_partial + str(cd_overall)
  187:     
--------------------------------------------------------------------------------
[0.01273 s] killed by test_encode_reference_uto (tests.test_encode_mrz.TestEncodeMRZ)

   - [# 244] CRP MRTD: 
--------------------------------------------------------------------------------
  179:     
  180:     
  181:     
  182:     
- 183:     overall_data = (line2_partial[0:10] + line2_partial[13:20]) + line2_partial[21:43]
+ 183:     overall_data = (line2_partial[0:10] + line2_partial[13:21]) + line2_partial[21:43]
  184:     cd_overall = calculate_check_digit(overall_data)
  185:     
  186:     line2 = line2_partial + str(cd_overall)
  187:     
--------------------------------------------------------------------------------
[0.01054 s] killed by test_encode_reference_uto (tests.test_encode_mrz.TestEncodeMRZ)

   - [# 245] CRP MRTD: 
--------------------------------------------------------------------------------
  179:     
  180:     
  181:     
  182:     
- 183:     overall_data = (line2_partial[0:10] + line2_partial[13:20]) + line2_partial[21:43]
+ 183:     overall_data = (line2_partial[0:10] + line2_partial[13:20]) + line2_partial[22:43]
  184:     cd_overall = calculate_check_digit(overall_data)
  185:     
  186:     line2 = line2_partial + str(cd_overall)
  187:     
--------------------------------------------------------------------------------
[0.01019 s] killed by test_encode_reference_uto (tests.test_encode_mrz.TestEncodeMRZ)

   - [# 246] CRP MRTD: 
--------------------------------------------------------------------------------
  179:     
  180:     
  181:     
  182:     
- 183:     overall_data = (line2_partial[0:10] + line2_partial[13:20]) + line2_partial[21:43]
+ 183:     overall_data = (line2_partial[0:10] + line2_partial[13:20]) + line2_partial[21:44]
  184:     cd_overall = calculate_check_digit(overall_data)
  185:     
  186:     line2 = line2_partial + str(cd_overall)
  187:     
--------------------------------------------------------------------------------
[0.00991 s] survived

   - [# 247] CRP MRTD: 
--------------------------------------------------------------------------------
  196:     per-field results. Validates ALL fields (does not stop at first mismatch).
  197:     '''
  198:     
  199:     checks = [\
- 200:         ('passport_number', line2[0:9], line2[9]), \
+ 200:         ('mutpy', line2[0:9], line2[9]), \
  201:         ('birth_date', line2[13:19], line2[19]), \
  202:         ('expiration_date', line2[21:27], line2[27]), \
  203:         ('personal_number', line2[28:42], line2[42])]
  204:     
--------------------------------------------------------------------------------
[0.01020 s] killed by test_validate_returns_all_fields (tests.test_validate_mrz.TestValidateMRZ)

   - [# 248] CRP MRTD: 
--------------------------------------------------------------------------------
  196:     per-field results. Validates ALL fields (does not stop at first mismatch).
  197:     '''
  198:     
  199:     checks = [\
- 200:         ('passport_number', line2[0:9], line2[9]), \
+ 200:         ('', line2[0:9], line2[9]), \
  201:         ('birth_date', line2[13:19], line2[19]), \
  202:         ('expiration_date', line2[21:27], line2[27]), \
  203:         ('personal_number', line2[28:42], line2[42])]
  204:     
--------------------------------------------------------------------------------
[0.00994 s] killed by test_validate_returns_all_fields (tests.test_validate_mrz.TestValidateMRZ)

   - [# 249] CRP MRTD: 
--------------------------------------------------------------------------------
  196:     per-field results. Validates ALL fields (does not stop at first mismatch).
  197:     '''
  198:     
  199:     checks = [\
- 200:         ('passport_number', line2[0:9], line2[9]), \
+ 200:         ('passport_number', line2[1:9], line2[9]), \
  201:         ('birth_date', line2[13:19], line2[19]), \
  202:         ('expiration_date', line2[21:27], line2[27]), \
  203:         ('personal_number', line2[28:42], line2[42])]
  204:     
--------------------------------------------------------------------------------
[0.01011 s] killed by test_validate_all_correct_uto (tests.test_validate_mrz.TestValidateMRZ)

   - [# 250] CRP MRTD: 
--------------------------------------------------------------------------------
  196:     per-field results. Validates ALL fields (does not stop at first mismatch).
  197:     '''
  198:     
  199:     checks = [\
- 200:         ('passport_number', line2[0:9], line2[9]), \
+ 200:         ('passport_number', line2[0:10], line2[9]), \
  201:         ('birth_date', line2[13:19], line2[19]), \
  202:         ('expiration_date', line2[21:27], line2[27]), \
  203:         ('personal_number', line2[28:42], line2[42])]
  204:     
--------------------------------------------------------------------------------
[0.00983 s] killed by test_validate_all_correct_usa (tests.test_validate_mrz.TestValidateMRZ)

   - [# 251] CRP MRTD: 
--------------------------------------------------------------------------------
  196:     per-field results. Validates ALL fields (does not stop at first mismatch).
  197:     '''
  198:     
  199:     checks = [\
- 200:         ('passport_number', line2[0:9], line2[9]), \
+ 200:         ('passport_number', line2[0:9], line2[10]), \
  201:         ('birth_date', line2[13:19], line2[19]), \
  202:         ('expiration_date', line2[21:27], line2[27]), \
  203:         ('personal_number', line2[28:42], line2[42])]
  204:     
--------------------------------------------------------------------------------
[0.00998 s] killed by test_validate_all_correct_usa (tests.test_validate_mrz.TestValidateMRZ)

   - [# 252] CRP MRTD: 
--------------------------------------------------------------------------------
  197:     '''
  198:     
  199:     checks = [\
  200:         ('passport_number', line2[0:9], line2[9]), \
- 201:         ('birth_date', line2[13:19], line2[19]), \
+ 201:         ('mutpy', line2[13:19], line2[19]), \
  202:         ('expiration_date', line2[21:27], line2[27]), \
  203:         ('personal_number', line2[28:42], line2[42])]
  204:     
  205:     
--------------------------------------------------------------------------------
[0.01026 s] killed by test_validate_returns_all_fields (tests.test_validate_mrz.TestValidateMRZ)

   - [# 253] CRP MRTD: 
--------------------------------------------------------------------------------
  197:     '''
  198:     
  199:     checks = [\
  200:         ('passport_number', line2[0:9], line2[9]), \
- 201:         ('birth_date', line2[13:19], line2[19]), \
+ 201:         ('', line2[13:19], line2[19]), \
  202:         ('expiration_date', line2[21:27], line2[27]), \
  203:         ('personal_number', line2[28:42], line2[42])]
  204:     
  205:     
--------------------------------------------------------------------------------
[0.01197 s] killed by test_validate_returns_all_fields (tests.test_validate_mrz.TestValidateMRZ)

   - [# 254] CRP MRTD: 
--------------------------------------------------------------------------------
  197:     '''
  198:     
  199:     checks = [\
  200:         ('passport_number', line2[0:9], line2[9]), \
- 201:         ('birth_date', line2[13:19], line2[19]), \
+ 201:         ('birth_date', line2[14:19], line2[19]), \
  202:         ('expiration_date', line2[21:27], line2[27]), \
  203:         ('personal_number', line2[28:42], line2[42])]
  204:     
  205:     
--------------------------------------------------------------------------------
[0.01429 s] killed by test_validate_all_correct_usa (tests.test_validate_mrz.TestValidateMRZ)

   - [# 255] CRP MRTD: 
--------------------------------------------------------------------------------
  197:     '''
  198:     
  199:     checks = [\
  200:         ('passport_number', line2[0:9], line2[9]), \
- 201:         ('birth_date', line2[13:19], line2[19]), \
+ 201:         ('birth_date', line2[13:20], line2[19]), \
  202:         ('expiration_date', line2[21:27], line2[27]), \
  203:         ('personal_number', line2[28:42], line2[42])]
  204:     
  205:     
--------------------------------------------------------------------------------
[0.01340 s] killed by test_validate_all_correct_usa (tests.test_validate_mrz.TestValidateMRZ)

   - [# 256] CRP MRTD: 
--------------------------------------------------------------------------------
  197:     '''
  198:     
  199:     checks = [\
  200:         ('passport_number', line2[0:9], line2[9]), \
- 201:         ('birth_date', line2[13:19], line2[19]), \
+ 201:         ('birth_date', line2[13:19], line2[20]), \
  202:         ('expiration_date', line2[21:27], line2[27]), \
  203:         ('personal_number', line2[28:42], line2[42])]
  204:     
  205:     
--------------------------------------------------------------------------------
[0.01181 s] killed by test_validate_all_correct_usa (tests.test_validate_mrz.TestValidateMRZ)

   - [# 257] CRP MRTD: 
--------------------------------------------------------------------------------
  198:     
  199:     checks = [\
  200:         ('passport_number', line2[0:9], line2[9]), \
  201:         ('birth_date', line2[13:19], line2[19]), \
- 202:         ('expiration_date', line2[21:27], line2[27]), \
+ 202:         ('mutpy', line2[21:27], line2[27]), \
  203:         ('personal_number', line2[28:42], line2[42])]
  204:     
  205:     
  206:     fields = []
--------------------------------------------------------------------------------
[0.01462 s] killed by test_validate_returns_all_fields (tests.test_validate_mrz.TestValidateMRZ)

   - [# 258] CRP MRTD: 
--------------------------------------------------------------------------------
  198:     
  199:     checks = [\
  200:         ('passport_number', line2[0:9], line2[9]), \
  201:         ('birth_date', line2[13:19], line2[19]), \
- 202:         ('expiration_date', line2[21:27], line2[27]), \
+ 202:         ('', line2[21:27], line2[27]), \
  203:         ('personal_number', line2[28:42], line2[42])]
  204:     
  205:     
  206:     fields = []
--------------------------------------------------------------------------------
[0.01637 s] killed by test_validate_returns_all_fields (tests.test_validate_mrz.TestValidateMRZ)

   - [# 259] CRP MRTD: 
--------------------------------------------------------------------------------
  198:     
  199:     checks = [\
  200:         ('passport_number', line2[0:9], line2[9]), \
  201:         ('birth_date', line2[13:19], line2[19]), \
- 202:         ('expiration_date', line2[21:27], line2[27]), \
+ 202:         ('expiration_date', line2[22:27], line2[27]), \
  203:         ('personal_number', line2[28:42], line2[42])]
  204:     
  205:     
  206:     fields = []
--------------------------------------------------------------------------------
[0.01584 s] killed by test_validate_all_correct_usa (tests.test_validate_mrz.TestValidateMRZ)

   - [# 260] CRP MRTD: 
--------------------------------------------------------------------------------
  198:     
  199:     checks = [\
  200:         ('passport_number', line2[0:9], line2[9]), \
  201:         ('birth_date', line2[13:19], line2[19]), \
- 202:         ('expiration_date', line2[21:27], line2[27]), \
+ 202:         ('expiration_date', line2[21:28], line2[27]), \
  203:         ('personal_number', line2[28:42], line2[42])]
  204:     
  205:     
  206:     fields = []
--------------------------------------------------------------------------------
[0.01353 s] killed by test_validate_all_correct_usa (tests.test_validate_mrz.TestValidateMRZ)
