   - [# 261] CRP MRTD: 
--------------------------------------------------------------------------------
  198:     
  199:     checks = [\
  200:         ('passport_number', line2[0:9], line2[9]), \
  201:         ('birth_date', line2[13:19], line2[19]), \
- 202:         ('expiration_date', line2[21:27], line2[27]), \
+ 202:         ('expiration_date', line2[21:27], line2[28]), \
  203:         ('personal_number', line2[28:42], line2[42])]
  204:     
  205:     
  206:     fields = []
--------------------------------------------------------------------------------
[0.01377 s] killed by test_validate_all_correct_usa (tests.test_validate_mrz.TestValidateMRZ)

   - [# 262] CRP MRTD: 
--------------------------------------------------------------------------------
  199:     checks = [\
  200:         ('passport_number', line2[0:9], line2[9]), \
  201:         ('birth_date', line2[13:19], line2[19]), \
  202:         ('expiration_date', line2[21:27], line2[27]), \
- 203:         ('personal_number', line2[28:42], line2[42])]
+ 203:         ('mutpy', line2[28:42], line2[42])]
  204:     
  205:     
  206:     fields = []
  207:     all_match = True
--------------------------------------------------------------------------------
[0.01503 s] killed by test_validate_returns_all_fields (tests.test_validate_mrz.TestValidateMRZ)

   - [# 263] CRP MRTD: 
--------------------------------------------------------------------------------
  199:     checks = [\
  200:         ('passport_number', line2[0:9], line2[9]), \
  201:         ('birth_date', line2[13:19], line2[19]), \
  202:         ('expiration_date', line2[21:27], line2[27]), \
- 203:         ('personal_number', line2[28:42], line2[42])]
+ 203:         ('', line2[28:42], line2[42])]
  204:     
  205:     
  206:     fields = []
  207:     all_match = True
--------------------------------------------------------------------------------
[0.01937 s] killed by test_validate_returns_all_fields (tests.test_validate_mrz.TestValidateMRZ)

   - [# 264] CRP MRTD: 
--------------------------------------------------------------------------------
  199:     checks = [\
  200:         ('passport_number', line2[0:9], line2[9]), \
  201:         ('birth_date', line2[13:19], line2[19]), \
  202:         ('expiration_date', line2[21:27], line2[27]), \
- 203:         ('personal_number', line2[28:42], line2[42])]
+ 203:         ('personal_number', line2[29:42], line2[42])]
  204:     
  205:     
  206:     fields = []
  207:     all_match = True
--------------------------------------------------------------------------------
[0.01618 s] killed by test_validate_all_correct_uto (tests.test_validate_mrz.TestValidateMRZ)

   - [# 265] CRP MRTD: 
--------------------------------------------------------------------------------
  199:     checks = [\
  200:         ('passport_number', line2[0:9], line2[9]), \
  201:         ('birth_date', line2[13:19], line2[19]), \
  202:         ('expiration_date', line2[21:27], line2[27]), \
- 203:         ('personal_number', line2[28:42], line2[42])]
+ 203:         ('personal_number', line2[28:43], line2[42])]
  204:     
  205:     
  206:     fields = []
  207:     all_match = True
--------------------------------------------------------------------------------
[0.01222 s] killed by test_validate_all_correct_uto (tests.test_validate_mrz.TestValidateMRZ)

   - [# 266] CRP MRTD: 
--------------------------------------------------------------------------------
  199:     checks = [\
  200:         ('passport_number', line2[0:9], line2[9]), \
  201:         ('birth_date', line2[13:19], line2[19]), \
  202:         ('expiration_date', line2[21:27], line2[27]), \
- 203:         ('personal_number', line2[28:42], line2[42])]
+ 203:         ('personal_number', line2[28:42], line2[43])]
  204:     
  205:     
  206:     fields = []
  207:     all_match = True
--------------------------------------------------------------------------------
[0.01336 s] killed by test_validate_all_correct_usa (tests.test_validate_mrz.TestValidateMRZ)

   - [# 267] CRP MRTD: 
--------------------------------------------------------------------------------
  211:         match = expected == stored_digit
  212:         if not match:
  213:             all_match = False
  214:         fields.append({\
- 215:             'field_name': field_name, \
+ 215:             'mutpy': field_name, \
  216:             'expected': expected, \
  217:             'actual': stored_digit, \
  218:             'match': match})
  219:     
--------------------------------------------------------------------------------
[0.01263 s] killed by test_validate_all_correct_usa (tests.test_validate_mrz.TestValidateMRZ)

   - [# 268] CRP MRTD: 
--------------------------------------------------------------------------------
  211:         match = expected == stored_digit
  212:         if not match:
  213:             all_match = False
  214:         fields.append({\
- 215:             'field_name': field_name, \
+ 215:             '': field_name, \
  216:             'expected': expected, \
  217:             'actual': stored_digit, \
  218:             'match': match})
  219:     
--------------------------------------------------------------------------------
[0.01151 s] killed by test_validate_all_correct_usa (tests.test_validate_mrz.TestValidateMRZ)

   - [# 269] CRP MRTD: 
--------------------------------------------------------------------------------
  212:         if not match:
  213:             all_match = False
  214:         fields.append({\
  215:             'field_name': field_name, \
- 216:             'expected': expected, \
+ 216:             'mutpy': expected, \
  217:             'actual': stored_digit, \
  218:             'match': match})
  219:     
  220:     
--------------------------------------------------------------------------------
[0.01143 s] killed by test_validate_returns_all_fields (tests.test_validate_mrz.TestValidateMRZ)

   - [# 270] CRP MRTD: 
--------------------------------------------------------------------------------
  212:         if not match:
  213:             all_match = False
  214:         fields.append({\
  215:             'field_name': field_name, \
- 216:             'expected': expected, \
+ 216:             '': expected, \
  217:             'actual': stored_digit, \
  218:             'match': match})
  219:     
  220:     
--------------------------------------------------------------------------------
[0.01119 s] killed by test_validate_returns_all_fields (tests.test_validate_mrz.TestValidateMRZ)

   - [# 271] CRP MRTD: 
--------------------------------------------------------------------------------
  213:             all_match = False
  214:         fields.append({\
  215:             'field_name': field_name, \
  216:             'expected': expected, \
- 217:             'actual': stored_digit, \
+ 217:             'mutpy': stored_digit, \
  218:             'match': match})
  219:     
  220:     
  221:     
--------------------------------------------------------------------------------
[0.01119 s] killed by test_validate_returns_all_fields (tests.test_validate_mrz.TestValidateMRZ)

   - [# 272] CRP MRTD: 
--------------------------------------------------------------------------------
  213:             all_match = False
  214:         fields.append({\
  215:             'field_name': field_name, \
  216:             'expected': expected, \
- 217:             'actual': stored_digit, \
+ 217:             '': stored_digit, \
  218:             'match': match})
  219:     
  220:     
  221:     
--------------------------------------------------------------------------------
[0.01114 s] killed by test_validate_returns_all_fields (tests.test_validate_mrz.TestValidateMRZ)

   - [# 273] CRP MRTD: 
--------------------------------------------------------------------------------
  214:         fields.append({\
  215:             'field_name': field_name, \
  216:             'expected': expected, \
  217:             'actual': stored_digit, \
- 218:             'match': match})
+ 218:             'mutpy': match})
  219:     
  220:     
  221:     
  222:     overall_data = (line2[0:10] + line2[13:20]) + line2[21:43]
--------------------------------------------------------------------------------
[0.01135 s] killed by test_validate_all_correct_usa (tests.test_validate_mrz.TestValidateMRZ)

   - [# 274] CRP MRTD: 
--------------------------------------------------------------------------------
  214:         fields.append({\
  215:             'field_name': field_name, \
  216:             'expected': expected, \
  217:             'actual': stored_digit, \
- 218:             'match': match})
+ 218:             '': match})
  219:     
  220:     
  221:     
  222:     overall_data = (line2[0:10] + line2[13:20]) + line2[21:43]
--------------------------------------------------------------------------------
[0.01330 s] killed by test_validate_all_correct_usa (tests.test_validate_mrz.TestValidateMRZ)

   - [# 275] CRP MRTD: 
--------------------------------------------------------------------------------
  218:             'match': match})
  219:     
  220:     
  221:     
- 222:     overall_data = (line2[0:10] + line2[13:20]) + line2[21:43]
+ 222:     overall_data = (line2[1:10] + line2[13:20]) + line2[21:43]
  223:     overall_expected = str(calculate_check_digit(overall_data))
  224:     overall_stored = line2[43]
  225:     overall_match = overall_expected == overall_stored
  226:     if not overall_match:
--------------------------------------------------------------------------------
[0.01458 s] killed by test_validate_all_correct_uto (tests.test_validate_mrz.TestValidateMRZ)

   - [# 276] CRP MRTD: 
--------------------------------------------------------------------------------
  218:             'match': match})
  219:     
  220:     
  221:     
- 222:     overall_data = (line2[0:10] + line2[13:20]) + line2[21:43]
+ 222:     overall_data = (line2[0:11] + line2[13:20]) + line2[21:43]
  223:     overall_expected = str(calculate_check_digit(overall_data))
  224:     overall_stored = line2[43]
  225:     overall_match = overall_expected == overall_stored
  226:     if not overall_match:
--------------------------------------------------------------------------------
[0.01352 s] killed by test_validate_all_correct_uto (tests.test_validate_mrz.TestValidateMRZ)

   - [# 277] CRP MRTD: 
--------------------------------------------------------------------------------
  218:             'match': match})
  219:     
  220:     
  221:     
- 222:     overall_data = (line2[0:10] + line2[13:20]) + line2[21:43]
+ 222:     overall_data = (line2[0:10] + line2[14:20]) + line2[21:43]
  223:     overall_expected = str(calculate_check_digit(overall_data))
  224:     overall_stored = line2[43]
  225:     overall_match = overall_expected == overall_stored
  226:     if not overall_match:
--------------------------------------------------------------------------------
[0.01297 s] killed by test_validate_all_correct_usa (tests.test_validate_mrz.TestValidateMRZ)

   - [# 278] CRP MRTD: 
--------------------------------------------------------------------------------
  218:             'match': match})
  219:     
  220:     
  221:     
- 222:     overall_data = (line2[0:10] + line2[13:20]) + line2[21:43]
+ 222:     overall_data = (line2[0:10] + line2[13:21]) + line2[21:43]
  223:     overall_expected = str(calculate_check_digit(overall_data))
  224:     overall_stored = line2[43]
  225:     overall_match = overall_expected == overall_stored
  226:     if not overall_match:
--------------------------------------------------------------------------------
[0.01211 s] killed by test_validate_all_correct_usa (tests.test_validate_mrz.TestValidateMRZ)

   - [# 279] CRP MRTD: 
--------------------------------------------------------------------------------
  218:             'match': match})
  219:     
  220:     
  221:     
- 222:     overall_data = (line2[0:10] + line2[13:20]) + line2[21:43]
+ 222:     overall_data = (line2[0:10] + line2[13:20]) + line2[22:43]
  223:     overall_expected = str(calculate_check_digit(overall_data))
  224:     overall_stored = line2[43]
  225:     overall_match = overall_expected == overall_stored
  226:     if not overall_match:
--------------------------------------------------------------------------------
[0.01248 s] killed by test_validate_all_correct_usa (tests.test_validate_mrz.TestValidateMRZ)

   - [# 280] CRP MRTD: 
--------------------------------------------------------------------------------
  218:             'match': match})
  219:     
  220:     
  221:     
- 222:     overall_data = (line2[0:10] + line2[13:20]) + line2[21:43]
+ 222:     overall_data = (line2[0:10] + line2[13:20]) + line2[21:44]
  223:     overall_expected = str(calculate_check_digit(overall_data))
  224:     overall_stored = line2[43]
  225:     overall_match = overall_expected == overall_stored
  226:     if not overall_match:
--------------------------------------------------------------------------------
[0.01196 s] killed by test_validate_all_correct_usa (tests.test_validate_mrz.TestValidateMRZ)

   - [# 281] CRP MRTD: 
--------------------------------------------------------------------------------
  220:     
  221:     
  222:     overall_data = (line2[0:10] + line2[13:20]) + line2[21:43]
  223:     overall_expected = str(calculate_check_digit(overall_data))
- 224:     overall_stored = line2[43]
+ 224:     overall_stored = line2[44]
  225:     overall_match = overall_expected == overall_stored
  226:     if not overall_match:
  227:         all_match = False
  228:     fields.append({\
--------------------------------------------------------------------------------
[0.01290 s] killed by test_validate_all_correct_usa (tests.test_validate_mrz.TestValidateMRZ)

   - [# 282] CRP MRTD: 
--------------------------------------------------------------------------------
  225:     overall_match = overall_expected == overall_stored
  226:     if not overall_match:
  227:         all_match = False
  228:     fields.append({\
- 229:         'field_name': 'overall', \
+ 229:         'mutpy': 'overall', \
  230:         'expected': overall_expected, \
  231:         'actual': overall_stored, \
  232:         'match': overall_match})
  233:     
--------------------------------------------------------------------------------
[0.01237 s] killed by test_validate_all_correct_usa (tests.test_validate_mrz.TestValidateMRZ)

   - [# 283] CRP MRTD: 
--------------------------------------------------------------------------------
  225:     overall_match = overall_expected == overall_stored
  226:     if not overall_match:
  227:         all_match = False
  228:     fields.append({\
- 229:         'field_name': 'overall', \
+ 229:         '': 'overall', \
  230:         'expected': overall_expected, \
  231:         'actual': overall_stored, \
  232:         'match': overall_match})
  233:     
--------------------------------------------------------------------------------
[0.01347 s] killed by test_validate_all_correct_usa (tests.test_validate_mrz.TestValidateMRZ)

   - [# 284] CRP MRTD: 
--------------------------------------------------------------------------------
  226:     if not overall_match:
  227:         all_match = False
  228:     fields.append({\
  229:         'field_name': 'overall', \
- 230:         'expected': overall_expected, \
+ 230:         'mutpy': overall_expected, \
  231:         'actual': overall_stored, \
  232:         'match': overall_match})
  233:     
  234:     
--------------------------------------------------------------------------------
[0.01328 s] killed by test_validate_returns_all_fields (tests.test_validate_mrz.TestValidateMRZ)

   - [# 285] CRP MRTD: 
--------------------------------------------------------------------------------
  226:     if not overall_match:
  227:         all_match = False
  228:     fields.append({\
  229:         'field_name': 'overall', \
- 230:         'expected': overall_expected, \
+ 230:         '': overall_expected, \
  231:         'actual': overall_stored, \
  232:         'match': overall_match})
  233:     
  234:     
--------------------------------------------------------------------------------
[0.01154 s] killed by test_validate_returns_all_fields (tests.test_validate_mrz.TestValidateMRZ)

   - [# 286] CRP MRTD: 
--------------------------------------------------------------------------------
  227:         all_match = False
  228:     fields.append({\
  229:         'field_name': 'overall', \
  230:         'expected': overall_expected, \
- 231:         'actual': overall_stored, \
+ 231:         'mutpy': overall_stored, \
  232:         'match': overall_match})
  233:     
  234:     
  235:     return {\
--------------------------------------------------------------------------------
[0.01280 s] killed by test_validate_returns_all_fields (tests.test_validate_mrz.TestValidateMRZ)

   - [# 287] CRP MRTD: 
--------------------------------------------------------------------------------
  227:         all_match = False
  228:     fields.append({\
  229:         'field_name': 'overall', \
  230:         'expected': overall_expected, \
- 231:         'actual': overall_stored, \
+ 231:         '': overall_stored, \
  232:         'match': overall_match})
  233:     
  234:     
  235:     return {\
--------------------------------------------------------------------------------
[0.01307 s] killed by test_validate_returns_all_fields (tests.test_validate_mrz.TestValidateMRZ)

   - [# 288] CRP MRTD: 
--------------------------------------------------------------------------------
  228:     fields.append({\
  229:         'field_name': 'overall', \
  230:         'expected': overall_expected, \
  231:         'actual': overall_stored, \
- 232:         'match': overall_match})
+ 232:         'mutpy': overall_match})
  233:     
  234:     
  235:     return {\
  236:         'overall_result': all_match, \
--------------------------------------------------------------------------------
[0.01353 s] killed by test_validate_all_correct_usa (tests.test_validate_mrz.TestValidateMRZ)

   - [# 289] CRP MRTD: 
--------------------------------------------------------------------------------
  228:     fields.append({\
  229:         'field_name': 'overall', \
  230:         'expected': overall_expected, \
  231:         'actual': overall_stored, \
- 232:         'match': overall_match})
+ 232:         '': overall_match})
  233:     
  234:     
  235:     return {\
  236:         'overall_result': all_match, \
--------------------------------------------------------------------------------
[0.01310 s] killed by test_validate_all_correct_usa (tests.test_validate_mrz.TestValidateMRZ)

   - [# 290] CRP MRTD: 
--------------------------------------------------------------------------------
  225:     overall_match = overall_expected == overall_stored
  226:     if not overall_match:
  227:         all_match = False
  228:     fields.append({\
- 229:         'field_name': 'overall', \
+ 229:         'field_name': 'mutpy', \
  230:         'expected': overall_expected, \
  231:         'actual': overall_stored, \
  232:         'match': overall_match})
  233:     
--------------------------------------------------------------------------------
[0.01238 s] killed by test_validate_returns_all_fields (tests.test_validate_mrz.TestValidateMRZ)

   - [# 291] CRP MRTD: 
--------------------------------------------------------------------------------
  225:     overall_match = overall_expected == overall_stored
  226:     if not overall_match:
  227:         all_match = False
  228:     fields.append({\
- 229:         'field_name': 'overall', \
+ 229:         'field_name': '', \
  230:         'expected': overall_expected, \
  231:         'actual': overall_stored, \
  232:         'match': overall_match})
  233:     
--------------------------------------------------------------------------------
[0.01173 s] killed by test_validate_returns_all_fields (tests.test_validate_mrz.TestValidateMRZ)

   - [# 292] CRP MRTD: 
--------------------------------------------------------------------------------
  232:         'match': overall_match})
  233:     
  234:     
  235:     return {\
- 236:         'overall_result': all_match, \
+ 236:         'mutpy': all_match, \
  237:         'fields': fields}
--------------------------------------------------------------------------------
[0.01169 s] killed by test_validate_all_correct_usa (tests.test_validate_mrz.TestValidateMRZ)

   - [# 293] CRP MRTD: 
--------------------------------------------------------------------------------
  232:         'match': overall_match})
  233:     
  234:     
  235:     return {\
- 236:         'overall_result': all_match, \
+ 236:         '': all_match, \
  237:         'fields': fields}
--------------------------------------------------------------------------------
[0.01198 s] killed by test_validate_all_correct_usa (tests.test_validate_mrz.TestValidateMRZ)

   - [# 294] CRP MRTD: 
--------------------------------------------------------------------------------
  233:     
  234:     
  235:     return {\
  236:         'overall_result': all_match, \
- 237:         'fields': fields}
+ 237:         'mutpy': fields}
--------------------------------------------------------------------------------
[0.01303 s] killed by test_validate_all_correct_usa (tests.test_validate_mrz.TestValidateMRZ)

   - [# 295] CRP MRTD: 
--------------------------------------------------------------------------------
  233:     
  234:     
  235:     return {\
  236:         'overall_result': all_match, \
- 237:         'fields': fields}
+ 237:         '': fields}
--------------------------------------------------------------------------------
[0.01463 s] killed by test_validate_all_correct_usa (tests.test_validate_mrz.TestValidateMRZ)

   - [# 296] LCR MRTD: 
--------------------------------------------------------------------------------
   11:     Digits 0-9 -> 0-9, letters A-Z -> 10-35, '<' -> 0.
   12:     """
   13:     if c.isdigit():
   14:         return int(c)
-  15:     elif (c.isalpha() and c.isupper()):
+  15:     elif (c.isalpha() or c.isupper()):
   16:         return (ord(c) - ord('A')) + 10
   17:     elif c == '<':
   18:         return 0
   19:     else:
--------------------------------------------------------------------------------
[0.01285 s] survived

   - [# 297] LCR MRTD: 
--------------------------------------------------------------------------------
  124:     Raises ValueError if required fields are missing or fixed-length fields are wrong.
  125:     """
  126:     
  127:     for field in _REQUIRED_ENCODE_FIELDS:
- 128:         if (field not in fields or not (fields[field])):
+ 128:         if (field not in fields and not (fields[field])):
  129:             raise ValueError(f'Required field {field} is missing or empty')
  130:     
  131:     
  132:     document_type = fields['document_type'].upper()
--------------------------------------------------------------------------------
[0.01223 s] killed by test_encode_missing_birth_date (tests.test_encode_mrz.TestEncodeMRZ)

   - [# 298] LCR MRTD: 
--------------------------------------------------------------------------------
  140:     expiration_date = fields['expiration_date']
  141:     personal_number = fields.get('personal_number', '').upper().replace(' ', '<')
  142:     
  143:     
- 144:     if (len(document_type) < 1 or len(document_type) > 2):
+ 144:     if (len(document_type) < 1 and len(document_type) > 2):
  145:         raise ValueError('document_type must be 1-2 characters')
  146:     if len(issuing_country) != 3:
  147:         raise ValueError('issuing_country must be exactly 3 characters')
  148:     if len(passport_number) != 9:
--------------------------------------------------------------------------------
[0.01164 s] survived

   - [# 299] LOR MRTD: 
--------------------------------------------------------------------------------
   33:     for c in data:
   34:         value = _char_to_value(c)
   35:         sum1 = (sum1 + value) % 255
   36:         sum2 = (sum2 + sum1) % 255
-  37:     checksum = (sum2 << 8) | sum1
+  37:     checksum = (sum2 >> 8) | sum1
   38:     return checksum % 10
   39: 
   40: 
   41: def scan_mrz():
--------------------------------------------------------------------------------
[0.01009 s] killed by test_mixed_alphanumeric (tests.test_calculate_check_digit.TestCalculateCheckDigit)

   - [# 300] LOR MRTD: 
--------------------------------------------------------------------------------
   33:     for c in data:
   34:         value = _char_to_value(c)
   35:         sum1 = (sum1 + value) % 255
   36:         sum2 = (sum2 + sum1) % 255
-  37:     checksum = (sum2 << 8) | sum1
+  37:     checksum = (sum2 << 8) & sum1
   38:     return checksum % 10
   39: 
   40: 
   41: def scan_mrz():
--------------------------------------------------------------------------------
[0.01128 s] killed by test_birth_date_reference (tests.test_calculate_check_digit.TestCalculateCheckDigit)

   - [# 301] ROR MRTD: 
--------------------------------------------------------------------------------
   13:     if c.isdigit():
   14:         return int(c)
   15:     elif (c.isalpha() and c.isupper()):
   16:         return (ord(c) - ord('A')) + 10
-  17:     elif c == '<':
+  17:     elif c != '<':
   18:         return 0
   19:     else:
   20:         raise ValueError(f'Invalid MRZ character: {c}')
   21: 
--------------------------------------------------------------------------------
[0.01062 s] killed by test_all_fillers (tests.test_calculate_check_digit.TestCalculateCheckDigit)

   - [# 302] ROR MRTD: 
--------------------------------------------------------------------------------
   57:     Validates input length and character set. Raises ValueError on invalid input.
   58:     '''
   59:     
   60:     for (name, line) in [('line1', line1), ('line2', line2)]:
-  61:         if len(line) != 44:
+  61:         if len(line) == 44:
   62:             raise ValueError(
   63:                 f'{name} must be exactly 44 characters, got {len(line)}')
   64:         
   65:         if not (_MRZ_PATTERN.match(line)):
--------------------------------------------------------------------------------
[0.01127 s] killed by test_decode_deu_passport (tests.test_decode_mrz.TestDecodeMRZ)

   - [# 303] ROR MRTD: 
--------------------------------------------------------------------------------
   74:     
   75:     names_raw = line1[5:44]
   76:     parts = names_raw.split('<<')
   77:     surname = parts[0].replace('<', ' ').strip()
-  78:     given_names = parts[1].replace('<', ' ').strip() if len(parts) > 1 else ''
+  78:     given_names = parts[1].replace('<', ' ').strip() if len(parts) < 1 else ''
   79:     
   80:     
   81:     passport_number = line2[0:9].rstrip('<')
   82:     check_digit_passport = line2[9]
--------------------------------------------------------------------------------
[0.01133 s] killed by test_decode_deu_passport (tests.test_decode_mrz.TestDecodeMRZ)

   - [# 304] ROR MRTD: 
--------------------------------------------------------------------------------
   74:     
   75:     names_raw = line1[5:44]
   76:     parts = names_raw.split('<<')
   77:     surname = parts[0].replace('<', ' ').strip()
-  78:     given_names = parts[1].replace('<', ' ').strip() if len(parts) > 1 else ''
+  78:     given_names = parts[1].replace('<', ' ').strip() if len(parts) >= 1 else ''
   79:     
   80:     
   81:     passport_number = line2[0:9].rstrip('<')
   82:     check_digit_passport = line2[9]
--------------------------------------------------------------------------------
[0.01249 s] survived

   - [# 305] ROR MRTD: 
--------------------------------------------------------------------------------
  140:     expiration_date = fields['expiration_date']
  141:     personal_number = fields.get('personal_number', '').upper().replace(' ', '<')
  142:     
  143:     
- 144:     if (len(document_type) < 1 or len(document_type) > 2):
+ 144:     if (len(document_type) > 1 or len(document_type) > 2):
  145:         raise ValueError('document_type must be 1-2 characters')
  146:     if len(issuing_country) != 3:
  147:         raise ValueError('issuing_country must be exactly 3 characters')
  148:     if len(passport_number) != 9:
--------------------------------------------------------------------------------
[0.01312 s] survived

   - [# 306] ROR MRTD: 
--------------------------------------------------------------------------------
  140:     expiration_date = fields['expiration_date']
  141:     personal_number = fields.get('personal_number', '').upper().replace(' ', '<')
  142:     
  143:     
- 144:     if (len(document_type) < 1 or len(document_type) > 2):
+ 144:     if (len(document_type) <= 1 or len(document_type) > 2):
  145:         raise ValueError('document_type must be 1-2 characters')
  146:     if len(issuing_country) != 3:
  147:         raise ValueError('issuing_country must be exactly 3 characters')
  148:     if len(passport_number) != 9:
--------------------------------------------------------------------------------
[0.01366 s] killed by test_encode_fra_passport (tests.test_encode_mrz.TestEncodeMRZ)
