   - [# 307] ROR MRTD: 
--------------------------------------------------------------------------------
  140:     expiration_date = fields['expiration_date']
  141:     personal_number = fields.get('personal_number', '').upper().replace(' ', '<')
  142:     
  143:     
- 144:     if (len(document_type) < 1 or len(document_type) > 2):
+ 144:     if (len(document_type) < 1 or len(document_type) < 2):
  145:         raise ValueError('document_type must be 1-2 characters')
  146:     if len(issuing_country) != 3:
  147:         raise ValueError('issuing_country must be exactly 3 characters')
  148:     if len(passport_number) != 9:
--------------------------------------------------------------------------------
[0.01252 s] killed by test_encode_fra_passport (tests.test_encode_mrz.TestEncodeMRZ)

   - [# 308] ROR MRTD: 
--------------------------------------------------------------------------------
  140:     expiration_date = fields['expiration_date']
  141:     personal_number = fields.get('personal_number', '').upper().replace(' ', '<')
  142:     
  143:     
- 144:     if (len(document_type) < 1 or len(document_type) > 2):
+ 144:     if (len(document_type) < 1 or len(document_type) >= 2):
  145:         raise ValueError('document_type must be 1-2 characters')
  146:     if len(issuing_country) != 3:
  147:         raise ValueError('issuing_country must be exactly 3 characters')
  148:     if len(passport_number) != 9:
--------------------------------------------------------------------------------
[0.01265 s] survived

   - [# 309] ROR MRTD: 
--------------------------------------------------------------------------------
  142:     
  143:     
  144:     if (len(document_type) < 1 or len(document_type) > 2):
  145:         raise ValueError('document_type must be 1-2 characters')
- 146:     if len(issuing_country) != 3:
+ 146:     if len(issuing_country) == 3:
  147:         raise ValueError('issuing_country must be exactly 3 characters')
  148:     if len(passport_number) != 9:
  149:         raise ValueError('passport_number must be exactly 9 characters')
  150:     if len(country_code) != 3:
--------------------------------------------------------------------------------
[0.01286 s] killed by test_encode_fra_passport (tests.test_encode_mrz.TestEncodeMRZ)

   - [# 310] ROR MRTD: 
--------------------------------------------------------------------------------
  144:     if (len(document_type) < 1 or len(document_type) > 2):
  145:         raise ValueError('document_type must be 1-2 characters')
  146:     if len(issuing_country) != 3:
  147:         raise ValueError('issuing_country must be exactly 3 characters')
- 148:     if len(passport_number) != 9:
+ 148:     if len(passport_number) == 9:
  149:         raise ValueError('passport_number must be exactly 9 characters')
  150:     if len(country_code) != 3:
  151:         raise ValueError('country_code must be exactly 3 characters')
  152:     if len(birth_date) != 6:
--------------------------------------------------------------------------------
[0.01220 s] killed by test_encode_fra_passport (tests.test_encode_mrz.TestEncodeMRZ)

   - [# 311] ROR MRTD: 
--------------------------------------------------------------------------------
  146:     if len(issuing_country) != 3:
  147:         raise ValueError('issuing_country must be exactly 3 characters')
  148:     if len(passport_number) != 9:
  149:         raise ValueError('passport_number must be exactly 9 characters')
- 150:     if len(country_code) != 3:
+ 150:     if len(country_code) == 3:
  151:         raise ValueError('country_code must be exactly 3 characters')
  152:     if len(birth_date) != 6:
  153:         raise ValueError('birth_date must be exactly 6 characters')
  154:     if len(sex) != 1:
--------------------------------------------------------------------------------
[0.01271 s] killed by test_encode_fra_passport (tests.test_encode_mrz.TestEncodeMRZ)

   - [# 312] ROR MRTD: 
--------------------------------------------------------------------------------
  148:     if len(passport_number) != 9:
  149:         raise ValueError('passport_number must be exactly 9 characters')
  150:     if len(country_code) != 3:
  151:         raise ValueError('country_code must be exactly 3 characters')
- 152:     if len(birth_date) != 6:
+ 152:     if len(birth_date) == 6:
  153:         raise ValueError('birth_date must be exactly 6 characters')
  154:     if len(sex) != 1:
  155:         raise ValueError('sex must be exactly 1 character')
  156:     if len(expiration_date) != 6:
--------------------------------------------------------------------------------
[0.01380 s] killed by test_encode_fra_passport (tests.test_encode_mrz.TestEncodeMRZ)

   - [# 313] ROR MRTD: 
--------------------------------------------------------------------------------
  150:     if len(country_code) != 3:
  151:         raise ValueError('country_code must be exactly 3 characters')
  152:     if len(birth_date) != 6:
  153:         raise ValueError('birth_date must be exactly 6 characters')
- 154:     if len(sex) != 1:
+ 154:     if len(sex) == 1:
  155:         raise ValueError('sex must be exactly 1 character')
  156:     if len(expiration_date) != 6:
  157:         raise ValueError('expiration_date must be exactly 6 characters')
  158:     
--------------------------------------------------------------------------------
[0.01517 s] killed by test_encode_fra_passport (tests.test_encode_mrz.TestEncodeMRZ)

   - [# 314] ROR MRTD: 
--------------------------------------------------------------------------------
  152:     if len(birth_date) != 6:
  153:         raise ValueError('birth_date must be exactly 6 characters')
  154:     if len(sex) != 1:
  155:         raise ValueError('sex must be exactly 1 character')
- 156:     if len(expiration_date) != 6:
+ 156:     if len(expiration_date) == 6:
  157:         raise ValueError('expiration_date must be exactly 6 characters')
  158:     
  159:     
  160:     doc_type_padded = document_type.ljust(2, '<')
--------------------------------------------------------------------------------
[0.01444 s] killed by test_encode_fra_passport (tests.test_encode_mrz.TestEncodeMRZ)

   - [# 315] ROR MRTD: 
--------------------------------------------------------------------------------
  207:     all_match = True
  208:     
  209:     for (field_name, data, stored_digit) in checks:
  210:         expected = str(calculate_check_digit(data))
- 211:         match = expected == stored_digit
+ 211:         match = expected != stored_digit
  212:         if not match:
  213:             all_match = False
  214:         fields.append({\
  215:             'field_name': field_name, \
--------------------------------------------------------------------------------
[0.01595 s] killed by test_validate_all_correct_usa (tests.test_validate_mrz.TestValidateMRZ)

   - [# 316] ROR MRTD: 
--------------------------------------------------------------------------------
  221:     
  222:     overall_data = (line2[0:10] + line2[13:20]) + line2[21:43]
  223:     overall_expected = str(calculate_check_digit(overall_data))
  224:     overall_stored = line2[43]
- 225:     overall_match = overall_expected == overall_stored
+ 225:     overall_match = overall_expected != overall_stored
  226:     if not overall_match:
  227:         all_match = False
  228:     fields.append({\
  229:         'field_name': 'overall', \
--------------------------------------------------------------------------------
[0.01307 s] killed by test_validate_all_correct_usa (tests.test_validate_mrz.TestValidateMRZ)

   - [# 317] SIR MRTD: 
--------------------------------------------------------------------------------
   67:                 f'{name} contains invalid characters (only A-Z, 0-9, \'<\' allowed)')
   68:     
   69:     
   70:     
-  71:     document_type = line1[0:2].rstrip('<')
+  71:     document_type = line1[:2].rstrip('<')
   72:     issuing_country = line1[2:5].rstrip('<')
   73:     
   74:     
   75:     names_raw = line1[5:44]
--------------------------------------------------------------------------------
[0.01411 s] survived

   - [# 318] SIR MRTD: 
--------------------------------------------------------------------------------
   67:                 f'{name} contains invalid characters (only A-Z, 0-9, \'<\' allowed)')
   68:     
   69:     
   70:     
-  71:     document_type = line1[0:2].rstrip('<')
+  71:     document_type = line1[0:].rstrip('<')
   72:     issuing_country = line1[2:5].rstrip('<')
   73:     
   74:     
   75:     names_raw = line1[5:44]
--------------------------------------------------------------------------------
[0.01328 s] killed by test_decode_reference_uto (tests.test_decode_mrz.TestDecodeMRZ)

   - [# 319] SIR MRTD: 
--------------------------------------------------------------------------------
   68:     
   69:     
   70:     
   71:     document_type = line1[0:2].rstrip('<')
-  72:     issuing_country = line1[2:5].rstrip('<')
+  72:     issuing_country = line1[:5].rstrip('<')
   73:     
   74:     
   75:     names_raw = line1[5:44]
   76:     parts = names_raw.split('<<')
--------------------------------------------------------------------------------
[0.01575 s] killed by test_decode_deu_passport (tests.test_decode_mrz.TestDecodeMRZ)

   - [# 320] SIR MRTD: 
--------------------------------------------------------------------------------
   68:     
   69:     
   70:     
   71:     document_type = line1[0:2].rstrip('<')
-  72:     issuing_country = line1[2:5].rstrip('<')
+  72:     issuing_country = line1[2:].rstrip('<')
   73:     
   74:     
   75:     names_raw = line1[5:44]
   76:     parts = names_raw.split('<<')
--------------------------------------------------------------------------------
[0.01090 s] killed by test_decode_deu_passport (tests.test_decode_mrz.TestDecodeMRZ)

   - [# 321] SIR MRTD: 
--------------------------------------------------------------------------------
   71:     document_type = line1[0:2].rstrip('<')
   72:     issuing_country = line1[2:5].rstrip('<')
   73:     
   74:     
-  75:     names_raw = line1[5:44]
+  75:     names_raw = line1[:44]
   76:     parts = names_raw.split('<<')
   77:     surname = parts[0].replace('<', ' ').strip()
   78:     given_names = parts[1].replace('<', ' ').strip() if len(parts) > 1 else ''
   79:     
--------------------------------------------------------------------------------
[0.01145 s] killed by test_decode_deu_passport (tests.test_decode_mrz.TestDecodeMRZ)

   - [# 322] SIR MRTD: 
--------------------------------------------------------------------------------
   71:     document_type = line1[0:2].rstrip('<')
   72:     issuing_country = line1[2:5].rstrip('<')
   73:     
   74:     
-  75:     names_raw = line1[5:44]
+  75:     names_raw = line1[5:]
   76:     parts = names_raw.split('<<')
   77:     surname = parts[0].replace('<', ' ').strip()
   78:     given_names = parts[1].replace('<', ' ').strip() if len(parts) > 1 else ''
   79:     
--------------------------------------------------------------------------------
[0.01176 s] survived

   - [# 323] SIR MRTD: 
--------------------------------------------------------------------------------
   77:     surname = parts[0].replace('<', ' ').strip()
   78:     given_names = parts[1].replace('<', ' ').strip() if len(parts) > 1 else ''
   79:     
   80:     
-  81:     passport_number = line2[0:9].rstrip('<')
+  81:     passport_number = line2[:9].rstrip('<')
   82:     check_digit_passport = line2[9]
   83:     country_code = line2[10:13].rstrip('<')
   84:     birth_date = line2[13:19]
   85:     check_digit_birth = line2[19]
--------------------------------------------------------------------------------
[0.01001 s] survived

   - [# 324] SIR MRTD: 
--------------------------------------------------------------------------------
   77:     surname = parts[0].replace('<', ' ').strip()
   78:     given_names = parts[1].replace('<', ' ').strip() if len(parts) > 1 else ''
   79:     
   80:     
-  81:     passport_number = line2[0:9].rstrip('<')
+  81:     passport_number = line2[0:].rstrip('<')
   82:     check_digit_passport = line2[9]
   83:     country_code = line2[10:13].rstrip('<')
   84:     birth_date = line2[13:19]
   85:     check_digit_birth = line2[19]
--------------------------------------------------------------------------------
[0.01001 s] killed by test_decode_reference_uto (tests.test_decode_mrz.TestDecodeMRZ)

   - [# 325] SIR MRTD: 
--------------------------------------------------------------------------------
   79:     
   80:     
   81:     passport_number = line2[0:9].rstrip('<')
   82:     check_digit_passport = line2[9]
-  83:     country_code = line2[10:13].rstrip('<')
+  83:     country_code = line2[:13].rstrip('<')
   84:     birth_date = line2[13:19]
   85:     check_digit_birth = line2[19]
   86:     sex = line2[20]
   87:     expiration_date = line2[21:27]
--------------------------------------------------------------------------------
[0.01049 s] killed by test_decode_gbr_passport (tests.test_decode_mrz.TestDecodeMRZ)

   - [# 326] SIR MRTD: 
--------------------------------------------------------------------------------
   79:     
   80:     
   81:     passport_number = line2[0:9].rstrip('<')
   82:     check_digit_passport = line2[9]
-  83:     country_code = line2[10:13].rstrip('<')
+  83:     country_code = line2[10:].rstrip('<')
   84:     birth_date = line2[13:19]
   85:     check_digit_birth = line2[19]
   86:     sex = line2[20]
   87:     expiration_date = line2[21:27]
--------------------------------------------------------------------------------
[0.01092 s] killed by test_decode_gbr_passport (tests.test_decode_mrz.TestDecodeMRZ)

   - [# 327] SIR MRTD: 
--------------------------------------------------------------------------------
   80:     
   81:     passport_number = line2[0:9].rstrip('<')
   82:     check_digit_passport = line2[9]
   83:     country_code = line2[10:13].rstrip('<')
-  84:     birth_date = line2[13:19]
+  84:     birth_date = line2[:19]
   85:     check_digit_birth = line2[19]
   86:     sex = line2[20]
   87:     expiration_date = line2[21:27]
   88:     check_digit_expiration = line2[27]
--------------------------------------------------------------------------------
[0.01126 s] killed by test_decode_reference_uto (tests.test_decode_mrz.TestDecodeMRZ)

   - [# 328] SIR MRTD: 
--------------------------------------------------------------------------------
   80:     
   81:     passport_number = line2[0:9].rstrip('<')
   82:     check_digit_passport = line2[9]
   83:     country_code = line2[10:13].rstrip('<')
-  84:     birth_date = line2[13:19]
+  84:     birth_date = line2[13:]
   85:     check_digit_birth = line2[19]
   86:     sex = line2[20]
   87:     expiration_date = line2[21:27]
   88:     check_digit_expiration = line2[27]
--------------------------------------------------------------------------------
[0.01105 s] killed by test_decode_reference_uto (tests.test_decode_mrz.TestDecodeMRZ)

   - [# 329] SIR MRTD: 
--------------------------------------------------------------------------------
   83:     country_code = line2[10:13].rstrip('<')
   84:     birth_date = line2[13:19]
   85:     check_digit_birth = line2[19]
   86:     sex = line2[20]
-  87:     expiration_date = line2[21:27]
+  87:     expiration_date = line2[:27]
   88:     check_digit_expiration = line2[27]
   89:     personal_number = line2[28:42].rstrip('<')
   90:     check_digit_personal = line2[42]
   91:     overall_check_digit = line2[43]
--------------------------------------------------------------------------------
[0.01393 s] killed by test_decode_reference_uto (tests.test_decode_mrz.TestDecodeMRZ)

   - [# 330] SIR MRTD: 
--------------------------------------------------------------------------------
   83:     country_code = line2[10:13].rstrip('<')
   84:     birth_date = line2[13:19]
   85:     check_digit_birth = line2[19]
   86:     sex = line2[20]
-  87:     expiration_date = line2[21:27]
+  87:     expiration_date = line2[21:]
   88:     check_digit_expiration = line2[27]
   89:     personal_number = line2[28:42].rstrip('<')
   90:     check_digit_personal = line2[42]
   91:     overall_check_digit = line2[43]
--------------------------------------------------------------------------------
[0.01116 s] killed by test_decode_reference_uto (tests.test_decode_mrz.TestDecodeMRZ)

   - [# 331] SIR MRTD: 
--------------------------------------------------------------------------------
   85:     check_digit_birth = line2[19]
   86:     sex = line2[20]
   87:     expiration_date = line2[21:27]
   88:     check_digit_expiration = line2[27]
-  89:     personal_number = line2[28:42].rstrip('<')
+  89:     personal_number = line2[:42].rstrip('<')
   90:     check_digit_personal = line2[42]
   91:     overall_check_digit = line2[43]
   92:     
   93:     return {\
--------------------------------------------------------------------------------
[0.01042 s] killed by test_decode_empty_personal_number (tests.test_decode_mrz.TestDecodeMRZ)

   - [# 332] SIR MRTD: 
--------------------------------------------------------------------------------
   85:     check_digit_birth = line2[19]
   86:     sex = line2[20]
   87:     expiration_date = line2[21:27]
   88:     check_digit_expiration = line2[27]
-  89:     personal_number = line2[28:42].rstrip('<')
+  89:     personal_number = line2[28:].rstrip('<')
   90:     check_digit_personal = line2[42]
   91:     overall_check_digit = line2[43]
   92:     
   93:     return {\
--------------------------------------------------------------------------------
[0.00969 s] killed by test_decode_empty_personal_number (tests.test_decode_mrz.TestDecodeMRZ)

   - [# 333] SIR MRTD: 
--------------------------------------------------------------------------------
  158:     
  159:     
  160:     doc_type_padded = document_type.ljust(2, '<')
  161:     names_field = (surname + '<<') + given_names
- 162:     names_field = names_field[:39].ljust(39, '<')
+ 162:     names_field = names_field[:].ljust(39, '<')
  163:     line1 = (doc_type_padded + issuing_country) + names_field
  164:     
  165:     
  166:     personal_number_padded = personal_number[:14].ljust(14, '<')
--------------------------------------------------------------------------------
[0.00995 s] survived

   - [# 334] SIR MRTD: 
--------------------------------------------------------------------------------
  162:     names_field = names_field[:39].ljust(39, '<')
  163:     line1 = (doc_type_padded + issuing_country) + names_field
  164:     
  165:     
- 166:     personal_number_padded = personal_number[:14].ljust(14, '<')
+ 166:     personal_number_padded = personal_number[:].ljust(14, '<')
  167:     
  168:     cd_passport = calculate_check_digit(passport_number)
  169:     cd_birth = calculate_check_digit(birth_date)
  170:     cd_expiration = calculate_check_digit(expiration_date)
--------------------------------------------------------------------------------
[0.01085 s] survived

   - [# 335] SIR MRTD: 
--------------------------------------------------------------------------------
  179:     
  180:     
  181:     
  182:     
- 183:     overall_data = (line2_partial[0:10] + line2_partial[13:20]) + line2_partial[21:43]
+ 183:     overall_data = (line2_partial[:10] + line2_partial[13:20]) + line2_partial[21:43]
  184:     cd_overall = calculate_check_digit(overall_data)
  185:     
  186:     line2 = line2_partial + str(cd_overall)
  187:     
--------------------------------------------------------------------------------
[0.01075 s] survived

   - [# 336] SIR MRTD: 
--------------------------------------------------------------------------------
  179:     
  180:     
  181:     
  182:     
- 183:     overall_data = (line2_partial[0:10] + line2_partial[13:20]) + line2_partial[21:43]
+ 183:     overall_data = (line2_partial[0:] + line2_partial[13:20]) + line2_partial[21:43]
  184:     cd_overall = calculate_check_digit(overall_data)
  185:     
  186:     line2 = line2_partial + str(cd_overall)
  187:     
--------------------------------------------------------------------------------
[0.01133 s] killed by test_encode_reference_uto (tests.test_encode_mrz.TestEncodeMRZ)

   - [# 337] SIR MRTD: 
--------------------------------------------------------------------------------
  179:     
  180:     
  181:     
  182:     
- 183:     overall_data = (line2_partial[0:10] + line2_partial[13:20]) + line2_partial[21:43]
+ 183:     overall_data = (line2_partial[0:10] + line2_partial[:20]) + line2_partial[21:43]
  184:     cd_overall = calculate_check_digit(overall_data)
  185:     
  186:     line2 = line2_partial + str(cd_overall)
  187:     
--------------------------------------------------------------------------------
[0.01156 s] killed by test_encode_reference_uto (tests.test_encode_mrz.TestEncodeMRZ)

   - [# 338] SIR MRTD: 
--------------------------------------------------------------------------------
  179:     
  180:     
  181:     
  182:     
- 183:     overall_data = (line2_partial[0:10] + line2_partial[13:20]) + line2_partial[21:43]
+ 183:     overall_data = (line2_partial[0:10] + line2_partial[13:]) + line2_partial[21:43]
  184:     cd_overall = calculate_check_digit(overall_data)
  185:     
  186:     line2 = line2_partial + str(cd_overall)
  187:     
--------------------------------------------------------------------------------
[0.00990 s] killed by test_encode_reference_uto (tests.test_encode_mrz.TestEncodeMRZ)

   - [# 339] SIR MRTD: 
--------------------------------------------------------------------------------
  179:     
  180:     
  181:     
  182:     
- 183:     overall_data = (line2_partial[0:10] + line2_partial[13:20]) + line2_partial[21:43]
+ 183:     overall_data = (line2_partial[0:10] + line2_partial[13:20]) + line2_partial[:43]
  184:     cd_overall = calculate_check_digit(overall_data)
  185:     
  186:     line2 = line2_partial + str(cd_overall)
  187:     
--------------------------------------------------------------------------------
[0.00928 s] killed by test_encode_reference_uto (tests.test_encode_mrz.TestEncodeMRZ)

   - [# 340] SIR MRTD: 
--------------------------------------------------------------------------------
  179:     
  180:     
  181:     
  182:     
- 183:     overall_data = (line2_partial[0:10] + line2_partial[13:20]) + line2_partial[21:43]
+ 183:     overall_data = (line2_partial[0:10] + line2_partial[13:20]) + line2_partial[21:]
  184:     cd_overall = calculate_check_digit(overall_data)
  185:     
  186:     line2 = line2_partial + str(cd_overall)
  187:     
--------------------------------------------------------------------------------
[0.00923 s] survived

   - [# 341] SIR MRTD: 
--------------------------------------------------------------------------------
  196:     per-field results. Validates ALL fields (does not stop at first mismatch).
  197:     '''
  198:     
  199:     checks = [\
- 200:         ('passport_number', line2[0:9], line2[9]), \
+ 200:         ('passport_number', line2[:9], line2[9]), \
  201:         ('birth_date', line2[13:19], line2[19]), \
  202:         ('expiration_date', line2[21:27], line2[27]), \
  203:         ('personal_number', line2[28:42], line2[42])]
  204:     
--------------------------------------------------------------------------------
[0.00936 s] survived

   - [# 342] SIR MRTD: 
--------------------------------------------------------------------------------
  196:     per-field results. Validates ALL fields (does not stop at first mismatch).
  197:     '''
  198:     
  199:     checks = [\
- 200:         ('passport_number', line2[0:9], line2[9]), \
+ 200:         ('passport_number', line2[0:], line2[9]), \
  201:         ('birth_date', line2[13:19], line2[19]), \
  202:         ('expiration_date', line2[21:27], line2[27]), \
  203:         ('personal_number', line2[28:42], line2[42])]
  204:     
--------------------------------------------------------------------------------
[0.01096 s] killed by test_validate_all_correct_usa (tests.test_validate_mrz.TestValidateMRZ)

   - [# 343] SIR MRTD: 
--------------------------------------------------------------------------------
  197:     '''
  198:     
  199:     checks = [\
  200:         ('passport_number', line2[0:9], line2[9]), \
- 201:         ('birth_date', line2[13:19], line2[19]), \
+ 201:         ('birth_date', line2[:19], line2[19]), \
  202:         ('expiration_date', line2[21:27], line2[27]), \
  203:         ('personal_number', line2[28:42], line2[42])]
  204:     
  205:     
--------------------------------------------------------------------------------
[0.00957 s] killed by test_validate_all_correct_usa (tests.test_validate_mrz.TestValidateMRZ)

   - [# 344] SIR MRTD: 
--------------------------------------------------------------------------------
  197:     '''
  198:     
  199:     checks = [\
  200:         ('passport_number', line2[0:9], line2[9]), \
- 201:         ('birth_date', line2[13:19], line2[19]), \
+ 201:         ('birth_date', line2[13:], line2[19]), \
  202:         ('expiration_date', line2[21:27], line2[27]), \
  203:         ('personal_number', line2[28:42], line2[42])]
  204:     
  205:     
--------------------------------------------------------------------------------
[0.00989 s] killed by test_validate_all_correct_uto (tests.test_validate_mrz.TestValidateMRZ)

   - [# 345] SIR MRTD: 
--------------------------------------------------------------------------------
  198:     
  199:     checks = [\
  200:         ('passport_number', line2[0:9], line2[9]), \
  201:         ('birth_date', line2[13:19], line2[19]), \
- 202:         ('expiration_date', line2[21:27], line2[27]), \
+ 202:         ('expiration_date', line2[:27], line2[27]), \
  203:         ('personal_number', line2[28:42], line2[42])]
  204:     
  205:     
  206:     fields = []
--------------------------------------------------------------------------------
[0.00957 s] killed by test_validate_all_correct_usa (tests.test_validate_mrz.TestValidateMRZ)

   - [# 346] SIR MRTD: 
--------------------------------------------------------------------------------
  198:     
  199:     checks = [\
  200:         ('passport_number', line2[0:9], line2[9]), \
  201:         ('birth_date', line2[13:19], line2[19]), \
- 202:         ('expiration_date', line2[21:27], line2[27]), \
+ 202:         ('expiration_date', line2[21:], line2[27]), \
  203:         ('personal_number', line2[28:42], line2[42])]
  204:     
  205:     
  206:     fields = []
--------------------------------------------------------------------------------
[0.00877 s] killed by test_validate_all_correct_usa (tests.test_validate_mrz.TestValidateMRZ)

   - [# 347] SIR MRTD: 
--------------------------------------------------------------------------------
  199:     checks = [\
  200:         ('passport_number', line2[0:9], line2[9]), \
  201:         ('birth_date', line2[13:19], line2[19]), \
  202:         ('expiration_date', line2[21:27], line2[27]), \
- 203:         ('personal_number', line2[28:42], line2[42])]
+ 203:         ('personal_number', line2[:42], line2[42])]
  204:     
  205:     
  206:     fields = []
  207:     all_match = True
--------------------------------------------------------------------------------
[0.01037 s] killed by test_validate_all_correct_usa (tests.test_validate_mrz.TestValidateMRZ)

   - [# 348] SIR MRTD: 
--------------------------------------------------------------------------------
  199:     checks = [\
  200:         ('passport_number', line2[0:9], line2[9]), \
  201:         ('birth_date', line2[13:19], line2[19]), \
  202:         ('expiration_date', line2[21:27], line2[27]), \
- 203:         ('personal_number', line2[28:42], line2[42])]
+ 203:         ('personal_number', line2[28:], line2[42])]
  204:     
  205:     
  206:     fields = []
  207:     all_match = True
--------------------------------------------------------------------------------
[0.00930 s] killed by test_validate_all_correct_usa (tests.test_validate_mrz.TestValidateMRZ)

   - [# 349] SIR MRTD: 
--------------------------------------------------------------------------------
  218:             'match': match})
  219:     
  220:     
  221:     
- 222:     overall_data = (line2[0:10] + line2[13:20]) + line2[21:43]
+ 222:     overall_data = (line2[:10] + line2[13:20]) + line2[21:43]
  223:     overall_expected = str(calculate_check_digit(overall_data))
  224:     overall_stored = line2[43]
  225:     overall_match = overall_expected == overall_stored
  226:     if not overall_match:
--------------------------------------------------------------------------------
[0.00869 s] survived

   - [# 350] SIR MRTD: 
--------------------------------------------------------------------------------
  218:             'match': match})
  219:     
  220:     
  221:     
- 222:     overall_data = (line2[0:10] + line2[13:20]) + line2[21:43]
+ 222:     overall_data = (line2[0:] + line2[13:20]) + line2[21:43]
  223:     overall_expected = str(calculate_check_digit(overall_data))
  224:     overall_stored = line2[43]
  225:     overall_match = overall_expected == overall_stored
  226:     if not overall_match:
--------------------------------------------------------------------------------
[0.00962 s] killed by test_validate_all_correct_usa (tests.test_validate_mrz.TestValidateMRZ)
