   - [# 351] SIR MRTD: 
--------------------------------------------------------------------------------
  218:             'match': match})
  219:     
  220:     
  221:     
- 222:     overall_data = (line2[0:10] + line2[13:20]) + line2[21:43]
+ 222:     overall_data = (line2[0:10] + line2[:20]) + line2[21:43]
  223:     overall_expected = str(calculate_check_digit(overall_data))
  224:     overall_stored = line2[43]
  225:     overall_match = overall_expected == overall_stored
  226:     if not overall_match:
--------------------------------------------------------------------------------
[0.00898 s] killed by test_validate_all_correct_usa (tests.test_validate_mrz.TestValidateMRZ)

   - [# 352] SIR MRTD: 
--------------------------------------------------------------------------------
  218:             'match': match})
  219:     
  220:     
  221:     
- 222:     overall_data = (line2[0:10] + line2[13:20]) + line2[21:43]
+ 222:     overall_data = (line2[0:10] + line2[13:]) + line2[21:43]
  223:     overall_expected = str(calculate_check_digit(overall_data))
  224:     overall_stored = line2[43]
  225:     overall_match = overall_expected == overall_stored
  226:     if not overall_match:
--------------------------------------------------------------------------------
[0.01082 s] killed by test_validate_all_correct_usa (tests.test_validate_mrz.TestValidateMRZ)

   - [# 353] SIR MRTD: 
--------------------------------------------------------------------------------
  218:             'match': match})
  219:     
  220:     
  221:     
- 222:     overall_data = (line2[0:10] + line2[13:20]) + line2[21:43]
+ 222:     overall_data = (line2[0:10] + line2[13:20]) + line2[:43]
  223:     overall_expected = str(calculate_check_digit(overall_data))
  224:     overall_stored = line2[43]
  225:     overall_match = overall_expected == overall_stored
  226:     if not overall_match:
--------------------------------------------------------------------------------
[0.01030 s] killed by test_validate_all_correct_usa (tests.test_validate_mrz.TestValidateMRZ)

   - [# 354] SIR MRTD: 
--------------------------------------------------------------------------------
  218:             'match': match})
  219:     
  220:     
  221:     
- 222:     overall_data = (line2[0:10] + line2[13:20]) + line2[21:43]
+ 222:     overall_data = (line2[0:10] + line2[13:20]) + line2[21:]
  223:     overall_expected = str(calculate_check_digit(overall_data))
  224:     overall_stored = line2[43]
  225:     overall_match = overall_expected == overall_stored
  226:     if not overall_match:
--------------------------------------------------------------------------------
[0.01037 s] killed by test_validate_all_correct_usa (tests.test_validate_mrz.TestValidateMRZ)
